{
  "guest": "Boz",
  "en": "Lenny (00:00:00):\nYou were basically the 10th engineer at Facebook. I imagine there was a lot of pain and suffering that people don't often hear about.\n\nAndrew ‘Boz’ Bosworth (00:00:07):\nI didn't sleep for more than four hours at a time. I'd wake up every four hours and check the report and see if anyone was attacking the site. They don't tell you about that stuff in the movies.\n\nLenny (00:00:14):\nYou worked 120 hours per week., you had no hobbies.\n\nAndrew ‘Boz’ Bosworth (00:00:17):\nI don't want to take away from the romanticism of it. It's just that most often, we hear those romantic stories from the successes. It's a healthy thing for people to want to throw themselves into something and take that risk, but it is not glamorous at the time.\n\nLenny (00:00:29):\nThe newsfeed. That was one of your early projects at Facebook. People did not want it. They were wrong, clearly.\n\nAndrew ‘Boz’ Bosworth (00:00:33):\nNow, newsfeed was an easier case than people suspect. Everyone was outraged at the same time as they immediately doubled their usage of the product.\n\nLenny (00:00:40):\nIn terms of the economic utility, the Venn diagram of Boz, of newsfeed and ads created $1 trillion of value.\n\n(00:00:48):\nToday, my guest is Andrew Bosworth, or Boz, as most people know him. Boz is the chief technology officer of Meta. He joined what was then called Facebook in early 2006 as one of the first engineers, and during his 18-year tenure at Meta, he created some of the most impactful and important products in internet history, including the Facebook newsfeed, which was the first ever algorithmically ranked content feed of any social network, and is basically what people think of as Facebook today.\n\n(00:01:17):\nHe also built the original Facebook mobile ads platform, which he then ran for another four years. He also helped build and scale the Facebook messaging system, the profile, the timeline, Facebook groups, and even the internal engineering boot camp. Most recently, he served as VP of ads and business platform, where he led engineering product, research, analytics, and design. And in 2017, he created the company's AR/VR organization, now called Reality Labs.\n\n(00:01:42):\nThese days, Andrew leads Meta's efforts in AR, VR and mixed reality, along with consumer hardware across Quest, Ray-Ban, Meta smart glasses, and more.\n\n(00:01:52):\nIn our wide-ranging conversation, we touch on so many important lessons and stories, what it was really like in the early days of Facebook, why you should be asking your manager for help more often, why communication is the job. Lessons from Meta's turnaround over the past couple of years, Boz's thoughts on the Apple Vision Pro, a bunch of leadership and career advice, what it was like to build the very first newsfeed, and lessons from that experience, and stories of failure and stories of success, and so much more.\n\n(00:02:22):\nIf you enjoy this podcast, don't forget to subscribe and follow it in your favorite podcasting app or YouTube. It's the best way to avoid missing future episodes, and it helps the podcast tremendously.\n\n(00:02:32):\nWith that, I bring you Andrew Bosworth, a.k.a. Boz, after a short word from our sponsors.\n\n(00:02:39):\nThis episode is brought to you by Vanta. When it comes to ensuring your company has top-notch security practices, things get complicated fast. Now you can assess risk, secure the trust of your customers, and automate compliance for SOC 2, ISO-27001, HIPAA and more, with a single platform, Vanta. Vanta's market-leading trust management platform helps you continuously monitor compliance, alongside reporting and tracking risks. Plus, you can save hours by completing security questionnaires with Vanta AI. Join thousands of global companies that use Vanta to automate evidence collection, unify risk management, and streamline security reviews. Get $1,000 off Vanta when you go to vanta.com/lenny. That's Vanta.com/lenny. This episode is brought to you by Eppo. Eppo is a next-generation, A-B testing and feature management platform, built by alums of Airbnb and Snowflake for modern growth teams. Companies like Twitch, Miro, ClickUp and DraftKings rely on Eppo to power their experiments. Experimentation is increasingly essential for driving growth and for understanding the performance of new features, and Eppo helps you increase experimentation velocity while unlocking rigorous deep analysis in a way that no other commercial tool does. When I was at Airbnb, one of the things that I loved most was our experimentation platform where I could set up experiments easily, troubleshoot issues, and analyze performance, all on my own. Eppo does all that and more with advanced statistical methods that can help you shave weeks off experiment time, an accessible UI for diving deeper into performance, and out-of-the-box reporting that helps you avoid annoying prolonged analytic cycles. Eppo also makes it easy for you to share experiment insights with your team, sparking new ideas for the A-B testing flywheel. Eppo powers experimentation across every use case, including product, growth, machine learning, monetization, and email marketing. Check out Eppo at geteppo.com/lenny, and 10x your experiment velocity. That's geteppo.com/lenny.\n\n(00:04:47):\nBoz, thank you so much for being here. Welcome to the podcast.\n\nAndrew ‘Boz’ Bosworth (00:04:55):\nThanks for having me. I've been a long-time fan of your program and all the things that you've been putting out, so I'm glad to finally get a chance to join.\n\nLenny (00:05:01):\nSame. I'm really excited to have you here. I have at least a billion questions I want to ask you. But I want to start with a few fun facts that I've found about you, and what if I go through them and then just pick one that stands out, and then tell the story behind it? How does that sound?\n\nAndrew ‘Boz’ Bosworth (00:05:17):\nAll right, sounds good.\n\nLenny (00:05:18):\nOkay. You went to 14 proms.\n\nAndrew ‘Boz’ Bosworth (00:05:22):\nYeah. It's true.\n\nLenny (00:05:22):\nOkay, I'm going to keep going. Okay.\n\nAndrew ‘Boz’ Bosworth (00:05:25):\nWow, that's a strong opener.\n\nLenny (00:05:27):\nThat might be the one. You were a national Taekwondo champion in college. You were Mark Zuckerberg's TA in college in a class on AI, which isn't actually how you landed at Facebook, from my understanding. Harvard was recruiting you to play football for them. You were very active in the 4-H Club, and you raised animals and showed them at county fairs when you were growing up. You once shared a stage with David Copperfield.\n\nAndrew ‘Boz’ Bosworth (00:05:52):\nThat's true.\n\nLenny (00:05:52):\nMC Hammer once told you that your outfit was stylish. And president George W. Bush complimented you on your shoes and the shine of your head.\n\nAndrew ‘Boz’ Bosworth (00:06:03):\nYeah, these are all true. I want to say, wow. First of all, I got to make sure that people understand, I was a national collegiate champion, in as a green belt, which that's like being the JV champion. Just so everyone's clear on what that is.\n\nLenny (00:06:15):\nW's a W.\n\nAndrew ‘Boz’ Bosworth (00:06:16):\nHeavyweight sparring. I'll tell... The prom story is a funny one. It's related to the 4-H story. I was a big-time 4-H'er, National 4-H Hall of Fame, did all this stuff there.\n\n(00:06:29):\nAs a comeup to that, 4-H is a wonderful program, youth program, it's coed program, and I was all over the state, all over the country, doing leadership events and doing these conferences, and doing a lot of public speaking.\n\n(00:06:39):\nAnd almost every 4-H event has a dance. People don't know that. At the end of a conference, at the end of the, literally camp, you'd go camping for a week, at the end there's a dance.\n\n(00:06:49):\nAnd so, as a consequence, the most important thing, if wanted to go to a lot of proms, I was a good dancer. And it turns out, the high-level bit, at least in the 1990s, for girls selecting who they might want to go to prom with was, will he and can he dance? And the answer with me was yes. And combine that with the fact that I knew a bunch of girls who went to different schools, that's the recipe for success right there, if that's the goal that somebody has. Two my junior year and 12 my senior year. I once went to three in one weekend, a Friday, a Saturday, and a Sunday night.\n\nLenny (00:07:21):\nAnother fun fact about you is you were basically the 10th engineer at Facebook, initially, way before it was a clear success story. I imagine there was a lot of pain and suffering and struggle that people don't often hear about those early days. They see a movie like The Social Network. It looks like, \"Oh, that was so much fun. I've got to start a company. It's going to become a trillion-dollar success story.\" I'm curious just what those early days were like. Are there memories that stand out to you?\n\nAndrew ‘Boz’ Bosworth (00:07:47):\nYeah, there's a bit of a joke in the 10th thing, which is me and five other guys all joined at the same time, and there was nine engineers before us. We joined the same day, so we're all the 10th engineer. So, somewhere between 10 and 16, depending on how you want to do the numeration on that.\n\n(00:07:59):\nI've written about this in my blog, and I tell this story a lot, which is it was fun, and there was tremendous camaraderie and memories that were formed, but they were formed in a kind of forge of really intense times.\n\n(00:08:13):\nAt that time, almost all of us lived within one mile of the office. We ate most of our meals together because we were working, not to say we weren't also friends, but because we were working, it's like, oh cool, you just roll into a meal and roll back into work.\n\n(00:08:26):\nAnd there's little things that you don't appreciate, which is like there was nobody to help you. There was no expert. And so, it wasn't like, \"Hey, I'm struggling with this one tricky problem. Who should I talk to?\" It's like, nobody. You should talk to yourself and figure this out. Or it's like, \"Oh, man. My servers are out of capacity.\" It's like, \"Cool. You should go to Fry's Electronics, you should buy a bunch of components, you should build a new server, and then you should run it. Maybe drive into the colo, rack it, and then get back and run it.\"\n\n(00:08:52):\nPeople really undervalue the fact that when you go to work, even a moderate mid-size corporation today, especially with the tremendous growth of startups supporting startups, things like payroll and finance and IT and HR, these things are professionally handled in many cases.\n\n(00:09:10):\nThat was just not the case in the early 2000s. It was just you, and your personal car, and whatever you wanted to do with your time.\n\n(00:09:18):\nSo, I don't want to take away from the romanticism of it, it's just that it's most often we hear those romantic stories from the successes. We so rarely hear somebody who went through really sacrificing a lot of my 20s from any kind of social or outgoing, fun environment.\n\n(00:09:37):\nIt paid off for me, so no one feels bad for me, nor should they. But there are other people who do the exact same thing, maybe they worked harder, maybe they were smarter, maybe they did better, and it didn't play out for them. And it's a big sacrifice.\n\n(00:09:48):\nAnd so, I love the enthusiasm for startups, I love startup culture. I think it's a healthy thing for people to want to throw themselves into something and take that risk. But it is not glamorous at the time. In retrospect, it's like, \"Oh, it can be...\" We have a little halo around it. But at the time, it doesn't feel glamorous.\n\nLenny (00:10:06):\nYeah. In this post you mentioned, you said that you worked 120 hours per week.\n\nAndrew ‘Boz’ Bosworth (00:10:07):\nYeah.\n\nLenny (00:10:10):\nYou had no hobbies, and you gained a lot of weight.\n\nAndrew ‘Boz’ Bosworth (00:10:15):\nYeah. We drank a lot to make up for it, so I gained a lot of... And you weren't eating healthy. It was crazy.\n\n(00:10:22):\nI think I've told this before. There was a time where one of the first things I built was an anti-spam, kind of anti-scraping defense mechanism. But we didn't have any ops support. There was no 24/7 online support.\n\n(00:10:35):\nSo, I built this tool. I had to wake up every four hours. For about two years, I didn't sleep for more than four hours at a time. I had to wake up every four hours and check the report, and to see if anyone was attacking the site. And if they were, I was up, and I had to go battle back. And if they weren't, cool, I'd go back to sleep. But that's the thing, they don't tell you about that stuff in the movies.\n\nLenny (00:10:55):\nThat's almost worse than having a kid, a newborn.\n\nAndrew ‘Boz’ Bosworth (00:10:59):\nAnd nobody asked me to do it. Nobody even asked me to do the anti-spam, anti-scraping stuff. I just thought it was a problem, and I went and did that, and that was the solution I come with. If I was a better engineer, maybe I'd have solved a better problem.\n\nLenny (00:11:11):\nSo, maybe just to close out that thread, when you talk to founders, what advice do you give them along these lines?\n\nAndrew ‘Boz’ Bosworth (00:11:18):\nI want to be cautious about this, because what I tell founders... The first thing I tell founders is that I've never been a founder, and I want to recognize the difference. I joined January 9th, 2006. That's almost two years after Mark started the company. I wasn't involved with fundraising, I didn't have to do any of that side of the things, and I didn't even have to deal with the board or the business side of things. I really was lucky, in a way, to have joined when I did.\n\n(00:11:42):\nBut the first thing I tell founders is like, \"You should take my advice with a grain of salt. I have not actually been in your shoes.\"\n\n(00:11:47):\nIf I can compliment you, really, one of the things I like about your program is, there's a whole system of professionals in our industry. And when I grew up in technology in the valley, you always heard about the ACM, right? The Association of Computing Machinery. You heard of these legendary professional organizations that supported people in our fields.\n\n(00:12:09):\nAnd by the nature of the rapid pace of change in the technology, and the nature of the engagement of those institutions, even academics, even academia broadly, kind of are out of touch. The tools that you got from those places weren't useful in our field.\n\n(00:12:23):\nSo, I do think the mentorship that we give each other has been a critical and sustaining resource. There is, today, now, resources like your podcasts and your newsletter that are actually really designed to help people who are professionals in our industry in a way that is almost kind of missing for 15, 20 years, and I love to see that. Because if you're an up-and-coming [inaudible 00:12:45], literally you used to have to know somebody and ask them a question.\n\n(00:12:48):\nAnd so, a lot of times what I'm helping founders with, I can help them with the strategy, I can help them think through the technology choices, I can help through business, I can think through the management, the organization structure. But I also try to be very clear, there's a bunch of stuff that I just was never exposed to.\n\n(00:13:00):\nSo, even as we just talk about how tough it was for the average engineer joining Facebook in 2006, man, it was even tougher for Mark Zuckerberg in 2004, probably. And that's a story that's been told, I'm sure, but still. So, I think these are both... It's almost all scale and variant. No matter how far you dial back, the challenges are interesting and are worth talking about.\n\nLenny (00:13:22):\nOne of maybe your most popular posts is this quote that you share about the advice you often give. What you say is, \"The advice I find I have to give more frequently than any other in my career, as a manager, a board member, an advisor and a friend, is for people to more directly leverage their leaders.\" Can you talk about that and what that means, and what that looks like?\n\nAndrew ‘Boz’ Bosworth (00:13:40):\nIt's such a normal and natural healthy thing. And by the way, we do it in our personal relationships. Like I said in the post, we want to do it ourselves. We want to do it ourselves to prove to everyone that we can do it ourselves.\n\n(00:13:52):\nAnd we think in our heads, \"If I ask for help, haven't I already given up that goal? Haven't I just admitted defeat on one of my top level goals, which is to demonstrate that I can do it myself?\"\n\n(00:14:04):\nBut what so often we forget is, more often than not, your job is not to do it yourself. Your job is to get it done, is to have the thing done, done well, done right, done competently. And a lot of times, the tools that you need to do that live with your manager, with your partner, with your advisor, with your mentor. That's where they live.\n\n(00:14:25):\nSo, how many times as a manager have I gone through, and somebody's told them, \"Here's the job.\" They're like, \"I got it.\" They go off, they come back, it's done, it's wrong. And I'm not blaming them for it being wrong. They didn't check in with me. They misunderstood. We miscommunicated. I'll take the L on that. That's no problem.\n\n(00:14:42):\nBut here we are, six months later, it's not done right because they misunderstood the brief. We miscommunicated with the brief.\n\n(00:14:49):\nOr they come back, and it took a year. And I'm like, \"Why did this take a year instead of six months?\" And they're like, \"Oh, man. I had all these things I had to deal with.\" Where, if they had emailed me, I could have bulldozed that stuff. I could have cleared the path. I could have said, \" Oh, no, no, no. Don't worry about that. This is the thing.\" And then we'd have been done six months sooner, and they would've been less frustrated. And so, light touches.\n\n(00:15:09):\nNow, I do think as a manager we also have a job to say, \"Hey, that's kind of the work, so you got to kind of go figure that out.\" And one of my things I always tell my managers, one of the most powerful things we do is refuse to rule. Someone will bring me a thing. A lot of times we feel obligated to weigh in and help. I'll be like, \"Nope, but look, I think you've got it. I think the challenges you're facing are the right challenges. I think you're approaching it in the right way. Just do your best there.\" And that's what it is. And so, there is a responsibility as well for those of us who are leaders, mentors, advisors, board members to do that.\n\n(00:15:39):\nBut, by the way, we do this... Personal relationships. You're with your partner, and you're trying to do something the right way, but you're not talking to them about it. You're just taking a huge risk there, and for very little reward. They're not going to be mad if you ask them, like, \"Hey, is this how you wanted it done? I don't know.\"\n\n(00:15:56):\nAnd so, I do think it's kind of funny how much we build these castles in our mind, these little silos that keep us from engaging the structures that are built around us, that are designed to help us succeed. I saw this great quote, actually just yesterday. I saw Patrick Stewart, who is one of my favorite actors of all time, and whose characters I love, and he talked about people going on casting calls. And this is a brutal thing for actors, right? You're going on 30, 40 things, you're getting rejected. It's tough. Everyone's kind of heard about this. And he said, \"No one wants you to succeed more than the person you are auditioning for, because they want you to be awesome. Because as soon as you are awesome, they're done. They want you to be amazing.\"\n\n(00:16:37):\nThat's like your manager. Nobody wants you to be more awesome than your manager does, because when you're amazing, your manager, his life gets easier, her life gets easier. So, I just think that's the mentality we get into is like, \"No, no, no. They're testing me.\" They're not. They are rooting for you. I promise you that.\n\nLenny (00:16:53):\nI love that advice. I imagine the reason people don't do this, as you said, is they don't want their managers to think they don't know what they're doing, or they can't solve it. Do you have any advice and guidance for when it makes sense to go reach out and ask?\n\nAndrew ‘Boz’ Bosworth (00:17:06):\nOne of the things I think, for people who are timid about this especially, is I think you can put a framing around it that's really easy for your manager to engage with. You can say, \"Hey, I'm making progress on this. This is what I'm blocked on, this is the current program.\" And I'll even say, \"Hey, if this all looks good to you, no response required. If there is something here that you want me to do better, different, that you think you could help with, let me know.\"\n\n(00:17:32):\nI love a typed, five-, 10-sentence email, \"No response required. Here's where things are.\" Even if everything is going really well, I'm like, cool, this person understands the urgency, they understand the assignment, and they're giving me a little heartbeat, a little ping back.\n\n(00:17:53):\nAnd then also, if two weeks later, let's say the blocking issue is bad, then you say, \"Hey, I am sorry, but I do actually need your help now. I'm actually blocked on this thing.\" I have the context. I have a mental model of you toiling away on the right thing, on the thing I asked you to do over there. Even then, when you're blocked, you can make my life super easy. Like, \"Hey, what I'd love for you to do, if you could send an email to this person, here's a draft with this thought, that would help.\"\n\n(00:18:23):\nOr it's like, here are specific questions framed up. \"I think this is what you want. Is this right? Yes or no? If no, okay, we'll come back and we'll spend more time. If yes, we're all good.\" So now, not only am I up to speed, I have a mental model, I'm engaged. Also, you've made it super cheap for me to help you. And people are always surprised. People who work for me are always surprised when I tell them how big a part of my job is doing these little types of things.\n\n(00:18:53):\nIt's a little spinning plates at my scale. I've got 10,000 or 15,000 employees, depending on how you want to count different things. And so, you're just like, every now and then I got to get a whole new plate, a whole new rod, and just really put the effort into it. But for the most part, I'm just trying to touch everything and keep the momentum going. And so, if something falls, and somebody didn't tell me that \"Hey, we're losing rotational velocity here. We're losing momentum.\" Oh, I'm bummed. I'm like, \"Ah, now that plate fell. I got to start a whole new thing over here now.\"\n\n(00:19:22):\nSo, I think people underestimate. They think of my job differently than my job actually... My job is actually tons of little touches.\n\nLenny (00:19:29):\nSo, I think a key takeaway here is, one, index more towards asking your manager and leaders for help. And I love this way of framing it of, it doesn't always need to be like, \"Here's what I need from you.\" It's, \"Here's what's happening. Here's things that might be blocking me. Here's questions I have. Here's things that are going on.\"\n\n(00:19:44):\nThis is actually similar to something I found really powerful that I'll share real quickly, this idea of a state of... I call it the State of Lenny email. And I sent this email to my manager every week. The State of Lenny. It's kind of like State of the Union. And it's, \"Here's my current priorities, here's what's on my mind broadly, and then here's blockers that I need your help with.\n\nAndrew ‘Boz’ Bosworth (00:20:02):\nWe actually used to have a format for that we called HPMs. Highlight, people, me. And every manager at Facebook from like 2008 to like 2014 would send to their manager, or even their leadership group. I mean, at one point when I was running what we called comm apps, I just sent it to Zuck and the whole leadership group.\n\n(00:20:24):\nIt's like, what's the highlights include? And it highlights [inaudible 00:20:27] flow. What's the big ticket things you need to know? Where are people? Like is somebody in trouble? Is somebody at risk? Is somebody doing really amazing work that needs a shout-out? And then me, how are you personally doing? HPMs, we called them.\n\n(00:20:39):\nActually, it's funny. I hadn't thought about that in a long time. But yeah, no, I think this kind of thing can work. And look, every manager is different, so even at the Meta level, by the way, is another success. I think what people do is they want to treat every manager the same, and that's not going to work because every manager is different.\n\n(00:20:54):\nBut every manager, you can ask, \"How do you like to get updates?\" You can ask them when you first start working with them. Like, \"Hey, what's your cadence? How do you like to stay informed?\" And so, for me, I do regular one-on-ones. As the org's has gotten bigger, those have gotten more distant, so people have replaced those with more written things.\n\n(00:21:11):\nBut no manager will get pissed at you if you're like, \"How do you like to get information about me?\" That's a totally reasonable thing to ask.\n\nLenny (00:21:18):\nI love the specific idea you shared of just drafting the email to say the other team leader, \"Here's what I need you to tell them. That would really unblock this thing.\" And that's such a cool idea.\n\nAndrew ‘Boz’ Bosworth (00:21:27):\nBy the way, I always put my own... I don't take that copy paste it. I'm always looking at that and be like, \"Okay, I understand.\" A lot of it is actually not about what you want the other person to hear, it's about the voice, the tone.\n\n(00:21:41):\nIt includes a lot of history. I don't know. Have you been going back and forth with them for 12 rounds, and this is going to feel to them like I'm really coming over the top? Or is this like, \"Hey, first time you're hearing about this, my bad. Here's what we're doing. Need your help.\"\n\n(00:21:54):\nSo, a lot of that isn't even about making my life easy because I want to copy paste. A lot of it is, actually, there's a rich set of information in how you tone and how you draft that note that's going to help me land it correctly and not feel like I'm just out of band, heavy coming in.\n\nLenny (00:22:11):\nThis touches on something that I often hear is very core to the way Meta works, which is transparency. Anyone can ask Zuck questions at the Q&A's. People are encouraged to post constantly internally of what they're thinking, what they're working on. All the data is shared publicly. Which often leads to leaks, which I hear you hate, and that is a pet peeve of yours.\n\nAndrew ‘Boz’ Bosworth (00:22:32):\nJust feels like a violation of the team trust. Just feels like... I grew up with playing sports, right? I was football, soccer, track. And you just can't imagine one of your guys calling out the play to the other team. Can you imagine what you would do in that case? \"You're off the team. I'm sorry, you can't be here.\" Anyways, sorry. Carry on.\n\nLenny (00:22:48):\nYeah, and there's so many more people, it's hard to find. Who is this? So, with this downside as an example, and I imagine there's other downsides also takes a lot of work, and it puts people on the spot a lot of times, what have you seen as benefits and why is that such a big part of Meta's way of working?\n\nAndrew ‘Boz’ Bosworth (00:23:05):\nYeah. This kind of comes back to, I think, the principle that really good, talented people, you want to leverage them fully. You really want to make sure that they are fully leveraged. And so, anytime they have the wrong information, or they don't have the information, you've now blocked one of the economically most valuable things that your company possesses, which is this person's time, attention, talent. Not only that, you've also made them more frustrated, and now they are more likely to leave.\n\n(00:23:35):\nIf the lifeblood of any company are the people inside of it who collectively commit to some kind of a goal and a mission and work together, then you want to maximize that potential. And creating this really open information ecosystem is one of the ways that we do that. So often, great, phenomenal work that has happened at our company has not come from this one top-down mandate, but has come from people understanding not just what we're trying to accomplish top down, but also having way more information at their disposal to be able to act on it.\n\n(00:24:16):\nPeople talk about top-down or bottoms-up culture, and it's a bit of a myth, in my opinion. If you've ever met Mark Zuckerberg, it's not a bottoms-up thing. The ideas that we're pursuing are Mark Zuckerberg's ideas, first and foremost. That's not to say that he's not open to new ones, and of course he is, and that's a form of bottom-up, people can bring ideas to him and he internalizes them and acts them or not. But when he brings things top-down, he's not micromanaging, he's in the details. I'll be careful on that.\n\n(00:24:44):\nBut he does create the space for you to bring back three or four versions of the thing that he's talking about, and then he shapes it from there. And you can't do that if there's... If you don't have degrees of freedom, sure, but also if you don't have the information. Otherwise, if you don't have the information available, what we're trying to accomplish, why we're trying to do it, what the infrastructure is like, what the availability is like, what the performance is going to be like, well, you just are stuck. You're just going to have to follow the script. That's very boring for high-talent, high-creativity, high-engaged people.\n\n(00:25:15):\nNow, it does come at a tremendous price. You have to get really good at managing information on the incoming. Most people at most companies consume all the information that's given to them, but the information itself is carefully managed. They're getting all the information they're intended to get.\n\n(00:25:32):\nWe've turned that on its head, and it sounds great, but it's not free. Even somebody senior coming from outside of the company to the company, one of the things I have to coach them on is, how do you find signal amongst all the noise?\n\n(00:25:45):\nYou have to have a system for managing your information. You have to have a system for triaging the incoming, getting rid of a bunch of stuff that is on the wrong channel, or it doesn't matter to you, figuring out what's the... groups that you want to be a part of, but you consume only when you choose to and-\n\nAndrew ‘Boz’ Bosworth (00:26:00):\n... groups that you want to be a part of but you consume only when you choose to. And where are the things where you're getting push notice? Like that's the real time thing, and that takes some time.\n\nLenny (00:26:08):\nThis point you made about bottom up versus top down is really interesting, because, when I think of Meta, I think it's a very bottom up culture. I hear everyone comes up with their ideas, runs experiments, is very encouraged to just try stuff, and it's really interesting to hear that. And it makes a lot of sense that most of the big ideas actually do come from the top.\n\nAndrew ‘Boz’ Bosworth (00:26:26):\nIt's of these mythology things. I don't think it's the wrong... As a contract, it's more bottoms up than many other companies, because you do have these degrees of freedom within the construct. But make no mistake, like Mark or me or Chris Cox or Javi, they have very strong opinions about what we should be doing as a company, and your bottoms up-ness works within that framework. But it is true that you can ask Mark any question, and he's going to answer it. Same with me, same with Chris, same with Javi and also that we certainly take inspiration from the discussion that we have with employees. So I don't know, it's just not as black and white as people tend to paint it.\n\nLenny (00:27:02):\nI think one of the biggest lessons here is making it at least feel like you have a lot of say, even though a company is very, \"Here's the big strategic [inaudible 00:27:10],\" you're very good at making people feel like they can have an impact and a say.\n\nAndrew ‘Boz’ Bosworth (00:27:14):\nAnd can I tell you, the most important thing is just giving people clear guidelines so they know where they... Like, \"Where do they have space and where do they have no space?\" One of the things that we go in these reviews with Mark or my team with me I'm sure, and I'm like, \"For this part of the UI, it is going to... Like, I will draw it for you. It's going to be like this.\" And this other part. I'm like, \"Cool, that's important, too. I don't have a clear vision of it. Why don't you do it?\" So there's just really clear guardrails of like, \"Okay, where are we just on assignment? And where do we have more flexibility?\"\n\nLenny (00:27:45):\nIs there an example of that that comes to mind where you were just very in the details and drawing the screen?\n\nAndrew ‘Boz’ Bosworth (00:27:51):\nOver the course of time, there's been quite a few examples. I think early on, when we were working on News Feed, mark was absolutely whiteboarding every single pixel that the team had to put on the front end. On the back end, he was like, \"Make it rank, have some ranking.\" So I felt like I was lucky there. I was just like, \"Cool, I'm off to the races on some ranking stuff.\" And Chris Cox and all these other guys are having to really pixel-match these things. But it's not always that way by the way. So now fast-forward and we're talking about ranking, it's not like Mark is always hands-off on that. When we got into modernizing our ranking systems, which we've done over the last five years, Mark was heavily involved and like, \" Hey, what's the mix shift and how are you weighing different things?\"\n\n(00:28:33):\nAnd so it can go both ways. For me personally, I've gotten really involved in some relatively esoteric things. I was really adamant, for example, that hand tracking and mixed reality make it into the headset. Let's just say that there weren't any supporters in the team. Obviously we had a hand tracking team, which is phenomenal, mixed reality team, but there was a lot of people who were like... They did not feel those features were going to be critical for this to become a mainstream device. I always believed that they were for ease of use and for... So I just really forced the issue and didn't give anyone any room and held really high standards for the performance benchmarks we were going to hit on the hand tracking. And teams told me it was impossible. And it wasn't. It did great.\n\nLenny (00:29:11):\nThis touches on something that comes up a lot on this podcast. And there's this debate between how in-the-weeds founders and execs should be, whether they delegate, empower, versus, \"No, we're just going to do it this way. I'm going to be very involved in every mock.\" And there's always this up and down that happens where it's like, \"Okay, cool, we're going to let people run and do their thing,\" and then things start to not work as well often. And then, \"We're going to take back control.\" You have just a perspective on when it makes sense to go deep, how founders execs should think about that?\n\nAndrew ‘Boz’ Bosworth (00:29:41):\nSuch a useless answer for founders, it depends on the weeds. There are some weeds that really matter and there's some weeds that really just don't, and I should say, that doesn't mean they don't matter at all. You have to do them, but they aren't the hinge upon which success or failure will happen. Yeah, there's people I really respect, Brian Chesky's been on and said, \"Look, the Airbnb is going to work only on the things that I can work on. It's that's the extent of what it's going to do.\" And that's a super extreme form of it. I have a lot of respect for him and how they're working things. I think that if you have great super talented people that you can trust who can own bigger pieces, that's one option. If there are ways to structure it so that you can check in effectively and make sure that it's on track, that's another way to structure it.\n\n(00:30:27):\nAnd there probably is still work happening at Airbnb, that has to happen, finance and accounting and HR, that Brian isn't personally managing. So there are clearly non-technical areas that we do. Or legal. There are areas that we do trust that this is happening at. And so I think a lot of founders regret delegating too much, from my conversations. And I totally get that. Or they delegated something critical that really turned out to be the most important thing. For me, the judgment is like, \"How do you, most important, determine what is what matters the most?\" And so Mark, we joke inside of Meta, to this day, we call it the eye of Sauron. When Mark has determined that the thing that you're working on is the most important thing, there is no detail too small for him to notice.\n\n(00:31:17):\nHe will be in a review, and in the same review. We'll be like, \"Strategically, I think we're off course. And also, this one pixel is definitely wrong. You have to fix that.\" That's a big range. Frankly, I'll be a little bit self-congratulatory, I pride myself on being able to do the same. And I think people who work with me often comment that the style of leadership that we have, and I think Chris Cox is the same, is where it's like we will go where hide a low on the things that matter a ton. And there's a bunch of other things that certainly matter. We're glad we're doing them, but either they have pretty clear roadmaps, pretty clear examples in the industry, or it's like that's a feature that you have to have but isn't going to determine success or failure. So getting it into rough shape and then iterating on it is fine. And so I think it really does depend on the weeds, how deep you want to get.\n\nLenny (00:32:08):\nIt's so funny, I use exactly that same metaphor, the eye of Sauron, when I talk about working on things that Airbnb that matter a lot to Brian. And my advice to people is, \"You don't want to be in that eye of Sauron for too long in your career, because you're just going to burn out if you're working on the most important thing all the time, but want to be close. You don't want to be in the Shire, but you want to be around the [inaudible 00:32:26].\n\nAndrew ‘Boz’ Bosworth (00:32:26):\nThat's right. They're both... So I worked for years in ads. From 2012 to 2017, I ran ads in a business platform, this big ads group, and it was an area where certainly it was very important, but Mark had so many other things going on with the transition to mobile, he did kind of delegate it to me. And it was awesome, and it was so cool to have that kind of trust from him. And also, you're constantly terrified, because like, \"Mark does not know. What if this is all...\" My leads would be worried, because they just hadn't had a review with Mark in a while. And it's like, yeah, you suffer in the intensity of the gaze of Sauron. You also suffer in the shadow of its absence. There's no perfect place to be.\n\nLenny (00:33:09):\nThat's hilarious. I'm trying to think of the part of Middle Earth that is a metaphor for that.\n\nAndrew ‘Boz’ Bosworth (00:33:14):\nYeah.\n\nLenny (00:33:15):\nOkay, so you talked about the News Feed, which was one of your very earliest projects at Facebook. Here's a couple fun facts I know about the News Feed. One is that it was the very first algorithmic News Feed of its kind of any social network and maybe of any sort of product like this. And two, it was the very first AI code that was written at Facebook to rank the actual News Feed. So there were a lot of firsts, and clearly this became a huge deal. The News Feed is essentially what people think of when they think of Facebook now, but it was super controversial when it came out. People were very against this. They did not want to be sharing this much information with people, or so they thought, and then they realized eventually, \"Oh, this is actually exactly what I want.\" What did you learn from going through that experience of building something that people initially reject and then later realize that they actually do want this and this is exactly what they're waiting for?\n\nAndrew ‘Boz’ Bosworth (00:34:08):\nThis is a story that you tell a lot actually through your interviews, which is just like, \"You have to have conviction in what you're building.\" You're choosing your customers as much as your customers are choosing you, is one way I think about it sometimes, and one mistake that you do see sometimes startups make is they get an early cohort of users whose needs actually take them kind of orthogonal to a larger market. And so they become kind of held hostage by their earliest customers now. So time and time again, we've had a vision for what we thought this should look like, and it wasn't the thing we were delivering right now. And so people who were using the thing we currently had were not sure that that change was what they wanted. But we had a confidence that over time they would, and we're not always right, but in these cases we were right. Now News Feed was an easier case than people suspect, because everyone was outraged at the same time as they immediately doubled their usage of the product.\n\n(00:35:05):\nSo we had a few advantages there, which was, it was literally like everyone was like, \"I hate this so much.\" And they would refresh, refresh, refresh. And so we were like, Okay, wait, there's cognitive dissonance here between what the stated preferences and what the revealed preferences are in the economic sense. So News Feed was a little easier than people suspect, to us, to stick with. But people sometimes misunderstand that. They think, \"Oh, the lesson is don't listen to your customers. Not at all.\" And we certainly care a tremendous amount. And even with News Feed, we did actually screw some things up. I kind of always make this joke that it's almost like... You know when you're at the party and music's loud, you're talking to somebody and the music cuts out right when you're saying something at a super high volume, and so everyone in the party hears the last thing you said?\n\n(00:35:42):\nNow you were saying it in a public place, so it wasn't like it was a private comment, but you also didn't mean to broadcast it at that volume. We kind of did that to the entire user base. We took what had been wall posts, which sure, anybody could have gone to that profile and seen and then put it kind of on blast, on Main, as the kids say these days, \"Put it on Main,\" and someone's like, \"Ah.\" So we did that. I don't want to say it like... We did screw things up. It wasn't like, \"Oh, this is a clause execution.\" So another thing to know is like, \"When did you screw something small up, and when did you do something big up?\" When is the thing itself wrong, versus when were the details wrong? That is an art. That is a real art, and you don't always have user data to determine it like we did.\n\n(00:36:25):\nAnd so a lot of that is, \"Do you have a clear vision and intuition for what you expected to happen?\" And then what happened instead and can you diagnose the delta there? So in the News Feed case, we made a bunch of little mistakes. The thing itself was right, and I really am quite proud of the work we did there. Me and Chris Cox at the most core probably in the engineering side, which you saw as the PM, there was no ranked feeds before that. We did have some AI that I built before for the anti-spam, anti... things, but it was pretty rudimentary, but it was probably the first consumer AI that was in a website of that kind around content. And we built the most efficient monetizing surface in history outside of Search, I think. [inaudible 00:37:04] for those who are curious, I don't use monetization because I think money's the most important thing. I do think it suggests the economic power you've created, which I do think correlates very strongly with human utility. Although obviously I respect that some people may disagree.\n\nLenny (00:37:17):\nIn terms of the economic utility, the Venn diagram of Boz, of News Feed and ads, create $1 trillion dollars of value.\n\nAndrew ‘Boz’ Bosworth (00:37:24):\nIt's not-\n\nLenny (00:37:24):\nWell done.\n\nAndrew ‘Boz’ Bosworth (00:37:25):\nIt's not nothing, not nothing.\n\nLenny (00:37:27):\n[inaudible 00:37:27].\n\nAndrew ‘Boz’ Bosworth (00:37:27):\nWe're proud of that work.\n\nLenny (00:37:28):\nYou have this quote in one of your posts about the News Feed where you said, \"It consumed me more fully than anything in life had ever consumed me. It opened up to me the truth that when you're passionate about something, you do better work, you do smarter work and you're, in order of magnitude, more productive.\"\n\nAndrew ‘Boz’ Bosworth (00:37:43):\nThere's no substitute for it. One thing I've learned about myself since that post actually is just the degree to which I am somebody who is inclined to be passionate about things. And it's a gift that I'm lucky to have, and I understand that's not every person. And so actually the ads thing is a good example. When Mark told me to go work on ads, I was like, \" No, I don't want to. I don't think I have a passion for that.\" I had this idea of myself. I had a very strong identity of myself as this AI infrastructure product guy, and I was working in this space and nope, I was wrong. I just am a guy who gets excited about things. Once I get into ads, it's like, \"Oh, this is fascinating. It's a three-sided marketplace, and there's all these different...\" It felt like I was playing chess times in terms of the moves with the other players in the industry, and I was super pumped about that.\n\n(00:38:26):\nAnd then when he wanted me to work on hardware, I was like, \"No, I'm not. I'm a software guy. I'm a software guy, Mark.\" And now, I love this work. That's such a fascinating space that I've learned so much. So I do think that's right. I do think what I find something I'm passionate about that's good. What I have learned since then is to give myself a space to understand if I can get passionate about it. Now, there are parts of jobs that I've had before where I just never found the passion, and after six months I just have to move on. Literally it's like I'll either quit, get fired, I'm doing bad work, I don't care about the work. And so I do have a self-awareness. It's not that I can get passionate about anything, but I do have a pretty broad palette, it turns out.\n\nLenny (00:39:01):\nI think that's a really interesting career lesson of, \"Don't assume you won't be excited about something that may come up.\" Is there anything there that you'd share with folks of just like, \"Explore it, give it six months, see if you can get excited about it?\"\n\nAndrew ‘Boz’ Bosworth (00:39:14):\nAbsolutely. So I have a very unusual career arc in some ways, which is I really almost changed jobs every six months for a long time. I was working on this integrity stuff with News Feed in the background. Then I was working on News Feed for about a year. Then I worked on site speed and infrastructure and detecting SAVs and issues. And then I worked on Bootcamp, and then I worked on messaging and groups. I had this really funny thing. I was kind of joking it was like, for those who are old enough to remember Karate Kid, I felt like I was painting a lot of fences, waxing a lot of cars, and at the end I knew karate. I was like at the end, at the end I had the payoff, because I'd gone through and I'd met a lot of people and I'd worked in these different areas and I understood different dynamics. Well, other people who joined in my cohort were getting promoted, but they were in a single track. They just stayed in one place and they got promoted, whereas I kept moving around. And it probably at some point early in my career felt like I was moving more slowly relative to my peers. And then when I finally turned the corner, really with the ads appointment, which I did for five years, I went vertical. I just like my career went vertical. And since then I've kind of been on that trajectory. And so advice I most often give people, for me at least, the lesson that I take from this, is I just was willing to learn aggressively. I would move because I wasn't learning enough. I was bored, and so I wasn't learning enough new stuff. And what was cool about finally getting to the ads job, and likewise in the job I'm in now, is those jobs, I learned a ton for five years. I'd never stopped learning in those jobs. You will occasionally find those jobs where they're super deep and you can just keep learning.\n\n(00:40:50):\nMeanwhile, a lot of my friends whose careers were on a better trajectory [inaudible 00:40:55] then earlier, they literally got bored of what they were doing, but they didn't have any place to jump to. There wasn't some other... They'd become domain specialists in a domain that they'd kind of exhausted for themselves. And maybe they'd even stuck around longer than they wanted to because it was comfortable or because the company wanted them to. And it ended up kind of being a hindrance to them in the middle of their career. And so for me, it's like, \"Jump into new things, give it six months. If it's not the thing, no problem. You just built a ton of new skills that's going to come in handy, I promise you that. Keep going.\" And likewise, when you do make that jump early career, optimize for learning, optimize for... Think about a compound interest. It's like the first 10 years of compound interest don't look that impressive. It's like after 10 years it starts to look good.\n\nLenny (00:41:43):\nI love that advice. It's similar advice I always give of, \"Variety of experience often ends up being the most valuable thing you build over time,\" just trying to bunch of stuff, doing some internal tools, maybe working on customer support, I don't know, trust and safety, user-facing products, infrastructure. I'm thinking from a PM's perspective, maybe an engineers, and other functions. One question along those lines. So we talked about the eye of Sauron and working on the most important thing at the company. Do you have any advice on how much of your career you should be working in that center?\n\nAndrew ‘Boz’ Bosworth (00:42:12):\nYeah, listen, [inaudible 00:42:12] being equal, I think there's two really good places to be. I think one is carrying a lot of water in areas that the company's not paying attention to but you are important. And it needs to be a lot. You got to own that stuff and really move mountains over there, because I promise you, as an executive, when there's a huge dam holding up the floodwaters, you respect the heck out of the person who is holding that dam up. You're like, \"You keep doing that, Atlas, that is good work over there.\" The second-best place to be, or maybe equally, is on the most important thing. And on the most important thing, that's where you get to the advice that Eric Schmidt gave Sheryl Sandberg, which is like, \"Hey, it's a rocket ship. Get on. Don't ask what seat I'm in. Just get on.\"\n\n(00:42:59):\nIf it's the most important thing, you're going to get a smaller piece. Everyone wants to be there. Get the piece. If it's the most important thing, get the piece that you can crush, kill, do a great job at and grow from, because you're going to get a ton of visibility, you're going to get a ton of experience. You're going to see what it looks like in the fire, in the fire, and that is invaluable. You will use that everywhere. And so I say that. That's at project selection time, but now I'll be cautious. Understand, projects that start in the fire, hopefully, are forged in some manner of metal that cools and is no longer in the fire, like God willing. And likewise, things like dams that are holding up floodwaters have a tendency to crack or break or floods overcome [inaudible 00:43:42]. So I think you do want to be at selection time in one of those two places, but then you also... You're going to stick with the ride.\n\n(00:43:50):\nAnd again, to my point, if you're not engaged, if you aren't doing great work, if you don't love it, then move on. If you've exhausted it, you used to love it, but you don't anymore, move on. If you still love it and you're engaged, great. That's cool. That's a great thing. You deserve to go from the forge to the dam and back over time. You don't have to always just keep jumping onto the latest fire. I tried to do that once, after the ad [inaudible 00:44:14]. Actually, so I spent six months and we built the first mobile ad product in 2012 and kind of saved the IPO, which had gotten pretty grim [inaudible 00:44:23]-\n\nLenny (00:44:23):\nYeah, I remember that.\n\nAndrew ‘Boz’ Bosworth (00:44:24):\n... that point. And I told Mark, I was like, \"This is so fun. Maybe you can just keep doing this, just putting me on the biggest fire every six months.\" And he turns to me, he said, \"Buzz, that's not a real job.\"\n\n(00:44:32):\nHe's like, \"I need you to stay here and usher this forward,\" which I did for the next four and a half years. And it was amazing. It was amazing. And again, I do give him such... It's funny, I'm going to get a hard time in this. One of our biggest critics as well as being one of his biggest fans. I have both those jobs, but today we're talking about stuff that I think Mark really demonstrates really well. And he did a great job of pushing me in my career to different places where I didn't think I could succeed. And he saw the opportunity that made it happen.\n\nLenny (00:45:01):\nWhat have you learned about that, giving Mark negative criticism, anything that he accepts? What do you learned about that?\n\nAndrew ‘Boz’ Bosworth (00:45:08):\nMark's voracious for all information and all points of view. One of the things that's pretty interesting, I talked earlier about how much, as a founder, I think especially, you have to have tremendous conviction. You just have to have a tremendous degree of confidence. And I think Mark is somebody who is maybe the strongest willpower of a person I've ever met, just in a pure willpower sense. One thing that's interesting about Mark is you'll give him feedback, he listens. He's a kind person to work for, so you'll give him feedback, and he'll listen. Truly. He'll most often tell you that you're wrong, why you're wrong. That's just like most often. And what will happen is... It's uncanny. It's like over the course of the next week or two, you'll just see shifts. And I don't think he's doing it...\n\n(00:45:55):\nI've always joked that the information gets to him. So much information every day gets him. And then at night, he re-compiles the whole world with all that information and comes back. And by the way, this is not just true about product work. In my head, I was thinking about product stuff where he was like, \"Hey, I think this product is doing this wrong.\" He's like, \"No, no, that's why it's not that way.\" And the product will start to shift. Also to give him feedback just on his own presence in a meeting or delivery, he'll be like, \"Oh, well here's why I did it that way.\" And then a couple weeks later, you'll get in a similar situation, and he will moderate how he shows up. So I actually find him somebody who's really satisfying to give him feedback. It really works. It's very effective, but you do have to take the long view on it. And he will have a... The things he did, he didn't do an accident. He will have a reason why he did them the way he did them.\n\nLenny (00:46:39):\nIt's a great example of strong opinions, loosely held.\n\nAndrew ‘Boz’ Bosworth (00:46:42):\nYeah, that's right.\n\nLenny (00:46:44):\nIt also makes me think, I think you used the compiler analogy. I'm thinking the model training. He's retrained his model overnight.\n\nAndrew ‘Boz’ Bosworth (00:46:50):\nYeah, that's right. It's funny. One of the things that's so funny about Mark is if you give him some feedback in the morning, the next six meetings he has, whether it's about that product or not, he'll ask people what they think of that feedback. He won't attribute. He's just like, \"Hey, what do you think about this in this product? And so you'll be in a meeting with him and you'll see him doing it. He'll come to the meeting with you about some other topic. He'll be like, \"Hey boss, what do you think about this product and this idea?\" And so he will, over the course of the day, take that little note and kind of pressure test it, and he loves to triangulate. Where are all the points of view on this that maybe you didn't see? So he really values a broad perspective on each thing that's being discussed, which is really fun.\n\nLenny (00:47:29):\nTrying to get more training data for his model. I get it.\n\nAndrew ‘Boz’ Bosworth (00:47:32):\nYou can't get me to call Mark an LLM. That's not fair. That's [inaudible 00:47:35].\n\nLenny (00:47:35):\nWe could all hope to be as smart as Mark. As you were talking, I noticed your tattoos, and it reminded me that you've got at least two tattoos that I'm aware of.\n\nAndrew ‘Boz’ Bosworth (00:47:35):\nOh, yeah.\n\nLenny (00:47:45):\nOne is of California, which I completely understand. California is a very special place, but you have this other tattoo that is just the words Veritas. Can you talk about what that's about and why that's important to you?\n\nAndrew ‘Boz’ Bosworth (00:47:58):\nThe funny thing about tattoos in general is I came out of high school, I was like... I don't know if there was an archetype for me, but I didn't drink until I was 21. I was a very rule-following person. I was like, \"Why are you going to get a tattoo, affect your body? \"Why would you dye your hair? Just let it be what it was.\" And some of this was I think I was somebody who was privileged and had a great deal of self-confidence in who I was and what I wanted to be, and that was fine. But in some ways I was also weirdly judgey about other people in a way that's kind of off- brain for me, certainly today it would be, but at the time, getting a tattoo is a big deal for me. I was like, \"Oh, this is just the vehicle for my life and you can do whatever you want with it. And it's not like a... It's something that you possess, and if you feel like if you want to decorate it, you can decorate it.\n\n(00:48:47):\nAnd so getting a tattoo was a big deal to me actually, and I completely shifted my mindset of how I thought about my body and how I thought about people's body and their presence and their time, maybe to some degree, even an understanding of mortality. Like, \"Hey, can't take it with you. It's all going to go...\" When you're 18, you think you're going to live forever, and by the time you're 22, a grizzled 22-year-old veteran, you're like, \"Ah, tattoo that bad boy up. It's all going down.\" And so yeah, that's why I got the Veritas tattoo, which is Latin for truth, which is... I will say it's a little cheesy, because it's also Harvard's motto. But I got it in a monotype font. This is the programmer's font here.\n\n(00:49:28):\nThe other thing that's interesting to me about tattoos was it's also part of a generational shift. We grew up in a time when tattoos were really seen by adults as gangs or bikers or sailors or certain types. Now my understanding, I saw a stat recently that more people in my generation have tattoos than don't have tattoos. And so I think we also just culturally shifted positions in a way that... I find richness of self-expression wonderful. I really think it's great. And so I'm here for all of it.\n\nLenny (00:49:56):\nMy assumption from what you're describing is, this idea of truth is very important to the way you think and work.\n\nAndrew ‘Boz’ Bosworth (00:50:01):\nMy reputation does precede me on this point, I'm afraid, which is... I think when I was young, I saw being honest... And I was wrong by the way. I saw being honest as kind of a get out of jail free card. You could say whatever you wanted as long as you're being honest. That's just not the case at all. I've written about this before, but by far my biggest professional regrets were me not being kind. And I used to think... I wrote this note a while back called Be Kind, where being nice, that's like patronizing, or telling somebody things that are half-truths or just getting by. And I'm against that. But being kind isn't that. Being kind is like, \"Hey, how can I deliver this feedback in a way that is actually productive and helpful, in a way that is going to help them and not cause them just to feel bad and helpless?\n\n(00:50:50):\nAnd I think I did that wrong a lot as a kid, as a young man. And so being honest is still a big part of my personality. No one would ever accuse me of being dishonest who knows me. And I think people understand and respect that I'm pretty direct, and if I have concerns or issues, I'm going to bring them up. I'm just much better at bringing them up now and expressing a true care and belief. I wouldn't bring it up if I didn't think we could do better, if I didn't think we could fix it, if I didn't believe in this situation. And so being honest is still a huge part of my identity, and I think that's something I'm very proud of. But I will say the contextualization of how I'm honest has changed immensely since I got this tattoo.\n\nLenny (00:51:29):\nThat seems reasonable. This touches a little bit on something I definitely wanted to talk about, which is one of your most classic pieces, and this is the way I first learned about you, is a piece that is called Communication is the Job.\n\nAndrew ‘Boz’ Bosworth (00:51:40):\nYep.\n\nLenny (00:51:41):\nI know many people have read this, many people haven't. I'd love for you to just talk about what this means and why this is important, why this is something that you wanted to share.\n\nAndrew ‘Boz’ Bosworth (00:51:49):\nYeah, it's one of the things that, especially if you aspire to be a leader... And leadership isn't management, and leadership isn't being the only person responsible, it's not even always the same as accountability. But if you want to have an impact...\n\nAndrew ‘Boz’ Bosworth (00:52:00):\nIt's not even always the same as accountability, but if you want to have an impact on the world around you, it is exclusively done through the creation of artifacts or verbalizations that affect other humans. That is all there is. That's all there is if you want to have an impact, if you want to create some kind of a lasting change. And it could be in your little relationship, it could be in your team, it could be in your company, it could be in the world. It is down to communication. And so often you hear people saying, \"Oh yeah, I wrote that up a year ago.\" It's like, \"Yeah, but you did a bad job of writing it up a year ago, or we would've not wasted a year not doing it.\"\n\n(00:52:47):\nPeople always think that's, \"Oh, I had that idea,\" and that's means anything. It means nothing. It means absolutely nothing. Or it's like, \"Oh, I wrote this post.\" Well, you didn't break through with it. That's on you. It's not on the audience. People want to blame the audience. Well, the audience is just there. I mentioned this even earlier, and I hope people caught it, when I said, \"Hey,\" I give somebody a piece of work and they come back six months later and they have done the wrong thing, I'll take the L. I will take the L on it. It's not great for them. They'll be pissed they wasted their time, but like I said, that's my responsibility. I did not communicate clearly what I wanted, what the expectations were.\n\n(00:53:25):\nCould they have also helped themselves? Sure, they could have, and that's a thing that takes all sides. We should work on this problem for both angles. I have another post called Listening is the Job, which is the other side of this. But communication is the job is, I really believe... Actually, it's the relationship to this idea that came out of the US Marines and the SEALs of extreme ownership, which is... So whenever thing goes wrong, I ask myself, \"What could I have done differently in terms of how I communicated things for this to have gone better?\" Could I have set priorities better? Could I have set expectations better? Did I need to have a better metric that I pointed the team at? Did I put the wrong people on it?\n\n(00:54:04):\nBy the way, the thing I talk about is org charts are communication devices. They don't exist. There's not a physical string between you and your manager. They're just communication tools that are supposed to give people a rough sense of how things are organized and where to go with who. And so all these things are communication. Silence is communication, me not reaching out to you to check on you, to check on your project. We talked about the [inaudible 00:54:29] earlier. What does that mean? That means trust. That means responsibility. The absence of check-ins has meaning. You cannot not communicate. You are always communicating something with your face, with your clothes, with your body. What are you communicating?\n\n(00:54:45):\nI'll give you a funny example, which I hope we get to put in the podcast, because if you're watching this on video, you will have noticed that my camera cannot stop adjusting light. It's just constantly too dark or too bright. I'm trying a new camera. I'm a nerdy guy. I try a lot of camera gear, I try a lot of microphone gear. I love to have all the latest gadgets and gizmos, so I'm trying something new. It's not working. And in my head I'm like, what is this communicating about me? People are going to think that I don't care or that I'm not competent.\n\n(00:55:15):\nThat's what I'm talking about. And now, I felt compelled to explain it in the podcast so that I can communicate clearly that that's not the case. I really just think so much of what I try to do in my professional life is understand the mental model of other people. Where are they right now? And I mean specific people, like my managers or my key technical leaders, and I mean general people like teams, and I mean broadly just the average human. Where are they at in this conversation? And how can I craft my language, my presence, my persona, everything to usher them from where they are to where I want to get them?\n\n(00:55:52):\nAnd that requires me to have a very clear idea of where I want to get them, have to have a clear idea of where they are. And I want to tell you, it's not as much work as it sounds like. I think no one would accuse me of having this big fabricated persona. It's not that. But it is having tremendous empathy for where people are starting. That was the lead for me. All the rest of it, all the rest of how I show up in meetings trying to smile more, because I'm like a big scary guy, those things are little things that you work on and they become second nature and they're easy. The hard thing is just having the empathy for your audience and being, \"Where are they? Where are they starting?\" And when you miss taking responsibility for that, extreme responsibility for that.\n\nLenny (00:56:31):\nThere's so much good advice in that. There's so many threads I want to follow, but let's just follow this last one of trying to understand how someone is best communicated to. Is there an example to make that a little more real for people of just what you've done to, \"Oh, here's how I'm going to communicate with this person?\"\n\nAndrew ‘Boz’ Bosworth (00:56:46):\nI'll give you a couple. One is multimodality. There's an old saying, repetition never spoiled the prayer. And I think most experienced communicators, whether they be writers, whether they be public speakers, talk about the importance of reiterating a point several times and in several different ways to make sure that people have a chance to internalize it. You want to use it, you want to say it directly, you want to use metaphor. And so for me, I will give an all-hands and then write a post with the content of the all-hands, because different people are going to respond differently to these modalities and are going to absorb information at different rates on these different modalities. That's a trivial one.\n\n(00:57:23):\nAnother one that I think of all the time is making sure that you address people's fears and concerns. People will not listen to you if they think you don't know what's going on. And so, one of my favorite things to do when we're talking about some kind of issue is right up top and say, \"Hey, let me be clear. This is the issue we're having. I know we're having it. I know what matters.\" And then I'll say the same thing that I would've said, but they would've literally ignored me, because how can they trust my conclusions if they don't accept the premise? You know what I'm saying? I think there's a whole piece there. Obviously when you're in person, it's a lot easier because you're reading facial expressions. Even on this, I'm reading you nodding on that. I'm like, \"Okay, he's with me.\" And then I throw in a, \"You know what I mean?\" Whereas if you give me a cocked head, I then bring a second example to try to drive the point home. But you build yourself up. Most people are going to realistically start in their careers trying to influence one or two people. That's where you start. One or two people. That's who you got to communicate with. Your manager, one teammate, that's who you got. And then you build up and build up and build up a skillset to do it at a larger and larger scale.\n\nLenny (00:58:36):\nI love so much of this advice. I think it's also helpful for relationships. \"Here's what you're upset about.\"\n\nAndrew ‘Boz’ Bosworth (00:58:42):\nTotally, a hundred percent.\n\nLenny (00:58:43):\n\"Here's what I think we can do.\"\n\nAndrew ‘Boz’ Bosworth (00:58:46):\nAgain, the work that I've had so graciously supported to do on myself at Meta with great mentors, Sheryl Sandberg, Mark Zuckerberg, a bunch of others and coaches absolutely made me a better partner and husband, and my wife. And then by the way, vice versa. Having kids and getting deep in the literature around raising children. Congratulations to you, by the way. Getting deep in that literature made me a better manager. Absolutely made me a better manager in terms of thinking about how people are managing their emotions and how to engage with them in those times.\n\nLenny (00:59:16):\nAmazing. We need a second edition of this Boz's Parenting Advice.\n\nAndrew ‘Boz’ Bosworth (00:59:19):\nThat's right.\n\nLenny (00:59:20):\nAnd relationship advice.\n\nAndrew ‘Boz’ Bosworth (00:59:21):\nIt's all the good stuff. No bad kids, Lansbury, it's good inside, Dr. Becky. It's all-\n\nLenny (00:59:28):\nI like Dr. Becky.\n\nAndrew ‘Boz’ Bosworth (00:59:28):\nI really think that the modern parenting canon is really rich.\n\nLenny (00:59:33):\nAmazing, so much good content. This episode is brought to you by Explo, a game-changer for customer-facing analytics and data reporting. Are your users craving more dashboards, reports, and analytics within your product? Are you tired of trying to build it yourself?\n\n(00:59:49):\nAs a product leader, you probably have these requests on your roadmap, but the struggle to prioritize them is real. Building analytics from scratch can be time-consuming, expensive, and a really challenging process. Enter Explo. Explo is a fully white-labeled embedded analytics solution designed entirely with your user in mind. Getting started is easy. Explo connects to any relational database or warehouse, and with its low-code functionality, you can build and style dashboards in minutes.\n\n(01:00:18):\nOnce you're ready, simply embed the dashboard or report into your application with a tiny code snippet. The best part, your end-users can use Explo's AI features for their own report and dashboard generation, eliminating customer data requests for your support team. Build and embed a fully white-labeled analytics experience in days. Try it for free at explo.co/lenny. That's E-X-P-L-O dot C-O slash Lenny.\n\n(01:00:47):\nOkay. You mentioned this gadget and these cameras you like to play with. Let's talk about the Vision Pro and VR headsets. Have you tried the Vision Pro? Thoughts?\n\nAndrew ‘Boz’ Bosworth (01:00:57):\nActually, Mark and I tried it together and I want to say, first of all, when the headset came out, we breathed a little sigh of relief because the stuff inside of it didn't represent a fundamental breakthrough. Everything inside of it was something that we probably could have gone and done, with the exception of Apple silicon, which is a marvel, but it's worth nothing. Apple Silicon is like a 2X marvel when doing things like scaling display resolution is unfortunately a quadratic proposition, and so a 2X linear scaling advantage doesn't buy you as much as you might expect when you're trying to scale resolution. And so that was step one. But we still assumed at that price point, with their legendary attention to detail and polish, they probably produced a great product. And the line that I said actually my own podcast with Matthew Ball a week ago was, \"Look, I was prepared to come to market and say we have the best value headset. If you want an outstanding, best possible headset for the money, we've got it. It's the Quest 3.\"\n\n(01:01:55):\nAnd I was so thrilled when I tried the AVP next to Mark, we were like, \"No, we think we have the actual best headset.\" Now, we're not saying it's the best at all things. If you're sitting still and watching a movie a high-res movie, Apple Vision Pro is really great. It's really great. The resolution shines. The way they've tuned the pass-through shines if you're stationary and looking straight ahead. And they've done some really nice things with the UI. It's one of these things that we do get annoyed about, a mile aside, we get a little bit annoyed about as product people.\n\n(01:02:31):\nI know that this happens to all of us. It happens to Apple, happens to Google, happens to us. We have a bunch of internal things we've been playing with, which will at some point ship and we will be accused of having stolen them when we actually did not steal them. If you want, you can go see my Quora answer on the history of the like button where this happened previously, where we had built the like button internally before it was launched elsewhere. Anyways, it's a whole thing. This happens in our industry a lot, and I really shouldn't care as much. It's a little bit of my ego peeking through, which I should control and tamp down, if I'm being responsible.\n\n(01:03:03):\nThe beautiful UI polishes, they did a tremendous job with eye tracking. One of the things that's interesting about the eye tracking is, to do it the way they've done it, that's why you have to have the prescription insert, so it doesn't support your glasses. You have to get prescription inserts. They're expensive. And they can shoot the cameras that track your eyes through the lens as well as the light around it. Ours go from the side on the Quest Pro, and that allows you to wear corrective lenses.\n\n(01:03:27):\nAnd so different choices like that have trade-offs, but it's still cool. It's great that they got that in there. At the same time, our hand tracking is better. Obviously, the app library we knew was going to be better. That's not totally fair to them. They've just launched and they have small volume still, but I just find the comfort... The thing that really got me the most, the field of view is really small on the Apple Vision Pro. And some people are characterizing it incorrectly on the internet. They're doing a characterization up close to the lens. Once you factor in the eye relief, the distance between where the lenses are and your eyeball is, their field of view gets pretty narrow for almost all faces relative to ours, which I find distracting.\n\n(01:03:59):\nTheir displays are much dimmer than ours, and I find the motion blur really distracting when I'm in mixed reality use cases. And as I mentioned earlier in the podcast, I'm a huge mixed reality buff. I'm a huge fan of that potential for exactly the same reason that they are, by the way, which I think hands and mixed reality make it feel much more accessible to more people. I'm pretty glad we have the controller in our set though, because it really expands what you can do. And we don't just operate our computers with just one thing. We have a keyboard, we have a mouse, we do multiple modalities all the time. I really feel like the comfort, the lack of persistence and motion blur in our pass-through, the brightness of our displays, I was like, \"Oh man, if you gave me one to take, I would take Quest 3.\"\n\n(01:04:40):\nNow, people have rightly said, \"That's pretty biased.\" Of course it is. Go get your own opinion. But what kills me is most people haven't done that. They have not tried the Quest 3. That's what kills me the most. If you go and try Quest 3, ask yourself if you'd rather have seven of those, one for you and six of your best friends, or one Apple Vision Pro. I'm sure the answer isn't Quest 3 for every person. There are people for whom there are use cases that really fit their life, the Apple Vision Pro, I'm cool with it.\n\n(01:05:05):\nBut people don't even know that the Quest 3, you can do Remote Desktop. You can do it both through an app called Remote Desktop, which is very popular, or you can go into workrooms and you can have three monitors surrounding you streamed from your machine. I think some of this is just people have not even done the work. They haven't even tried it. I welcome all of you who think I'm biased to prove one way or the other what you think, but don't do it without putting the Quest 3 on and giving it through its paces, because it's a pretty great device. And you can do a lot with $3,000 extra dollars.\n\n(01:05:38):\nHow did they get away with that, by the way? We launched a headset that was $1,299 and people lost their minds about it. They're like, \"Ah, $3,500, it's fine. This is fine. No one cares.\" I don't know. Fairness is too much to ask, and I don't care about that. Apple has earned the great brand that they've built. They truly have. I think it's tremendous. I certainly celebrate a large number of Apple product. I'm a huge fan of their work. I'm a huge fan of what they do. That's probably why I expected more from the AVP.\n\nLenny (01:06:06):\nWell, I'll show you my favorite AR device, which is these Ray-Bans. I actually bought them.\n\nAndrew ‘Boz’ Bosworth (01:06:13):\nYeah.\n\nLenny (01:06:13):\nHere, I'll put them on it. Here, what I'm going to do is I'm going to record. I didn't tell you I was going to do this. I'm going to record this as we're talking. Look at this.\n\nAndrew ‘Boz’ Bosworth (01:06:20):\nI like that. They look so good on you too. This is a good fit.\n\nLenny (01:06:23):\nMy mother-in-law's like, \"You look so sophisticated. You look really smart with these on.\" And we bought these actually to film our kids, or our kid, instead of having Cameron's face. And it's been awesome.\n\nAndrew ‘Boz’ Bosworth (01:06:34):\nIt's really the best. It is so hard to look at a phone screen and have the real thing be in between you. No, the glass is the way to do it.\n\nLenny (01:06:43):\nLook at this, my new look. I'm just going to have glasses on all the time.\n\nAndrew ‘Boz’ Bosworth (01:06:46):\nWe got to get you the multimodal. I've been playing with that since December, where you can use the camera to ask a Meta AI assistant about things. It's really good. I was in a ski village recently with my family and I had them on. I'm just like, \"Hey, take a look. Tell what you see.\" And I had found a sign and it gave me directions. \"Hey, the bathrooms are down those stairs to the right. Do you want food? It's over to the right.\" It couldn't tell what village I was in, but it was like, \"You're in a ski village somewhere. Here's the amenities.\" And I was like, \"Wow.\" There's something real magical here.\n\nLenny (01:07:18):\nI feel like I need this for my podcasting interview so I could just have a little voice tell me questions to be asking and where I'm at.\n\nAndrew ‘Boz’ Bosworth (01:07:25):\nRight, totally. Yeah.\n\nLenny (01:07:26):\nHow helpful would that be?\n\nAndrew ‘Boz’ Bosworth (01:07:27):\nOkay, I'm going to cheat on this one and say, obviously we've been talking for a while, but playing with glasses that have full AR capabilities, and we've got one that has rumored to be coming internally soon, so heavily rumored in fact that you might even say it's almost been confirmed. And what's been really fun is being able to play with these time machines, really, in terms of what they are. It's amazing technology. People were giving us speeches, big company-wide speeches, and had all their notes on the glasses. And they could control the slides just using a gesture.\n\nLenny (01:08:05):\nOh my God.\n\nAndrew ‘Boz’ Bosworth (01:08:07):\nThere's exciting things afoot. The future's looking pretty bright.\n\nLenny (01:08:10):\nSomething that I wanted to touch on, which is when Mark put out this whole video of, \"Here's what I think of Apple Vision Pro versus the Quest,\" a lot of people are just like, \"Oh man, because he's putting out this video, he must be so afraid of what's happening and it's not the right move.\" What went into thinking? Was there strategic thinking there? Was it just him, \"Here's what I think?\"\n\nAndrew ‘Boz’ Bosworth (01:08:29):\nThis guy does [inaudible 01:08:30] about the modern era. Everyone's in their Meta head about everything. Everything's a four-dimensional chess. That was just what Mark thought of the thing. That's what he thought about it. I think he wanted to make sure people remembered, hey, Quest 3 is literally a better device, and people haven't even tried it.\n\n(01:08:46):\nAnd so we're not always playing four-dimensional chess over here. Sometimes we're just like, \"Here's a thing that I believe is true. I'm going to say it out loud with my mouth.\" That's what he did. It's not that hard. When I do it, everyone expects it because of my persona or brand or whatever the thing is. I guess people are surprised when a CEO does it. All right, I get that. That's cool. There's other sets of societal expectations there.\n\n(01:09:08):\nAnd we're all familiar with Apple putting the Welcome IBM ad in the New York Times, and then Slack doing the same thing with Microsoft and the Ballmer iPhone comments. None of those were true discussions of the technical merits of a product. Those were all just big, rally the troops gestures. This is not that. Mark is deep. He's an expert in this stuff. I'm an expert in this stuff. I feel great about our choices.\n\n(01:09:39):\nBy the way, when I've used it, I could get myself completely into the head of the person who designed it. I can tell you from using it what instructions they were given, that team was given. I can tell you what they were optimizing for. I can tell you what constraints they were under. By all the choices they made, I can tell you all those things and I understand it coheres in that way. We made different choices. It shouldn't surprise anyone. We like our choices better. We could have made those choices. We didn't make those choices. We made these other choices.\n\n(01:10:06):\nAnd so for me, the weight, the wire, which just always brushes against my ear, the pocketable thing, I get it. That's not what I would've done, and I know that because I had the chance to do it and I chose not to. I don't know. I don't know why people are surprised. This wasn't some big, savvy strategic move. This was just, Mark's got a chance to use it. He's like, \"Oh man, I think we should tell people what the real story is here.\" And we did.\n\nLenny (01:10:34):\nI love that insight. And I know a lot of people watching are like, \"Oh, shit, he's right. Wow. I didn't think of it that way.\" And so I think it had a lot of that impact.\n\n(01:10:41):\nI want to zoom out a little bit and talk about Meta's journey over the past couple years. It feels like there is a huge downturn in public perception of Meta and the stock price, and then over the past couple of years there's been a huge turnaround. And it feels like there's always a lot to learn from these periods. Just as an example of the stock price, I was just looking at it, it was down to $80-ish, and now today it's $487.\n\nAndrew ‘Boz’ Bosworth (01:11:05):\nYeah.\n\nLenny (01:11:06):\nI'm curious just what you've learned from going through that downturn and turnaround. And I know it's still in progress, but just what have you learned from that journey?\n\nAndrew ‘Boz’ Bosworth (01:11:16):\nYeah. Well, there's a lot to take away, I got to tell you. I think we had the largest single day stock drop in history, followed 18 months later by this largest single day gain in stock market history.\n\nLenny (01:11:27):\nOh my God.\n\nAndrew ‘Boz’ Bosworth (01:11:27):\nAs the legendary Lou Holtz said, \" You're never as good as they say you are when you're winning, and you're never as bad as they say you are when you're losing.\" Mark has always brought that quote out to guide us internally to try to insulate ourselves a little bit from the vagaries of external opinion. And that's not just true with stock prices. That's true with media and press. It's true across a lot of things.\n\n(01:11:53):\nOne of the things I told my team, and I still have to repeat it to them, is, \"One of the things that's hard to remember when you're in it is that you know more than the critics do. You know more than the analysts in the marketplace do. You know more than the media does. You know more than the podcasters do. You know more than the Twitter does. You know more about what's real and substantial of value about our company than they do. That doesn't mean ignore them, because they have a different perspective and you need to understand it. Even if the totality is less than what you know, it may contain parts that you do not know.\" I'm a huge fan, I read the criticism of everything, and I read it very carefully, looking out for confirmation bias, looking out for things that I might be inclined to resist but are maybe true. I invite all critique, but I also don't accept the critique blindly. I don't just say, \"Yes, this is obviously true.\"\n\n(01:12:55):\nGell-Mann Amnesia is a great concept for everyone to understand. Gell-Mann Amnesia is this property where you'll read a newspaper article, let's say newspaper, why not, about a thing about which you are an expert, and you'll be baffled because here is an article that is not just wrong, it's inverted causality. Michael Crichton, I'll steal Michael Crichton's quote on this, \"It's a wet sidewalks make rain story.\" And you'll be like, \"What a terrible, bizarre story.\"\n\n(01:13:22):\nAnd then you will turn the page of the newspaper and it will be another article about a topic about which you know nothing, and you will read it as if it is the gospel truth. You'll figure it's, \"Oh, no, look at this information about this foreign situation.\" Like I said, perfectly true. We should be smarter than that. And so does that mean you don't read the thing? No, you read it. You just read everything with that perspective of, \"Wait a second, this is another point of view. And how do I integrate that into a whole perspective that I can have and be informed about?\"\n\n(01:13:55):\nThe first, the macro thing is taking the long view, realizing that when you're in the dumps, it's not as bad as you think, when you're at the top, it's not as good as you think. It's somewhere in between at all times. The second thing is communication is the job. We really did not communicate effectively, I think, with the market around our future investments. And listen, we've had two 10-year long huge investment areas. One has been AI, one has been reality labs. And AI's looking pretty good today. I can't think we can all agree with Lama 2, with Fair, the breakthroughs that we've had.\n\n(01:14:33):\nPeople don't notice that Fair, our AI research lab, is the second most cited research lab in AI behind Google. We've been doing this work. We didn't come here casually. We've been doing it, and so that's looking pretty good. I don't think we did enough to explain those best to people. Previously, the core business was going strong enough and they were willing to ignore them. And with the old Warren Buffett quote, \"It's only when the tide goes out, we see who's not wearing swimming trunks.\" And so when the tide went out, when you have the Ukraine war and an interest rate hike and recessions, now everyone's scrambling for that incremental dollar and they're like, \"Go get rid of this stuff.\"\n\n(01:15:15):\nAnd we had to tell the company, \"You don't want to work at a company that, when times are tough, kills all future growth and just shores up in the core business.\" That's a company that's just committing itself to dying at some point, a little later than expected, but dying at some point. You want to work at a company that has a balanced portfolio of investments, which we had. We didn't explain that well, and so we spent that time explaining that to the market, to the press, to everybody.\n\n(01:15:38):\nAnd now, I think as people understand the size of it and the scope of it, and of course it helps that the core business has overcome its challenges there from ATT and the other kinds of stuff, it's looking pretty good. I do think one part is, as an internal person, really moderating your attachment to the external narratives and swings, that's super important. And you do that based on understanding your own expertise. And the second part is understanding why is there a delta. What is there? And grab that. It's usually communication.\n\nLenny (01:16:10):\nThere's also a big flattening of the org. This was something a lot of people talked about, where managers became ICs. Is there anything more there that you've learned of just how to adjust the org to be more efficient?\n\nAndrew ‘Boz’ Bosworth (01:16:22):\nOf course, and I should have included that in the first section. I was a bit eager to wrap it up elegantly in the two. But you're right.\n\nLenny (01:16:27):\nI appreciate it.\n\nAndrew ‘Boz’ Bosworth (01:16:29):\nWe made significant shifts in how we operated the business, which was super painful. And listen, this goes back to the boom times of COVID, when it looked like there was a real lasting secular shift in things like e-commerce and in working remotely and these tool sits, which are exactly what we build, and it's primed us. And so we built up a huge workforce to pursue those opportunities. We still believe in those opportunities, but they're back on their original timeline. And actually, literally, if you look at a bunch of graphs that we have internally, it's literally the COVID boom and then, not bust really, but as it receded, everything's back on its original trajectory.\n\n(01:17:16):\nWe didn't lose ground or lose time, but the pull forward didn't happen. Well, that means your economics don't make any sense anymore. Now, you made a bunch of investments that are going to yield too distant in the future, and getting there faster isn't going to help you and you're carrying a much extra cost. That sucks, man. It sucks. And we don't feel great about it. We really don't. It's a business, it's awful, and it happens.\n\n(01:17:41):\nI do think one thing that was interesting about that time was, for those of us who grew up and saw the .com boom firsthand, I was born and raised in the valley, so that was all around me when I was graduating high school and going to college, and then in the 2008 major recession on the housing crash and on the market and all that stuff. Now, let's imagine you graduated college in 2009-\n\nAndrew ‘Boz’ Bosworth (01:18:00):\n... all that stuff. Now let's imagine you graduated college in 2009 and got a job. Well shoot, you're 15 years in your career, you could be a director and you've never seen a downturn. I think we also had, in addition to what was very unfortunately conventional mis-forecasting in the business that caused us to over hire, that we had to correct for. You also had a workforce that was just not at all of a mentality that this could ever happen. This felt like it was an act of God when in fact it's like a cyclical nature of all businesses that this will happen at some time and you hope it doesn't and you wish it didn't, but you have to deal with it. And so I think we have a bit of a tough storm there for the whole industry and we're still feeling it. I think we're still feeling it.\n\n(01:18:45):\nCertainly we're happy at Meta to be beyond that point and we're growing again and executing at a stable rate and feeling really good about that, but quite a few of our other companies in the industry. And it's a very uncertain time for engineers, for PMs, for designers, for everyone and all the support functions around them. I'm super sympathetic for that. I think obviously the mis-forecasting that happened inside of Meta's walls happened everywhere and now that you have, especially with higher interest rates and cash isn't as cheap, runways are tighter. People are just making those pragmatic calls. I think we'll rally back from this. I think this is a normal thing that happens to industries, but it doesn't reduce my sympathy and empathy for those who have been affected by it or who live in fear of it.\n\nLenny (01:19:29):\nI was talking to a friend who works at Meta and I was asking them what it's like to work at Meta and she was just like, \"It's intense, and it used to be more chill. There were people that were coasting here and there,\" and now she's like, \"No, all those people are gone now. It's just only the intense people left and we're working really hard.\" Does that bring up anything?\n\nAndrew ‘Boz’ Bosworth (01:19:48):\nYeah. I don't want to comment on people who left. People left Meta for all kinds of different reasons and likewise role elimination happened in many cases because we just decided not to do this work at this point. We were going to do it two years from now and don't need to carry a team to do it. I think it's really hard to generalize because each of these is a specific person with a specific life and a story that is rich and deserves to be told. But I do think that if there was somebody coasting and you as a manager have to make tough calls on who you're bringing in which way you're going to bias my profound suspicion, and again, I don't know your friend who you spoke with, my profound suspicion is that person's probably already working hard. You know what I'm saying? That person's already probably working hard. I don't think we changed how hard any individual worked. I really don't believe that.\n\n(01:20:35):\nI do think there was a selection bias as to what was going to happen, and I think that's probably what you saw play. In fact, if there is a generality that can be found.\n\nLenny (01:20:43):\nMaybe as a last question, I have this segment where I call Failure Corner where I ask people to share a failure of their career and what they learned from that experience. Is there something that comes to mind?\n\nAndrew ‘Boz’ Bosworth (01:20:55):\nI've failed tons of times. I've built products that nobody used. I've built technical architectures that didn't scale. I've failed all kinds of times. I don't regret most of those. Almost every one of those I learned from. It was a stop on the path to a better solution or it was a recognition that this thing wasn't going to work ever, which is its own kind of a gift. All the failures that I regret, that I take seriously are personal failures where I affected a person in a way that I'm not proud of, maybe wasn't proud of the time because I wasn't in control of my own emotions or mood. I was feeling fearful, I was feeling scared, and there's a bunch of these one or two that stand out that I don't feel comfortable sharing because the person affected, I think would prefer I didn't share.\n\n(01:21:46):\nI'll share one that was... I think the person's and I are tight now. We have this really silly discussion. I remember it so vividly. In the early days of client server architectures, which Facebook obviously is a website, so you're calling to a server to get the webpage, but then that server is going to call the other servers to gather things and that was one of the major clients of remote procedure calls because newsfeed ranking was all done on this other set of servers that had its own special requirements and special build and how it was put together. And so your main web server would put a call-out over a remote procedure, call to the remote server and get a response back. And we had this really janky RPC system that, I won't say who built it, but it was built and it was just a piece of garbage constantly failing. It was not robust at all. And one of our best engineers, Mark Sleek, built a new one called Thrift. It was a great, really great RPC infrastructure.\n\n(01:22:47):\nAnd one of my best friends, Dave Federman, one of my really good friends and a brilliant engineer, we were talking about how to do the encoding and I was like, \"I want it to be binary encoding.\" I was like, \"You should binary encoding. I want it to be super efficient on the wire,\" because I'm storing these RPCs. They do two jobs for us, one of which is the active RPC, but I also store the RPCs in a log and replay them to do the work that we were doing in newsfeed ranking. That's how it was done back in the day. It was all kind of asynchronous offline and so I wanted to be as tight as possible. My memory bandwidth was very limited and memory was so expensive back then and Dave Federman was like, \"No, no, no, that's short-term thinking Boz, we should be using Linux style descriptors that are plain English language. Then you could look at the log, you can see what it is. It's possible memory bandwidth will get cheaper, but these logs being scrutable to development is going to be a better thing.\" This is nerd bait.\n\n(01:23:42):\nThose of you who have been engineers in this call, this is like Vim EMX. This is nerd bait. This goes deep. This is like a long old thing.\n\nLenny (01:23:51):\nI love it. Keep it coming.\n\nAndrew ‘Boz’ Bosworth (01:23:52):\nIt's a room full of engineers at the company and the company's not that big, and so there's probably half the engineers of the company in this room. I was yelling. Literally I'm turning red, I'm sweating. I'm so angry at Dave Federman for countermanding my proposal and I'm the major RPC customer. A couple things. This is so dumb. Mark Sleek just built two encoders. It's not that hard. You pick which encoder you want for your things. That's the easiest solution ever. Second thing is Dave was right, by the way. Within a year, the memory bandwidth definitely didn't matter relative to how inscrutable it was to try to get into these logs. I had to build a ton of extra custom software to parse the logs and understand what what's going on. But also it was a case where my identity was caught up in being right. And for those who don't know, identity threat is just the biggest... Your worst behavior is always going to come out when you think you're under identity threat.\n\n(01:24:51):\nWhen you feel like some core part of how you see yourself is in question, you will react with every ounce of your fiber to defend that conception of yourself because it's so expensive to reconceptualize who you are that you defend yourself. So my identity was being right. [inaudible 01:25:08] on the wrist. And it caused me to take one of my best friends, one of the best engineers I knew, a guy I literally lived with and getting a really embarrassing for me conflict, which everyone was just scratching their head like, \"What is going on with Boz right now?\" I looked like an unhinged crazy person. I remember the room, I remember where I was standing in the room. I remember everything about that moment and I had to go home and be like, \"What the fuck was that? What happened?\" I'm asking myself like, \"What happened there?\" And that was one of the many steps in the journey to recontextualizing what it was was not to be right and what meant to be open-minded and curious and how to engage in this competition.\n\n(01:25:47):\nI was 22. I don't make excuses for it now, but I remember there was a couple other examples like that in things that were less technical and more personal that I won't share, but I remember each of them vividly and those are the real failures for me.\n\nLenny (01:26:01):\nI love how this story is so long ago at this point and it's still stuck with you and such an impact, I think.\n\nAndrew ‘Boz’ Bosworth (01:26:06):\nOh, my god, I'll never forget that. It was embarrassing. And for those, that's the old quote, it's really one of the truest quotes, and I know it's cliche and sometimes cliches are cliches because they're good. It's like, \"People, they don't remember what you said. They just remember how you made them feel.\" That's all anyone remembers is how you made them feel, and I think in that room, I made people feel unsafe, maybe. It was bad.\n\nLenny (01:26:27):\nI like this concept of identity threat. They call this podcast episode identity threat.\n\nAndrew ‘Boz’ Bosworth (01:26:32):\nThere you go.\n\nLenny (01:26:33):\nBoz, we started this episode with a billion questions. I have a billion and one questions now. I wish we could keep going, but I know we have to wrap this up. Is there anything you wanted to share or leave listeners with before we get to our very exciting lightning round?\n\nAndrew ‘Boz’ Bosworth (01:26:46):\nWell, in the off chance that we do end up labeling this episode, identity threat, let me give you what really was... I made a lot of breakthroughs with coaching, learning about the feeling inside of my own body when I was feeling that identity threat and learning techniques and tactics to reduce the likelihood I would feel it and how to deal with it when it happened and how to repair when I did, I went through all that stuff. I would say the greatest lesson I learned would come years later and it was just from observing somebody. Ami Vora who was a legendary, long time came in and worked on our development platform, then worked with me on ads for a long time and then was the PM lead for WhatsApp for a long time. She's since gone on to do even more great things outside the company. Working with her, it was like watching an alien because her and I were so different in our approach and she approached...\n\n(01:27:38):\nShe could have the most profound disagreement with somebody in the world and they would say the thing that she thought was not just wrong, but crazy wrong and she would respond. She would say, \"Fascinating. You have to tell me more about why you think that.\" And I can't do it justice, she meant it from the core of her being. She saw this schism between her and that person and it could have been personal, it could have been professional, it could have been anything. She saw this schism and how they saw the world and how she saw the world and rather than reacting as if it was a threat that somebody saw it differently or rather than reacting afraid that maybe she was wrong and had done things wrong before, she reacted with the most genuine and profound curiosity. I just watched it absolutely tear down walls between points of view. People felt immediately her genuine heartfelt curiosity and would lean in and that would cause them to be open-minded.\n\n(01:28:36):\nAnd if she was right, which by the way she usually was, then they would leave being like, \"Oh, okay, I was wrong about that,\" but she also would change her mind and that was the key. Ever since then, I really have tried to model that. When I have a strong internal clinch, I try to embrace curiosity like, \"Wow, we do not see this thing the same way. That is fascinating. Tell me why you see that.\" And that can be by personal feedback. Someone's like, \"Hey boss, I don't think you talk enough.\" \"Wow, you don't think I talk enough? That is unexpected. I would love to hear more about that because no one's ever said that to me,\" so I wanted to give that to anybody who might recognize this behavior in themselves. There's lots of things that you can do and you should do that work.\n\n(01:29:22):\nThe work of improving yourself is always fruitful and satisfying and it pays off, as we discussed, in every aspect of your life with your family, with your friends, and professionally. This is one that I really thought was so great was just curiosity. Embracing curiosity in those moments of challenge has really completely changed my life and I owe that to Ami Vora.\n\nLenny (01:29:40):\nWow, I love this example. It's basically an example of, \"Yes, and?\", but in a really... no one's going to be like, \"Yes, and?\" It's a really nice way of saying it, \"Just fascinating. Tell me more.\"\n\nAndrew ‘Boz’ Bosworth (01:29:50):\nFascinating. You've got to tell me why, I want to understand it.\n\nLenny (01:29:54):\nI love that. Maybe that'll be the new title, fascinating.\n\nAndrew ‘Boz’ Bosworth (01:29:56):\nThere you go.\n\nLenny (01:29:58):\nAnyway, with that, Boz, we've reached our very exciting lightning round. Are you ready?\n\nAndrew ‘Boz’ Bosworth (01:30:03):\nI'm ready.\n\nLenny (01:30:04):\nFirst question, what are two or three books that you've recommended most to other people?\n\nAndrew ‘Boz’ Bosworth (01:30:09):\nThe Dream Machine, which is a tremendous history of pre-history, really of modern computing ostensibly following the life of J.C.R Licklider, but really it's much broader than that, is a tremendous missing piece of history in my opinion. I think in my discipline, in computer science, we were not properly educated. We learned about Alan Turing and we learned about some of the technical underpinnings of computer science theory, but the modern computer and the path to it is a profound and fascinating one, and it has particular resonance today as J.C.R Licklider's observation was human in the loop computing and I think we are now in human in the loop AI, and I think there's a tremendous resonance there. The second one is Good Inside, which is Dr. Becky's book, and again, I think it's a tremendous parenting book, but more than that, it does contain lessons for how we think about our own emotions and how we manage those, which I find to be useful in any context.\n\nLenny (01:31:00):\nAmazing recommendations. She's also got an online community for people that-\n\nAndrew ‘Boz’ Bosworth (01:31:03):\nShe has a wonderful online community, she's very engaged in it. And for those parents out there, you're a little early for this Lenny, but you'll get there. Having little scripts that I'm reading on Instagram that when I'm in a moment of tremendous emotional challenge with my children, I have the words handy. They're just top of mind for me. They've been cashed in, right? They're primed, is a big game changer.\n\nLenny (01:31:24):\nThis will be for our parenting episode down the road.\n\nAndrew ‘Boz’ Bosworth (01:31:27):\nThat's right.\n\nLenny (01:31:28):\nIs there a favorite recent movie or TV show that you've really enjoyed?\n\nAndrew ‘Boz’ Bosworth (01:31:32):\nYeah. This is super conventional, but Mandalorian. One of the things that's been fun about that is really my kids again is we watched it with my kids, so we had a chance to go on the Galactic Star Cruiser. Again, y'all know I am a genuine and true nerd through and through. Huge fan of Scott Trowbridge and his work at Star Wars service lands in Disney and also of that. And so before that we got our kids who were nine and six and watched all the movies together, and then we were watching Mandalorian together as a family, and it's super fun and it's fun to have that kind of lore, a connection. So it's not just the classic kids movies, but there's something more, and I think for them they feel like it's an adult kind of conversation they get to be a part of. I've really enjoyed that. And I think the world of Dave Filoni and John Favreau and the team that's building that universe out.\n\nLenny (01:32:19):\nThis is the way.\n\nAndrew ‘Boz’ Bosworth (01:32:19):\nThis is the way.\n\nLenny (01:32:20):\nDo you have a favorite interview question that you like to ask candidates that you're interviewing?\n\nAndrew ‘Boz’ Bosworth (01:32:25):\nOne of the most important things that I always ask people is what people who've worked with them would say are their greatest strengths and weaknesses. I like this for a couple of reasons, not least of which is I often do follow up with references and I like to triangulate their awareness of how other people calibrate though. And also how they respond to criticism. Sometimes candidates surprise me. They say, \"Hey, you'll hear this critique a lot from me. I don't think it's fair.\" That can be an okay answer, but they've got to be a pretty robust there. Or it's like, \"Hey, this is something I'm working on, here's what I'm working on.\" But I also like to hear what they think their superpowers are. And too often a lot of attention in interviews is paid to weaknesses, which I care about because I want to know what the downside is. But way more important to me is like, \"What are you awesome at? What is the thing that if I can just hitch a wagon and ride, that's what I want to know. Where's the superpower that you're crushing it at?\"\n\n(01:33:22):\nAnd what's funny is people are pretty rarely give my reference checks. They're not that often accurate about what the critiques are, but they're usually pretty accurate about what their strengths are.\n\nLenny (01:33:31):\nInteresting. I'm also a huge proponent of strengths and not worrying too much about your weaknesses.\n\nAndrew ‘Boz’ Bosworth (01:33:36):\nBut asking people to contextualize their performance through the team, that's so important. We do not achieve very much on our own.\n\nLenny (01:33:44):\nCommunication is the job. Amazing. Is there a favorite product that you recently discovered that you love? And Meta products are acceptable answers.\n\nAndrew ‘Boz’ Bosworth (01:33:55):\nThe Ray-Ban Meta glasses would be a tempting answer. The multimodal stuff, which I'm going to get in trouble because I've been teasing this for months on social media and it's still a closed beta, and it's like, \"We're growing the beta slowly,\" but it's like, \"People already really badly want it.\" It was probably one of the most magical things I've gotten to try recently. It's not totally fair because it's also not you can buy the Ray-Ban Meta glasses and very soon, I won't say when, but very soon they'll have this capability, but it's more fun to think outside of the box. All right, this is such a... I'm going to get in trouble for this answer because it's a bit of a pretentious one. I'm not a car guy, let me say that right now. I don't like cars. I don't care about cars. I want a car that works and doesn't break. All my cars growing up, had over a hundred thousand miles in them because we only ever had used cars.\n\n(01:34:38):\nThey were constantly breaking down and the power steering would go out while you're driving and you have to [inaudible 01:34:43] the thing and the brakes would go out or you'd throw a rod. I've done it all. I just wanted a car. And so then I drove a Honda Accord that I bought for 10 years and then I drove a Tesla Model S for 10 years. And a Tesla model S had a thing happen to it while it was parked, I will get into that. I get a new car and again, I'm like, \"I want to get an electric car.\" And I was like, \"I'm going to get something nice. I'm going to get something nice. I want to get something nice.\" I'm driving a Mercedes-Benz AMG EQS, and I didn't know cars could be this nice. I grew up driving used cars and whatever, I did not know it was possible. It is the best augmented reality product I think you could buy in the market today.\n\n(01:35:29):\nWith the heads of display, it puts your turn in three-dimensional space. It's got cameras facing your eyes, so it's positioned correctly on this display relative to your eyes, the turn. And so when you come up, it's like you're hitting a little wall, you got to turn before you hit the wall. And I was like, \"Oh my God, I think this car has a great augmented reality.\" Not a car guy, and I'm not trying to flex on this car or whatever it is. I like it a lot. I didn't know they could be that nice, but the thing that I thought was so impressive was they did an amazing job with augmented reality in this car.\n\nLenny (01:35:58):\nWow. Mercedes-Benz, a player in the augmented reality, mixed reality space.\n\nAndrew ‘Boz’ Bosworth (01:36:01):\nBig time. They're out there, they're in the lead.\n\nLenny (01:36:04):\nI sometimes think about having a contest where I give away products people mention in this segment, and now you've blown my budget way out of proportion.\n\nAndrew ‘Boz’ Bosworth (01:36:12):\nRay-Ban Metas, you can afford that.\n\nLenny (01:36:15):\nThat's an amazing, I'm going to have to check that out. I think we're going to increase some sales for Mercedes. Next question. Do you have a favorite life motto that you often come back to think about, share with friends and family, find useful?\n\nAndrew ‘Boz’ Bosworth (01:36:27):\nYeah. We have a funny actually how we came about this. The motto my family has, my immediate family, me, my wife and kids is just trust yourself. Just trust yourself. Actually, the reason we have that motto is when we have a house, we have a few nice art pieces and one of them is a Tracy Amen, a famous UK based artist, and she does neon pieces and it says, \"Trust yourself.\" And so it's in our bedroom hallway where me and all the kids and my wife are, it says, trust yourself and every morning the neon lights up and it's trust yourself. And then I had the chance to have a crest made in the UK and my family's English from way back. And so in the crest it says, \"Trust yourself.\" And I always talk to my kids, especially. I really think people, when you're experiencing peer pressure like, \"Who do you trust? Them or yourself? When you're having a lot of self-doubt and uncertainty, you have to trust yourself.\"\n\n(01:37:17):\nI just think so much of the success I've had, I think this is probably true of most people who went to startups and succeeded, was like, \"I just had faith that I was making good decisions.\" I mean, this comes back to the conviction point I made earlier about how you do things like newsfeed or controversial things or how you make big expensive changes, just conviction. You have to believe you, your eyes, ears in an intellect have combined to give you a point of view that has intrinsic value and deserves your respect as opposed to reading that newspaper article about your company and believing it over what your own eyes and ears have told you. That's the motto that we go with.\n\nLenny (01:37:57):\nAnd I think it's also important to say you won't always be right and that's okay.\n\nAndrew ‘Boz’ Bosworth (01:37:59):\nTotally. That's right. Trusting yourself also includes taking risks because you trust that you can deal and handle with what happens when the risks don't pay out.\n\nLenny (01:38:07):\nBeautiful. Final question. I know that you're an amateur photographer, maybe semi-pro photographer, a lot of travel photography.\n\nAndrew ‘Boz’ Bosworth (01:38:13):\nAmateur. Amateur, amateur.\n\nLenny (01:38:15):\nAmateur. Okay. You also have this website that I came across that I don't know if people know about it, it's this funny name. I'm not going to mention that. I don't know if you want people...\n\nAndrew ‘Boz’ Bosworth (01:38:22):\nWarden Shortbow, it's an anagram of my name. Warden Shortbow, an anagram of Andrew Bosworth, wardenshortbow.com. I love photography. I love it. It's a real passion of mine.\n\nLenny (01:38:30):\nSo here's the question. What's your favorite photo that you've taken?\n\nAndrew ‘Boz’ Bosworth (01:38:33):\nArt is actually a great place to talk about trusting yourself, by the way. And I know it's cheesy to say it, but I think Rick Rubin's recent interviews on what art is and how people make it is spot on. You have to make it for yourself and you have to love it. And if someone else loves it and it finds broader resonance, that's awesome, but that's not why you do it. And if you start to try to do it for broader resonance, then you're kind of chasing something else. It's media, it's entertainment, but it's not art. It's some other thing. And I say all this to basically tap dance and say, I kind of love a lot of my photos and it's very hard to pick a favorite. The one that is popping to my head, which has more emotional [inaudible 01:39:12] is a picture I took of my son playing in the street and just jumping in a puddle, wearing a rain boot, rain slick kind of a thing. And it's not sharp, it's not in focus. It's a vignette, it's an idea.\n\n(01:39:27):\nAnd I really do think Ansel Adams talked a lot about how the goal of the photographer is to create a capture that expresses to the viewer what it felt like to be there. And people forget that he was a master of the dark room even more so than maybe than the capture, the print. The print was where he did amazing work. And I've had the pleasure to go to his dark room in Big Sur and spend time with his son and watch them do development in that room. And he had elaborate scripts of how he would highlight, dodge and burn different parts of the photograph to get it to have the resonance that he wanted. And he fought for photography to be accepted as an artistic medium, which it wasn't, which I find so resonant in today's AI art conversations where once again, we're trying to gate keep what is art and you just don't get to do that unfortunately.\n\n(01:40:20):\nSo this picture of my son, no one would call it a technical marvel, but as a vignette of it capturing for me personally, but also I think in general for parents, the ephemerality of these tremendously touching, charming human moments that you have with your children, that's the one that comes to mind.\n\nLenny (01:40:39):\nAmazing. We're going to try to find it and link folks to it. And on the point of Rick Rubin, something he says along the same lines is that you think of art as your diary. I am just describing what I find interesting and important and nobody can come to me and say my diary is wrong. It's my diary, this is how I see the world, and that's okay. And that's where the best art comes from is just emboldening to this... there's an awesome video of him saying exactly this that I was recently watching actually. Boz, this was so much fun. I am so thankful we made time for this. I'm looking forward to our parenting and relationships podcast in the future. Joking, not joking. Two final questions. Where can folks find you online if they want to follow what you're up to and how can listeners be useful to you?\n\nAndrew ‘Boz’ Bosworth (01:41:19):\nSure. I'm @boztank on Instagram and on Threads and also on X, facebook.com/boz. And I also have my own podcast, which is a technical deep dive, so it's pretty different, I would say. It's a technical deep dives to try to go deep on one or two topics each time. That's called Boz to the Future. You can find that on Spotify or iTunes.\n\nLenny (01:41:41):\nBoz to the Future, buy some Quest stuff.\n\nAndrew ‘Boz’ Bosworth (01:41:44):\nGet yourself a Quest 3. Let's be honest. Dude, treat yourself.\n\nLenny (01:41:48):\nThere you go. Or these Ray-Ban sunglasses. I'm a big fan. Boz, again, thank you so much for being here.\n\nAndrew ‘Boz’ Bosworth (01:41:52):\nCheers. Thanks, brother.\n\nLenny (01:41:53):\nBye, everyone. Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "# 播客对话翻译\n\nLenny (00:00:00):\n你基本上是Facebook的第10号工程师。我想那段时间一定有很多人们不常听说的痛苦和煎熬。\n\nAndrew 'Boz' Bosworth (00:00:07):\n我每次睡眠时间都不超过四个小时。我每隔四个小时就会醒来，查看报告，看看是否有人在攻击网站。电影里可不会告诉你这些事情。\n\nLenny (00:00:14):\n你每周工作120小时,没有任何爱好。\n\nAndrew 'Boz' Bosworth (00:00:17):\n我不想破坏这种浪漫主义色彩。只是大多数时候,我们听到的那些浪漫故事都来自成功者。人们想要全身心投入某件事并承担风险,这是件健康的事,但在当时并不光鲜亮丽。\n\nLenny (00:00:29):\n动态消息(Newsfeed)。那是你在Facebook的早期项目之一。人们当时并不想要它。显然,他们错了。\n\nAndrew 'Boz' Bosworth (00:00:33):\n其实,动态消息的情况比人们想象的要简单。虽然所有人都表示愤怒,但与此同时他们对产品的使用量立即翻了一番。\n\nLenny (00:00:40):\n从经济效用的角度来看,Boz你开发的动态消息和广告系统创造了1万亿美元的价值。\n\n(00:00:48):\n今天,我的嘉宾是Andrew Bosworth,大多数人都叫他Boz。Boz是Meta的首席技术官。他在2006年初加入当时还叫Facebook的公司,是最早的工程师之一。在Meta的18年任期中,他创造了互联网历史上一些最具影响力和最重要的产品,包括Facebook动态消息——这是第一个采用算法排序内容的社交网络信息流,基本上就是人们今天所认知的Facebook。\n\n(00:01:17):\n他还构建了最初的Facebook移动广告平台(mobile ads platform),并继续运营了四年。他还帮助构建和扩展了Facebook的消息系统、个人资料、时间线(Timeline)、Facebook群组(Groups),甚至还有内部工程新兵训练营(engineering boot camp)。最近,他担任广告和商业平台副总裁,负责工程、产品、研究、分析和设计。2017年,他创建了公司的AR/VR(增强现实/虚拟现实)组织,现在称为Reality Labs(现实实验室)。\n\n(00:01:42):\n如今,Andrew领导Meta在AR、VR和混合现实(mixed reality)方面的工作,以及Quest、Ray-Ban Meta智能眼镜等消费硬件产品。\n\n(00:01:52):\n在我们这次内容广泛的对话中,我们触及了许多重要的经验教训和故事:Facebook早期真实的样子、为什么你应该更频繁地向你的经理寻求帮助、为什么沟通就是工作本身、Meta过去几年转型的经验教训、Boz对Apple Vision Pro的看法、大量的领导力和职业建议、构建第一个动态消息的经历以及从中获得的教训,还有失败和成功的故事,等等。\n\n(00:02:22):\n如果你喜欢这个播客,别忘了在你最喜欢的播客应用或YouTube上订阅和关注。这是避免错过未来节目的最佳方式,也对播客帮助巨大。\n\n(00:02:32):\n话不多说,我为大家带来Andrew Bosworth,也就是Boz,在简短的赞助商广告之后。\n\n(00:02:39):\n本期节目由Vanta赞助。当涉及确保您的公司拥有一流的安全实践时,事情很快就会变得复杂。现在,您可以通过单一平台Vanta来评估风险、确保客户信任,并自动化SOC 2、ISO-27001、HIPAA等合规性。Vanta市场领先的信任管理平台(trust management platform)帮助您持续监控合规性,同时进行报告和风险跟踪。此外,您可以使用Vanta AI完成安全问卷,节省大量时间。全球数千家公司使用Vanta来自动化证据收集、统一风险管理和简化安全审查。访问vanta.com/lenny可获得1000美元的Vanta优惠。网址是Vanta.com/lenny。本期节目由Eppo赞助。Eppo是下一代A/B测试和功能管理平台(feature management platform),由Airbnb和Snowflake的校友为现代增长团队打造。Twitch、Miro、ClickUp和DraftKings等公司依靠Eppo来支持他们的实验。实验对于推动增长和了解新功能的性能越来越重要,Eppo帮助您提高实验速度,同时以其他商业工具无法做到的方式进行严格的深度分析。当我在Airbnb工作时,我最喜欢的事情之一就是我们的实验平台,我可以轻松设置实验、排查问题并分析性能,所有这些都可以独立完成。Eppo做到了这一切,甚至更多,采用先进的统计方法,可以帮助您缩短数周的实验时间、提供易于访问的UI以深入了解性能,以及开箱即用的报告功能,帮助您避免恼人的冗长分析周期。Eppo还让您可以轻松与团队分享实验见解,为A/B测试飞轮激发新想法。Eppo为每个用例提供实验支持,包括产品、增长、机器学习、货币化和电子邮件营销。访问geteppo.com/lenny查看Eppo,将您的实验速度提高10倍。网址是geteppo.com/lenny。\n\n(00:04:47):\nBoz,非常感谢你的到来。欢迎来到播客。\n\nAndrew 'Boz' Bosworth (00:04:55):\n谢谢邀请我。我一直是你节目的长期粉丝,喜欢你发布的所有内容,所以很高兴终于有机会参加。\n\nLenny (00:05:01):\n同感。我真的很高兴你能来。我至少有十亿个问题想问你。但我想先从我发现的一些关于你的趣事开始,我列举一下,然后你选一个突出的,讲讲背后的故事,怎么样?\n\nAndrew 'Boz' Bosworth (00:05:17):\n好的,听起来不错。\n\nLenny (00:05:18):\n好的。你参加过14次毕业舞会(prom)。\n\nAndrew 'Boz' Bosworth (00:05:22):\n是的,这是真的。\n\nLenny (00:05:22):\n好的,我继续说。\n\nAndrew 'Boz' Bosworth (00:05:25):\n哇,开场就很猛。\n\nLenny (00:05:27):\n这可能就是那个。你在大学时是全国跆拳道冠军。你在大学里是Mark Zuckerberg的AI课程助教(TA),但据我了解这并不是你加入Facebook的方式。哈佛曾招募你去打橄榄球。你在4-H俱乐部非常活跃,小时候养动物并在县集市上展示它们。你曾经和David Copperfield同台演出。\n\nAndrew 'Boz' Bosworth (00:05:52):\n这是真的。\n\nLenny (00:05:52):\nMC Hammer曾经说你的着装很时尚。乔治·W·布什总统曾称赞你的鞋子和你光亮的头。\n\nAndrew 'Boz' Bosworth (00:06:03):\n是的,这些都是真的。我想说,哇。首先,我要确保大家明白,我是全国大学冠军,作为绿带选手,这就像是JV(青年队)冠军。只是想让大家明确这一点。\n\nLenny (00:06:15):\n赢就是赢。\n\nAndrew 'Boz' Bosworth (00:06:16):\n重量级对打。我来讲讲...舞会的故事很有趣。它与4-H的故事有关。我是一个资深的4-H成员,4-H国家名人堂成员,在那里做了很多事情。\n\n(00:06:29):\n由此延伸,4-H是一个很棒的项目,青年项目,男女混合项目,我在全州、全国各地参加领导力活动、会议,做了很多公开演讲。\n\n(00:06:39):\n几乎每个4-H活动都有舞会。人们不知道这一点。在会议结束时,在露营结束时,你会去露营一周,最后都有舞会。\n\n(00:06:49):\n所以,因此,最重要的是,如果想参加很多毕业舞会,我是个好舞者。事实证明,至少在1990年代,女孩选择她们想和谁一起去毕业舞会的高级标准是:他会跳舞吗,他能跳舞吗?而我的答案是肯定的。再加上我认识很多上不同学校的女孩,如果这是某人的目标,这就是成功的秘诀。我高三那年去了两次,高四那年去了12次。我曾经在一个周末参加了三次,星期五、星期六和星期天晚上各一次。\n\nLenny (00:07:21):\n关于你的另一个趣事是,你基本上是Facebook的第10号工程师,最初,远在它成为明确的成功故事之前。我想那段时间一定有很多人们不常听说的痛苦、煎熬和挣扎。他们看《社交网络》这样的电影,会觉得\"哦,那太有趣了。我得创办一家公司。它会成为万亿美元的成功故事。\"我很好奇那些早期日子是什么样的。有什么让你印象深刻的记忆吗?\n\nAndrew 'Boz' Bosworth (00:07:47):\n是的,第10号这件事有点开玩笑的意思,就是我和另外五个人同时加入,在我们之前有九名工程师。我们同一天加入,所以我们都是第10号工程师。所以,根据你想怎么计算,大概在第10到第16号之间。\n\n(00:07:59):\n我在博客上写过这个,也经常讲这个故事,那就是确实很有趣,有巨大的同志情谊和形成的回忆,但这些都是在非常紧张的时期的熔炉中形成的。\n\n(00:08:13):\n那时候,我们几乎所有人都住在距离办公室一英里以内的地方。我们大部分时间一起吃饭,因为我们在工作——不是说我们不是朋友,而是因为我们在工作,就像,哦酷,你就顺便吃顿饭然后回去工作。\n\n(00:08:26):\n还有一些你不会感激的小事,比如没有人能帮助你。没有专家。所以,不是说\"嘿,我在这个棘手的问题上遇到困难,我应该找谁谈谈?\"而是,没有人。你应该自己和自己谈谈,想办法解决这个问题。或者像\"哦,天哪。我的服务器容量不够了。\"那就是\"好的。你应该去Fry's Electronics(电子产品商店),买一堆组件,组装一台新服务器,然后运行它。也许开车去机房(colo),上架,然后回来运行它。\"\n\n(00:08:52):\n人们真的低估了这样一个事实:当你去上班时,即使是今天的中等规模公司,特别是随着支持初创公司的初创公司的巨大增长,像工资、财务、IT和人力资源这些事情,在很多情况下都是专业处理的。\n\n(00:09:10):\n但在21世纪初并非如此。只有你,你的私家车,以及你想用你的时间做什么。\n\n(00:09:18):\n所以,我不想破坏这种浪漫主义色彩,只是大多数时候我们从成功者那里听到这些浪漫的故事。我们很少听到那些真正牺牲了20多岁大部分时间的人讲述,远离任何社交或外出、有趣的环境。\n\n(00:09:37):\n对我来说这得到了回报,所以没有人为我感到难过,也不应该。但也有其他人做了完全相同的事情,也许他们工作更努力,也许他们更聪明,也许他们做得更好,但对他们来说并没有成功。这是一个巨大的牺牲。\n\n(00:09:48):\n所以,我喜欢人们对初创公司的热情,我喜欢初创公司文化。我认为人们想要全身心投入某件事并承担风险是件健康的事。但在当时并不光鲜亮丽。回过头看,就像\"哦,它可以...\"我们给它加了一层光环。但在当时,感觉并不光鲜。\n\nLenny (00:10:06):\n是的。在你提到的这篇文章中,你说你每周工作120小时。\n\nAndrew 'Boz' Bosworth (00:10:07):\n是的。\n\nLenny (00:10:10):\n你没有任何爱好,而且体重增加了很多。\n\nAndrew 'Boz' Bosworth (00:10:15):\n是的。我们喝很多酒来弥补,所以我增加了很多...而且你吃得不健康。那太疯狂了。\n\n# 播客对话翻译\n\n(00:10:22):\n我想我之前讲过这个故事。有一次，我最早做的一件事是构建一个反垃圾邮件、反爬虫的防御机制。但我们当时没有任何运营支持，没有24/7的在线支持。\n\n(00:10:35):\n所以我做了这个工具。我不得不每四个小时醒来一次。大约两年时间里，我一次睡眠时间从未超过四小时。我必须每四个小时醒来检查报告，看看是否有人在攻击网站。如果有，我就得起来，去反击。如果没有，很好，我就回去继续睡。但问题是，电影里不会告诉你这些事情。\n\nLenny (00:10:55):\n这几乎比照顾新生儿还要糟糕。\n\nAndrew 'Boz' Bosworth (00:10:59):\n而且没有人要求我这么做。甚至没有人要求我做反垃圾邮件、反爬虫的东西。我只是觉得这是个问题，然后我就去做了，这就是我想出的解决方案。如果我是个更好的工程师，也许我能解决得更好。\n\nLenny (00:11:11):\n那么，为了结束这个话题，当你和创始人交流时，你在这些方面会给他们什么建议？\n\nAndrew 'Boz' Bosworth (00:11:18):\n关于这个我要谨慎一些，因为当我告诉创始人们……我告诉创始人的第一件事是，我从来没有做过创始人，我想认识到这个区别。我是2006年1月9日加入的。那时距离马克创办公司已经快两年了。我没有参与过融资，我不需要做那些方面的事情，我甚至不需要处理董事会或业务方面的事情。从某种意义上说，我很幸运能在那个时候加入。\n\n(00:11:42):\n但我告诉创始人的第一件事是，\"你们应该对我的建议持保留态度。我实际上并没有真正处于你们的位置。\"\n\n(00:11:47):\n如果我可以夸奖你一下，真的，我喜欢你的节目的一点是，在我们这个行业有一整套专业人士体系。当我在硅谷的科技领域成长时，你总是听说ACM（Association of Computing Machinery，计算机协会）。你听说过这些传奇的专业组织，它们支持我们领域的人们。\n\n(00:12:09):\n但由于技术快速变化的本质，以及这些机构的参与性质，甚至学术界，甚至整个学术界，都有点脱节。你从这些地方获得的工具在我们的领域并不实用。\n\n(00:12:23):\n所以，我确实认为我们彼此给予的指导一直是一个关键且持续的资源。如今，有像你的播客和通讯这样的资源，它们实际上真正旨在帮助我们行业的专业人士，而这在过去15到20年几乎是缺失的，我很高兴看到这一点。因为如果你是一个新兴的[听不清 00:12:45]，从字面上讲，你以前必须认识某个人并向他们提问。\n\n(00:12:48):\n所以，很多时候当我帮助创始人时，我可以帮助他们制定战略，我可以帮助他们思考技术选择，我可以帮助他们考虑业务、管理、组织结构。但我也试图非常明确地表示，有很多东西我从未接触过。\n\n(00:13:00):\n所以，即使我们只是谈论2006年加入Facebook的普通工程师有多艰难，天啊，对于2004年的马克·扎克伯格来说可能更艰难。这个故事已经被讲述过了，我相信，但仍然如此。所以，我认为这两者都是……几乎所有规模都不变。无论你回拨多远，挑战都是有趣的，都值得谈论。\n\nLenny (00:13:22):\n你最受欢迎的帖子之一可能是你分享的这句话，关于你经常给出的建议。你说的是，\"在我的职业生涯中，作为经理、董事会成员、顾问和朋友，我发现我必须给出的最频繁的建议是，让人们更直接地利用他们的领导者。\"你能谈谈这是什么意思，以及这看起来是什么样子吗？\n\nAndrew 'Boz' Bosworth (00:13:40):\n这是一件非常正常、自然且健康的事情。顺便说一句，我们在个人关系中也会这样做。就像我在帖子中说的，我们想自己做。我们想自己做来向每个人证明我们能自己做。\n\n(00:13:52):\n我们在脑海中想，\"如果我寻求帮助，我不是已经放弃了那个目标吗？我不是已经承认在我的一个顶级目标上失败了吗，那就是证明我能自己做？\"\n\n(00:14:04):\n但我们经常忘记的是，很多时候，你的工作不是自己做。你的工作是把它完成，把事情做好、做对、做得称职。而很多时候，你需要的工具存在于你的经理、你的合作伙伴、你的顾问、你的导师那里。它们就在那里。\n\n(00:14:25):\n所以，作为经理，我经历过多少次这样的情况，有人告诉他们，\"这是工作。\"他们说，\"我知道了。\"他们离开，回来，完成了，但做错了。我不是在责怪他们做错了。他们没有和我确认。他们误解了。我们沟通有误。我会承担责任。没问题。\n\n(00:14:42):\n但我们在这里，六个月后，事情没做对，因为他们误解了任务简报。我们在简报上沟通有误。\n\n(00:14:49):\n或者他们回来了，花了一年时间。我说，\"为什么这花了一年而不是六个月？\"他们说，\"哦，天啊。我有很多事情要处理。\"而如果他们给我发了邮件，我本可以铲除那些东西。我本可以清除障碍。我本可以说，\"哦，不，不，不。别担心那个。这才是重点。\"然后我们就能提前六个月完成，他们的挫败感也会更少。所以，轻触即可。\n\n(00:15:09):\n现在，我确实认为作为经理，我们也有责任说，\"嘿，这就是工作的一部分，所以你得自己去搞清楚。\"我总是告诉我的经理们，我们做的最有力的事情之一就是拒绝裁决。有人会带着事情来找我。很多时候我们觉得有义务发表意见和帮助。我会说，\"不，但看，我认为你搞定了。我认为你面临的挑战是正确的挑战。我认为你以正确的方式来处理它。只要尽力而为。\"就是这样。所以，作为领导者、导师、顾问、董事会成员，我们也有责任做到这一点。\n\n(00:15:39):\n但是，顺便说一句，我们在……个人关系中也这样做。你和你的伴侣在一起，你试图以正确的方式做某件事，但你不和他们谈论它。你在那里冒着巨大的风险，而回报却很少。如果你问他们，\"嘿，这是你想要的做法吗？我不知道。\"他们不会生气的。\n\n(00:15:56):\n所以，我确实认为有点好笑的是，我们在脑海中建造了多少这样的城堡，这些小筒仓阻止我们利用围绕我们建立的、旨在帮助我们成功的结构。实际上就在昨天，我看到了帕特里克·斯图尔特的一句很棒的话，他是我一直以来最喜欢的演员之一，我喜欢他的角色，他谈到人们去试镜。这对演员来说是件残酷的事情，对吧？你要去30、40个地方，你被拒绝。这很艰难。每个人都听说过这个。他说，\"没有人比你试镜的人更希望你成功，因为他们希望你很棒。因为一旦你很棒，他们就完成了。他们希望你很出色。\"\n\n(00:16:37):\n这就像你的经理。没有人比你的经理更希望你出色，因为当你出色时，你的经理，他的生活变得更轻松，她的生活变得更轻松。所以，我只是认为这是我们陷入的心态，就像，\"不，不，不。他们在测试我。\"他们不是。他们在为你加油。我向你保证。\n\nLenny (00:16:53):\n我喜欢这个建议。我想人们不这样做的原因，正如你所说，是他们不想让他们的经理认为他们不知道自己在做什么，或者他们无法解决问题。你有什么建议和指导，关于什么时候伸手寻求帮助是合适的吗？\n\nAndrew 'Boz' Bosworth (00:17:06):\n我认为，对于那些对此感到胆怯的人来说，其中一件事是，我认为你可以围绕它设置一个框架，让你的经理很容易参与。你可以说，\"嘿，我在这方面取得了进展。这是我被阻塞的地方，这是当前的计划。\"我甚至会说，\"嘿，如果这一切对你来说都很好，不需要回复。如果这里有你希望我做得更好、不同的事情，或者你认为你可以帮助的事情，请告诉我。\"\n\n(00:17:32):\n我喜欢打字的、五到十句话的电子邮件，\"不需要回复。事情就是这样。\"即使一切都进展顺利，我也会想，酷，这个人理解紧迫性，他们理解任务，他们给我一个小小的心跳，一个小小的回应。\n\n(00:17:53):\n然后，如果两周后，假设阻塞问题很严重，那么你可以说，\"嘿，对不起，但我确实现在需要你的帮助。我确实被这件事阻塞了。\"我有背景。我有你在正确的事情上辛勤工作的心理模型，就是我要求你做的那件事。即使那时，当你被阻塞时，你也可以让我的生活超级轻松。比如，\"嘿，如果你能给这个人发一封电子邮件，我很乐意，这里有一个草稿，有这个想法，那会有帮助。\"\n\n(00:18:23):\n或者就像，这里有具体的问题。\"我认为这是你想要的。对吗？是或否？如果不是，好的，我们会回来，我们会花更多时间。如果是，我们都很好。\"所以现在，我不仅了解了最新情况，我有了一个心理模型，我参与其中。而且，你让我帮助你变得超级便宜。当我告诉为我工作的人，做这些小事是我工作的很大一部分时，他们总是感到惊讶。\n\n(00:18:53):\n在我的规模上，这有点像转盘子。根据你如何计算不同的事物,我有10,000或15,000名员工。所以，就像，时不时我得拿一个全新的盘子、一根全新的杆子，真正投入精力。但在大多数情况下，我只是试图触及一切并保持势头。所以，如果有东西掉了，有人没有告诉我\"嘿，我们在这里失去了旋转速度。我们失去了动力。\"哦，我很沮丧。我会想，\"啊，现在那个盘子掉了。我现在得在这里重新开始一件全新的事情。\"\n\n(00:19:22):\n所以，我认为人们低估了。他们对我的工作的看法与我的工作实际上……我的工作实际上是大量的小触碰。\n\nLenny (00:19:29):\n所以，我认为这里的一个关键要点是，第一，更多地倾向于向你的经理和领导寻求帮助。我喜欢这种表达方式，它不总是需要像，\"这是我需要你做的。\"而是，\"这是正在发生的事情。这是可能阻碍我的事情。这是我有的问题。这是正在进行的事情。\"\n\n(00:19:44):\n这实际上类似于我发现非常强大的东西，我很快分享一下，这个想法叫做……我称之为Lenny状态电子邮件。我每周都会给我的经理发送这封邮件。Lenny的状态。这有点像国情咨文。它是，\"这是我当前的优先事项，这是我广泛考虑的事情，然后这是我需要你帮助的障碍。\"\n\nAndrew 'Boz' Bosworth (00:20:02):\n我们实际上曾经有一个格式叫做HPMs。亮点、人员、我（Highlight, people, me）。从2008年到2014年左右，Facebook的每个经理都会向他们的经理，甚至是他们的领导团队发送。我的意思是，有一次当我负责我们称之为通信应用（comm apps）的时候,我只是把它发给扎克和整个领导团队。\n\n(00:20:24):\n这就像是，重点包括什么？它突出了[听不清 00:20:27]流程。你需要知道的重要事项是什么？人们在哪里？比如有人遇到麻烦了吗？有人处于风险中吗？有人做了非常出色的工作需要表扬吗？然后是我，你个人怎么样？我们称之为HPMs。\n\n(00:20:39):\n实际上，这很有趣。我很久没想过这个了。但是是的，不，我认为这种方式是可行的。而且你看，每个管理者都是不同的，所以即使在Meta层面，顺便说一句，这是另一个成功。我认为人们想要以同样的方式对待每个管理者，但这行不通，因为每个管理者都不一样。\n\n(00:20:54):\n但是每个管理者，你都可以问：\"你喜欢如何获得进展汇报？\"你可以在刚开始与他们合作时就问这个问题。比如：\"嘿，你的节奏是什么？你喜欢如何保持知情？\"所以，对我来说，我会定期进行一对一会议。随着组织规模的扩大，这些会议的间隔时间变长了，所以人们用更多书面的东西来代替这些会议。\n\n(00:21:11):\n但是如果你问：\"你喜欢如何获取关于我的信息？\"没有任何管理者会对此生气。这是一个完全合理的问题。\n\nLenny (00:21:18):\n我很喜欢你分享的那个具体想法，就是起草邮件给另一个团队负责人说：\"这是我需要你告诉他们的。这真的会解除这个障碍。\"这是一个非常酷的想法。\n\nAndrew 'Boz' Bosworth (00:21:27):\n顺便说一句，我总是会加入我自己的……我不会复制粘贴。我总是会看一下然后说：\"好的，我明白了。\"很多时候实际上不是关于你想让对方听到什么，而是关于语气、语调。\n\n(00:21:41):\n它包含了很多历史信息。我不知道。你们之间是否已经来回讨论了12轮，这会让他们觉得我真的是在越级干预？还是说：\"嘿，你第一次听说这件事，我的错。这是我们正在做的事情。需要你的帮助。\"\n\n(00:21:54):\n所以，很多时候甚至不是为了让我的生活更轻松，因为我想复制粘贴。实际上，很多时候是，你的语气和你起草那个便条的方式中包含了丰富的信息集，这将帮助我正确地传达，而不会让人觉得我只是在带外、强硬地介入。\n\nLenny (00:22:11):\n这涉及到我经常听到的Meta工作方式的核心内容，那就是透明度。任何人都可以在问答环节向扎克提问。鼓励人们不断在内部发布他们的想法、他们正在做什么。所有数据都是公开共享的。这经常导致泄密，我听说你讨厌这个，这是你的一个痛点。\n\nAndrew 'Boz' Bosworth (00:22:32):\n这感觉就像是违背了团队信任。感觉就像……我是打体育运动长大的，对吧？我踢过足球、踢过英式足球、跑过田径。你简直无法想象你的队友向对方球队泄露战术。你能想象在那种情况下你会怎么做吗？\"你被开除了。对不起，你不能留在这里。\"无论如何，抱歉。继续。\n\nLenny (00:22:48):\n是的，而且有这么多人，很难找到。这是谁？所以，以这个缺点为例，我想还有其他缺点，比如需要大量工作，而且很多时候会让人感到压力，你认为有哪些好处？为什么这是Meta工作方式的重要组成部分？\n\nAndrew 'Boz' Bosworth (00:23:05):\n是的。这又回到了，我认为，一个原则，那就是真正优秀、有才华的人，你想要充分利用他们。你真的想确保他们得到充分利用。所以，任何时候他们有错误的信息，或者他们没有信息，你现在就阻碍了你公司拥有的经济上最有价值的东西之一，那就是这个人的时间、注意力、才能。不仅如此，你还让他们更加沮丧，现在他们更有可能离开。\n\n(00:23:35):\n如果任何公司的命脉都是内部的人，他们共同致力于某种目标和使命并一起工作，那么你就想最大化这种潜力。而创建这种真正开放的信息生态系统是我们实现这一目标的方式之一。很多时候，我们公司发生的伟大的、非凡的工作并不是来自这种自上而下的单一命令，而是来自人们不仅理解我们自上而下试图完成什么，而且还拥有更多可供利用的信息。\n\n(00:24:16):\n人们谈论自上而下或自下而上的文化，在我看来，这有点像一个神话。如果你见过马克·扎克伯格，这不是一个自下而上的东西。我们追求的想法首先是马克·扎克伯格的想法。这并不是说他不接受新想法，当然他接受，这是一种自下而上的形式，人们可以向他提出想法，他会内化这些想法并采取行动或不采取行动。但当他自上而下地提出想法时，他不是在微观管理，他会深入细节。我要小心这一点。\n\n(00:24:44):\n但他确实为你创造了空间，让你可以带回他所说的东西的三四个版本，然后他从那里进行塑造。如果没有……如果你没有自由度，当然不行，但如果你没有信息，你也做不到这一点。否则，如果你没有可用的信息，我们试图完成什么，为什么我们要这样做，基础设施是什么样的，可用性是什么样的，性能会是什么样的，那么，你就被困住了。你只能按照脚本行事。这对于高才能、高创造力、高度投入的人来说非常无聊。\n\n(00:25:15):\n现在，这确实要付出巨大的代价。你必须真正擅长管理传入的信息。大多数公司的大多数人消费给他们的所有信息，但信息本身是经过仔细管理的。他们得到的是所有他们应该得到的信息。\n\n(00:25:32):\n我们把这个颠倒过来了，听起来很棒，但这不是免费的。即使是从公司外部来到公司的高级人员，我必须指导他们的一件事就是，如何在所有噪音中找到信号？\n\n(00:25:45):\n你必须有一个管理信息的系统。你必须有一个系统来分类传入的信息，摆脱一堆在错误渠道上的或对你不重要的东西，找出你想要加入但只在你选择时才消费的……群组，以及-\n\nAndrew 'Boz' Bosworth (00:26:00):\n……你想要加入但只在你选择时才消费的群组。以及那些你会收到推送通知的东西在哪里？就是那些实时的东西，这需要一些时间。\n\nLenny (00:26:08):\n你提出的关于自下而上与自上而下的这一点非常有趣，因为，当我想到Meta时，我认为这是一个非常自下而上的文化。我听说每个人都提出自己的想法，进行实验，非常鼓励尝试，但听到这个真的很有趣。而且很有道理的是，大多数大创意实际上确实来自高层。\n\nAndrew 'Boz' Bosworth (00:26:26):\n这是这些神话之一。我不认为这是错误的……作为对比，它比许多其他公司更自下而上，因为你在这个框架内确实有这些自由度。但毫无疑问，像马克或我或克里斯·考克斯或哈维，他们对我们作为一家公司应该做什么有非常强烈的意见，你的自下而上性在这个框架内运作。但确实你可以向马克提任何问题，他会回答。我也一样,克里斯也一样,哈维也一样，而且我们当然会从与员工的讨论中获得灵感。所以我不知道，这并不像人们倾向于描绘的那样非黑即白。\n\nLenny (00:27:02):\n我认为这里最大的教训之一是至少让人感觉你有很大的发言权，即使一个公司非常\"这是大战略[听不清 00:27:10]\"，你们非常擅长让人们觉得他们可以产生影响和发言权。\n\nAndrew 'Boz' Bosworth (00:27:14):\n我能告诉你吗，最重要的是给人们明确的指导方针，这样他们就知道他们在哪里……比如，\"他们有空间的地方在哪里，没有空间的地方在哪里？\"我们与马克或我的团队与我进行这些审查时的一件事，我肯定会说：\"对于UI的这一部分，它将会……就像，我会为你画出来。它会是这样的。\"而另一部分。我会说：\"酷，这也很重要。我没有清晰的愿景。你为什么不做呢？\"所以有非常清晰的护栏，就像，\"好的，我们只是在执行任务的地方在哪里？我们有更多灵活性的地方在哪里？\"\n\nLenny (00:27:45):\n有没有一个例子浮现在你脑海中，你就是非常深入细节并画出屏幕？\n\nAndrew 'Boz' Bosworth (00:27:51):\n随着时间的推移，有很多例子。我认为早期，当我们开发News Feed时，马克绝对在白板上画出团队必须放在前端的每一个像素。在后端，他说：\"让它排序，有一些排序。\"所以我觉得我在那里很幸运。我就像，\"酷，我可以在一些排序的事情上自由发挥。\"而克里斯·考克斯和所有其他人都必须真正像素匹配这些东西。但顺便说一句，并不总是这样。所以现在快进到我们在谈论排序，并不是说马克总是对此不插手。当我们进入现代化我们的排序系统时，我们在过去五年中做到了这一点，马克深度参与，就像，\"嘿，混合转变是什么，你如何权衡不同的东西？\"\n\n(00:28:33):\n所以它可以双向发展。就我个人而言，我真的参与了一些相对深奥的事情。例如,我真的坚持认为手部追踪(hand tracking)和混合现实(mixed reality,MR)要进入头显。可以说团队中没有任何支持者。显然我们有一个手部追踪团队,非常出色,还有混合现实团队,但有很多人认为……他们不认为这些功能对于这成为主流设备至关重要。我一直相信它们对于易用性和……所以我真的强行推动这个问题，没有给任何人任何余地，并对我们将在手部追踪上达到的性能基准保持了非常高的标准。团队告诉我这是不可能的。但事实并非如此。它做得很好。\n\nLenny (00:29:11):\n这涉及到这个播客中经常出现的一些内容。关于创始人和高管应该有多深入细节存在争议，他们是应该授权、赋能，还是\"不，我们就这样做。我将深度参与每个模型。\"总是会出现这种上下波动，就像，\"好的，酷，我们要让人们自己运行和做他们的事情，\"然后事情经常开始不太顺利。然后，\"我们要收回控制权。\"关于什么时候深入是有意义的，创始人高管应该如何思考这个问题，你有什么看法吗？\n\n# 播客对话翻译\n\nAndrew 'Boz' Bosworth (00:29:41):\n这对创始人来说是个毫无用处的答案，这取决于具体细节。有些细节真的很重要，有些细节真的不重要。我要说的是，这并不意味着它们完全不重要。你必须去做它们，但它们不是决定成功或失败的关键因素。是的，有些我非常尊敬的人，Brian Chesky 曾经上过节目说：\"看，Airbnb 只会做我能亲自做的事情。这就是它能做到的极限。\" 这是一种非常极端的形式。我非常尊重他以及他们处理事情的方式。我认为，如果你有非常有才华的人，你可以信任他们，让他们负责更大的部分，这是一个选择。如果有方法可以让你有效地检查进度，确保事情在正轨上，那是另一种架构方式。\n\n(00:30:27):\nAirbnb 可能仍然有一些必须进行的工作，比如财务、会计和人力资源，这些 Brian 并没有亲自管理。所以显然有一些非技术领域我们会这样做。或者法律。有些领域我们确实信任它们正在进行中。所以我认为，根据我的交流经验，很多创始人后悔委派了太多事情。我完全理解这一点。或者他们委派了一些关键的事情，而这些事情最终成为了最重要的事情。对我来说，判断的关键是：\"你如何，最重要的是，确定什么是最重要的事情？\" 所以 Mark，我们在 Meta 内部开玩笑，直到今天，我们称之为\"索伦之眼\"（the eye of Sauron）。当 Mark 确定你正在做的事情是最重要的事情时，没有任何细节小到他注意不到。\n\n(00:31:17):\n他会在评审中，在同一次评审中，说：\"从战略上讲，我认为我们偏离了方向。而且，这一个像素绝对是错的。你必须修复它。\" 这个范围很大。坦白说，我会有点自我表扬，我为自己能做同样的事情感到自豪。我认为和我一起工作的人经常评论说，我们拥有的领导风格，我认为 Chris Cox 也是一样的，就是我们会在非常重要的事情上深入到最细节的层面。还有一堆其他的事情当然也很重要。我们很高兴我们在做它们，但要么它们有相当清晰的路线图，行业内有相当清晰的例子，要么就像那是你必须拥有的功能，但不会决定成功或失败。所以把它做成大致的形状，然后进行迭代就可以了。所以我认为这真的取决于具体的细节，你想深入到什么程度。\n\nLenny (00:32:08):\n太有趣了，我在谈论在 Airbnb 工作时，对 Brian 来说非常重要的事情时，用的是完全相同的比喻，索伦之眼。我给人们的建议是：\"你不想在职业生涯中在索伦之眼中待太久，因为如果你一直在做最重要的事情，你会精疲力竭，但你想靠近它。你不想待在夏尔（the Shire），但你想在附近……\"\n\nAndrew 'Boz' Bosworth (00:32:26):\n没错。它们都是……所以我在广告部门工作了多年。从 2012 年到 2017 年，我负责广告和业务平台，这个大型广告团队，这是一个非常重要的领域，但 Mark 有很多其他事情要处理，比如向移动端的过渡，他确实把它委托给了我。这太棒了，得到他这样的信任真的很酷。同时，你也会不断感到恐惧，因为\"Mark 不知道。如果这一切……\" 我的下属会担心，因为他们已经有一段时间没有和 Mark 开过评审会了。是的，你会在索伦凝视的强度中受苦。你也会在它缺席的阴影中受苦。没有完美的位置。\n\nLenny (00:33:09):\n太搞笑了。我在想中土世界的哪个地方可以作为那个比喻。\n\nAndrew 'Boz' Bosworth (00:33:14):\n是啊。\n\nLenny (00:33:15):\n好的，你提到了动态消息（News Feed），这是你在 Facebook 最早的项目之一。关于动态消息，我知道几个有趣的事实。一是它是任何社交网络中第一个算法驱动的动态消息，也许是任何此类产品中的第一个。第二，它是 Facebook 编写的第一个 AI 代码，用于排序实际的动态消息。所以有很多第一次，显然这成为了一件大事。动态消息本质上就是人们现在想到 Facebook 时想到的东西，但它刚推出时引起了极大争议。人们非常反对这个。他们不想与人分享这么多信息，或者他们是这么认为的，然后他们最终意识到，\"哦，这实际上正是我想要的。\" 从构建一个人们最初拒绝但后来意识到他们确实想要这个并且这正是他们等待的东西的经历中，你学到了什么？\n\nAndrew 'Boz' Bosworth (00:34:08):\n这是你在采访中经常讲的一个故事，就像，\"你必须对你正在构建的东西有信念。\" 我有时候的想法是，你在选择你的客户，就像你的客户在选择你一样，你会看到初创公司有时会犯的一个错误是，他们得到了一批早期用户，这些用户的需求实际上会让他们偏离更大的市场。所以他们现在有点被最早的客户绑架了。一次又一次，我们对我们认为这应该是什么样子有一个愿景，而这不是我们现在正在交付的东西。所以使用我们当前产品的人不确定这种改变是否是他们想要的。但我们有信心，随着时间的推移他们会想要的，我们并不总是对的，但在这些情况下我们是对的。现在，动态消息比人们想象的要容易处理，因为每个人都在愤怒的同时立即将他们对产品的使用量翻了一番。\n\n(00:35:05):\n所以我们在那里有一些优势，字面上就像每个人都在说，\"我太讨厌这个了。\" 然后他们会刷新，刷新，刷新。所以我们想，好吧，等等，在陈述的偏好和经济学意义上揭示的偏好之间存在认知失调。所以对我们来说，动态消息比人们想象的要容易坚持一些。但人们有时会误解这一点。他们认为，\"哦，教训是不要听你的客户。完全不是这样。\" 我们当然非常关心。即使是动态消息，我们确实搞砸了一些事情。我总是开这个玩笑，这几乎就像……你知道当你在派对上，音乐很大声，你在和某人说话，音乐在你以超高音量说某事时突然停止，所以派对上的每个人都听到了你说的最后一句话？\n\n(00:35:42):\n现在你是在公共场所说的，所以这不是私人评论，但你也不打算以那个音量广播它。我们对整个用户群做了这样的事情。我们把原本是墙贴（wall posts）的东西，当然，任何人都可以去那个个人资料看到，然后把它放在了显眼的位置，就像现在的孩子说的，\"放在主页上\"，有人就像，\"啊。\" 所以我们做了那个。我不想说得像……我们确实搞砸了一些事情。这不是像，\"哦，这是一个完美的执行。\" 所以另一件要知道的事情是，\"你什么时候搞砸了一些小事情，什么时候搞砸了大事情？\" 什么时候事情本身是错的，什么时候细节是错的？这是一门艺术。这是一门真正的艺术，你并不总是像我们那样有用户数据来确定它。\n\n(00:36:25):\n所以很多时候是，\"你对你期望发生的事情有清晰的愿景和直觉吗？\" 然后发生了什么，你能诊断那里的差异吗？所以在动态消息的案例中，我们犯了一堆小错误。事情本身是对的，我真的为我们在那里做的工作感到自豪。我和 Chris Cox 在工程方面可能是最核心的，你看到的是 PM，在那之前没有排序的信息流。我们之前确实有一些我为反垃圾邮件、反……事物构建的 AI，但它相当基础，但它可能是那种网站中第一个关于内容的消费者 AI。除了搜索之外，我们建立了历史上最有效的货币化表面，我认为。[听不清 00:37:04] 对于那些好奇的人，我不使用货币化是因为我认为钱是最重要的事情。我确实认为它表明了你创造的经济力量，我确实认为这与人类效用非常相关。虽然显然我尊重有些人可能不同意。\n\nLenny (00:37:17):\n就经济效用而言，Boz 的维恩图，动态消息和广告，创造了 1 万亿美元的价值。\n\nAndrew 'Boz' Bosworth (00:37:24):\n这不是——\n\nLenny (00:37:24):\n干得好。\n\nAndrew 'Boz' Bosworth (00:37:25):\n这不是什么都没有，不是什么都没有。\n\nLenny (00:37:27):\n[听不清 00:37:27]。\n\nAndrew 'Boz' Bosworth (00:37:27):\n我们为那项工作感到自豪。\n\nLenny (00:37:28):\n你在关于动态消息的一篇文章中有这样一句话：\"它比生活中任何事物都更完全地消耗了我。它向我揭示了一个真理，当你对某事充满热情时，你会做得更好，你会做得更聪明，你的生产力会提高一个数量级。\"\n\nAndrew 'Boz' Bosworth (00:37:43):\n没有任何替代品。自从那篇文章以来，我对自己的一个认识是，我是一个倾向于对事物充满热情的人。这是我很幸运拥有的天赋，我理解这不是每个人都有的。所以实际上广告这件事就是一个很好的例子。当 Mark 告诉我去做广告时，我说，\"不，我不想。我不认为我对此有热情。\" 我对自己有这样的想法。我对自己有一个非常强烈的身份认同，认为自己是这个 AI 基础设施产品人，我在这个领域工作，不，我错了。我只是一个对事物感到兴奋的人。一旦我进入广告领域，就像，\"哦，这太迷人了。这是一个三方市场，有所有这些不同的……\" 感觉就像我在下国际象棋，考虑与行业中其他参与者的走法，我对此超级兴奋。\n\n(00:38:26):\n然后当他想让我做硬件时，我说，\"不，我不是。我是软件人。我是软件人，Mark。\" 现在，我喜欢这项工作。这是一个如此迷人的空间，我学到了很多。所以我确实认为这是对的。我确实认为当我找到我热衷的东西时这很好。自那以后我学到的是给自己一个空间来了解我是否能对它充满热情。现在，我以前工作中有些部分我就是从未找到热情，六个月后我就必须继续前进。字面上就像我要么辞职，要么被解雇，我做得不好，我不关心这项工作。所以我确实有自我意识。并不是说我能对任何事情充满热情，但事实证明我确实有相当广泛的兴趣范围。\n\nLenny (00:39:01):\n我认为这是一个非常有趣的职业教训，\"不要假设你不会对可能出现的事情感到兴奋。\" 关于这一点，你有什么想和大家分享的吗，比如，\"探索它，给它六个月时间，看看你是否能对它感到兴奋？\"\n\n# 播客对话中文翻译\n\nAndrew 'Boz' Bosworth (00:39:14):\n完全正确。所以从某些方面来说，我的职业发展轨迹非常不寻常，我在很长一段时间里几乎每六个月就换一次工作。我在后台做News Feed（动态消息）的诚信相关工作。然后我在News Feed工作了大约一年。之后我做网站速度、基础设施以及检测SAV和问题。然后我负责Bootcamp（新员工训练营），接着做消息和群组功能。我遇到了一件很有趣的事。我当时开玩笑说，对于那些年纪足够大、还记得《功夫梦》（Karate Kid）的人来说，我感觉自己就像刷了很多栅栏、打了很多车蜡，但最后我学会了空手道。我是说最后，最后我得到了回报，因为我经历了这些，遇到了很多人，在不同的领域工作，理解了不同的动态。而其他和我同批加入的人都在晋升，但他们是单一轨道。他们只是待在一个地方然后得到晋升，而我一直在四处转换。这可能在我职业生涯早期的某个时候，感觉我的发展速度相对同龄人来说更慢。然后当我终于迎来转折点时，真正是从广告业务的任命开始，我做了五年，我的职业生涯就垂直上升了。我的职业生涯就像垂直上升一样。从那以后，我基本上一直保持着那个轨迹。所以我最常给人的建议，至少对我来说，我从中得到的教训是，我愿意积极主动地学习。我会换工作是因为我学不到足够的东西。我感到无聊，所以学不到足够多的新东西。最终进入广告业务岗位的好处，以及我现在所在的岗位，这些工作让我学了整整五年。我在这些工作中从未停止学习。你偶尔会找到那些非常深入、可以持续学习的工作。\n\n(00:40:50):\n与此同时，我的很多朋友，他们的职业发展轨迹在早期比我好[听不清 00:40:55]，他们真的对自己正在做的事情感到厌倦了，但他们没有可以跳槽的地方。没有其他的……他们成为了某个领域的专家，但那个领域对他们来说已经枯竭了。也许他们甚至因为舒适或者因为公司需要他们而停留的时间比他们想要的更长。这最终在他们职业生涯的中期成为了一种阻碍。所以对我来说，就是\"跳到新的事物中去，给它六个月时间。如果不合适，没问题。你刚刚建立了大量新技能，这些会派上用场的，我向你保证。继续前进。\"同样，当你在职业早期确实做出跳槽时，要优化学习，优化……想想复利。就像复利的前10年看起来并不那么令人印象深刻。10年后它才开始看起来不错。\n\nLenny (00:41:43):\n我喜欢这个建议。这和我经常给出的建议类似，\"多样化的经验往往最终成为你随着时间积累的最有价值的东西\"，只是尝试一堆东西，做一些内部工具，也许做客户支持，我不知道，信任与安全、面向用户的产品、基础设施。我是从产品经理的角度考虑的，也许工程师和其他职能也一样。沿着这些思路有一个问题。我们谈到了索伦之眼（the eye of Sauron，指公司最关注的焦点）和做公司最重要的事情。关于你的职业生涯应该有多少时间在那个中心工作，你有什么建议吗?\n\nAndrew 'Boz' Bosworth (00:42:12):\n是的，听着，[听不清 00:42:12]在同等条件下，我认为有两个非常好的位置。我认为一个是在公司不关注但很重要的领域承担大量工作。而且必须是大量的。你必须拥有那些东西并真正移山倒海，因为我向你保证，作为一名高管，当有一座巨大的水坝挡住洪水时，你会非常尊重那个撑住水坝的人。你会说，\"你继续做吧，阿特拉斯，那边干得很好。\"第二好的位置，或者同样好的，是做最重要的事情。在最重要的事情上，这就是Eric Schmidt给Sheryl Sandberg的建议的意义所在，就是\"嘿,这是一艘火箭飞船。上去。不要问我坐哪个位置。就上去。\"\n\n(00:42:59):\n如果这是最重要的事情,你会得到一个较小的部分。每个人都想去那里。拿下那个部分。如果这是最重要的事情,拿下你能够压倒性完成、杀掉、做得很好并从中成长的那部分，因为你会获得大量的曝光度,你会获得大量的经验。你会看到在火中、在火中是什么样子的，这是无价的。你会在任何地方用到这些。所以我这么说。这是在选择项目的时候，但现在我要谨慎一点。要明白，在火中开始的项目，希望以某种金属的方式锻造，冷却后不再在火中，如果上帝愿意的话。同样，像挡住洪水的水坝这样的东西往往会裂开或破裂，或者洪水会淹没[听不清 00:43:42]。所以我认为你确实想在选择时处于这两个位置之一，但同时你也……你要坚持下去。\n\n(00:43:50):\n再次回到我的观点，如果你没有投入，如果你没有做出色的工作，如果你不喜欢它，那就继续前进。如果你已经榨干它了，你曾经喜欢它，但现在不再喜欢了，继续前进。如果你仍然喜欢它并且投入其中，很好。那很酷。那是一件好事。随着时间的推移，你值得从熔炉到水坝再回来。你不必总是不断跳到最新的火坑里。我在广告[听不清 00:44:14]之后尝试过一次。实际上，我花了六个月时间，我们在2012年构建了第一个移动广告产品，在某种程度上拯救了IPO，那时情况已经相当严峻[听不清 00:44:23]——\n\nLenny (00:44:23):\n是的，我记得那件事。\n\nAndrew 'Boz' Bosworth (00:44:24):\n……那个时候。我告诉Mark，我说，\"这太有趣了。也许你可以一直这样做，每六个月就把我放到最大的火坑里。\"他转向我说，\"Boz，那不是一份真正的工作。\"\n\n(00:44:32):\n他说，\"我需要你留在这里并推动它前进，\"我接下来的四年半就是这么做的。太棒了。太棒了。再说一次，我确实给他这样的……有趣的是，我会因为这个遇到麻烦。我既是他最大的批评者之一，也是他最大的粉丝之一。我同时担任这两个角色，但今天我们谈论的东西我认为Mark真的展示得很好。他在推动我的职业发展到我认为自己无法成功的不同地方做得很好。他看到了机会并使之实现。\n\nLenny (00:45:01):\n关于向Mark提出负面批评，你学到了什么，他接受的任何东西?你从中学到了什么?\n\nAndrew 'Boz' Bosworth (00:45:08):\nMark对所有信息和所有观点都如饥似渴。有一件事很有趣，我之前谈到作为创始人，我特别认为，你必须有极大的信念。你必须有极大程度的自信。我认为Mark是我见过的意志力最强的人，纯粹从意志力的角度来说。关于Mark有趣的一点是，你会给他反馈，他会倾听。他是一个友善的老板，所以你会给他反馈，他会倾听。真的会。他最常会告诉你你错了，为什么你错了。这只是最常见的情况。接下来会发生的是……这很不可思议。就像在接下来的一两周内，你会看到变化。我不认为他是在做……\n\n(00:45:55):\n我一直开玩笑说信息传递到他那里。每天有那么多信息传到他那里。然后在晚上，他用所有这些信息重新编译整个世界，然后回来。顺便说一下，这不仅仅是关于产品工作。在我脑海中，我在想产品方面的事情，比如\"嘿，我认为这个产品在这方面做错了。\"他会说，\"不，不，这就是为什么不是那样的。\"然后产品会开始转变。还有就是给他关于他自己在会议中的表现或表达方式的反馈，他会说，\"哦，这就是我那样做的原因。\"然后几周后，你会遇到类似的情况，他会调整他的表现方式。所以我实际上发现给他反馈是一件非常令人满意的事情。真的有效。非常有效，但你确实必须从长远角度看待它。他做的事情，他不是偶然做的。他会有一个理由来解释为什么他以那种方式做。\n\nLenny (00:46:39):\n这是强烈观点、松散持有的一个很好的例子。\n\nAndrew 'Boz' Bosworth (00:46:42):\n是的，没错。\n\nLenny (00:46:44):\n这也让我想到，我认为你用了编译器的类比。我在想模型训练。他在一夜之间重新训练了他的模型。\n\nAndrew 'Boz' Bosworth (00:46:50):\n是的，没错。有趣的是。关于Mark有一件事很有趣，如果你早上给他一些反馈，他接下来的六个会议，无论是否关于那个产品，他都会问人们对那个反馈的看法。他不会说出来源。他只是说，\"嘿，你对这个产品的这个想法怎么看?\"所以你会在会议中看到他这样做。他会来参加你关于其他话题的会议。他会说，\"嘿，Boz，你对这个产品和这个想法怎么看?\"所以他会在一天中，拿着那个小笔记进行压力测试，他喜欢三角定位。对于正在讨论的事情，所有你可能没有看到的观点在哪里?所以他真的重视对每件正在讨论的事情的广泛视角，这真的很有趣。\n\nLenny (00:47:29):\n试图为他的模型获取更多训练数据。我明白了。\n\nAndrew 'Boz' Bosworth (00:47:32):\n你不能让我把Mark称为LLM（大语言模型）。这不公平。这[听不清 00:47:35]。\n\nLenny (00:47:35):\n我们都希望能像Mark一样聪明。在你说话的时候，我注意到了你的纹身，这让我想起你至少有两个我知道的纹身。\n\nAndrew 'Boz' Bosworth (00:47:35):\n哦，是的。\n\nLenny (00:47:45):\n一个是加利福尼亚的，我完全理解。加利福尼亚是一个非常特别的地方，但你还有另一个纹身，就是Veritas这个词。你能谈谈这是关于什么以及为什么这对你很重要吗?\n\nAndrew 'Boz' Bosworth (00:47:58):\n关于纹身总体来说有趣的是，我高中毕业时，我是……我不知道对我来说是否有一个原型，但我直到21岁才喝酒。我是一个非常遵守规则的人。我当时想，\"你为什么要纹身，影响你的身体?\"为什么要染发?就让它保持原样。\"这其中一些原因是，我认为我是一个有特权的人，对自己是谁、想成为什么人有很大的自信，这很好。但在某些方面，我对其他人也有点奇怪的评判，这对我来说有点不正常，当然今天会是这样，但在当时，纹身对我来说是一件大事。我当时想，\"哦，这只是你生命的载体，你可以用它做任何你想做的事。这不像是……这是你拥有的东西，如果你觉得想装饰它，你可以装饰它。\"\n\n(00:48:47):\n所以对我来说，纹身其实是件大事，它彻底改变了我对自己身体的看法，对他人身体、他人存在和时间的看法，甚至在某种程度上，改变了我对死亡的理解。就像，\"嘿，你什么都带不走。一切都会消逝……\"当你18岁的时候，你觉得自己会永远活着，但当你22岁的时候，作为一个饱经沧桑的22岁老兵，你会想，\"啊，纹上那玩意儿吧。反正一切都会消失。\"所以是的，这就是我纹Veritas纹身的原因，这是拉丁语\"真理\"的意思，也就是……我得说这有点俗气，因为这也是哈佛的校训。但我用的是monotype字体。这是程序员的字体。\n\n(00:49:28):\n纹身让我感兴趣的另一点是，它也是代际转变的一部分。我们成长的那个年代，成年人真的把纹身看作是帮派、摩托车手、水手或某些特定类型人的标志。现在据我所知，我最近看到一个数据，说我们这一代人有纹身的比没有纹身的还要多。所以我认为我们在文化上也发生了转变……我觉得丰富的自我表达非常美好。我真的认为这很棒。所以我完全支持这一切。\n\nLenny (00:49:56):\n从你的描述来看，我的推测是，\"真理\"这个理念对你的思考和工作方式非常重要。\n\nAndrew 'Boz' Bosworth (00:50:01):\n恐怕在这一点上，我的名声确实在我之前传开了，也就是……我想当我年轻的时候，我把诚实看作……顺便说一句，我当时是错的。我把诚实看作是一种免死金牌。只要你是诚实的，你就可以随便说什么。这完全不是事实。我以前写过这个，但到目前为止，我职业生涯中最大的遗憾就是我不够善良。我曾经认为……我之前写过一篇笔记叫《善良一点》(Be Kind)，说的是\"友好\"(being nice)，那有点居高临下，或者告诉别人一些半真半假的话，或者只是敷衍了事。我反对那样。但善良不是那样的。善良是，\"嘿，我怎样才能以一种真正有建设性和有帮助的方式来提供这个反馈，以一种能够帮助他们而不是只让他们感到难过和无助的方式?\"\n\n(00:50:50):\n我认为作为一个孩子，作为一个年轻人，我在这方面做错了很多。所以诚实仍然是我性格中很重要的一部分。认识我的人都不会指责我不诚实。而且我认为人们理解并尊重我相当直接，如果我有顾虑或问题，我会提出来。我只是现在在提出这些问题方面做得更好了,能够表达出真正的关心和信念。如果我不认为我们可以做得更好,如果我不认为我们可以解决它,如果我不相信这种情况,我就不会提出来。所以诚实仍然是我身份认同中非常重要的一部分,我认为这是我非常自豪的事情。但我要说的是,自从我纹了这个纹身以来,我如何诚实的语境已经发生了巨大的变化。\n\nLenny (00:51:29):\n这听起来很合理。这触及了我肯定想谈论的一些内容,那就是你最经典的文章之一,这也是我第一次了解你的方式,这篇文章叫做《沟通就是工作》(Communication is the Job)。\n\nAndrew 'Boz' Bosworth (00:51:40):\n是的。\n\nLenny (00:51:41):\n我知道很多人读过这篇文章,也有很多人没读过。我很想让你谈谈这意味着什么,为什么这很重要,为什么这是你想要分享的东西。\n\nAndrew 'Boz' Bosworth (00:51:49):\n是的,这是其中一件事,特别是如果你渴望成为一个领导者……领导力不是管理,领导力也不是成为唯一负责的人,它甚至不总是等同于问责制。但如果你想对世界产生影响……\n\nAndrew 'Boz' Bosworth (00:52:00):\n它甚至不总是等同于问责制,但如果你想对周围的世界产生影响,它只能通过创造影响其他人的工作成果或语言表达来实现。就这些。如果你想产生影响,如果你想创造某种持久的变化,就只有这些。它可能是在你的小关系中,可能是在你的团队中,可能是在你的公司中,可能是在世界上。这都归结为沟通。你经常听到人们说,\"哦,是的,我一年前就写下来了。\"我会说,\"是的,但你一年前写得很糟糕,否则我们就不会浪费一年时间不去做它了。\"\n\n(00:52:47):\n人们总是认为,\"哦,我有那个想法\",这意味着什么。它什么都不意味着。绝对什么都不意味着。或者就像,\"哦,我写了这篇文章。\"好吧,你没有突破。这是你的责任。不是观众的责任。人们总想责怪观众。好吧,观众就在那里。我之前甚至提到过这一点,我希望人们注意到了,当我说,\"嘿,\"我给某人一份工作,六个月后他们回来,他们做错了事情,我会承担责任。我会承担责任。这对他们来说不太好。他们会因为浪费时间而生气,但就像我说的,这是我的责任。我没有清楚地沟通我想要什么,期望是什么。\n\n(00:53:25):\n他们也能帮助自己吗?当然可以,这是一个需要各方共同努力的问题。我们应该从两个角度来解决这个问题。我还有另一篇文章叫《倾听就是工作》(Listening is the Job),这是这个问题的另一面。但《沟通就是工作》是,我真的相信……实际上,这与美国海军陆战队和海豹突击队提出的极端所有权(extreme ownership)理念有关,也就是……每当出现问题时,我都会问自己,\"在沟通方面,我能做些什么不同的事情来让这件事进展得更好?\"我能更好地设定优先级吗?我能更好地设定期望吗?我是否需要一个更好的指标来指引团队?我是否把错误的人放在了这个位置上?\n\n(00:54:04):\n顺便说一句,我谈论的是组织结构图(org charts)是沟通工具。它们不存在。你和你的经理之间没有物理上的联系。它们只是沟通工具,应该让人们大致了解事情是如何组织的,以及应该找谁。所以所有这些都是沟通。沉默也是沟通,我不联系你,不检查你,不检查你的项目。我们之前谈到了[听不清 00:54:29]。这意味着什么?这意味着信任。这意味着责任。缺少检查是有意义的。你不可能不沟通。你总是在用你的脸、你的衣服、你的身体沟通一些东西。你在沟通什么?\n\n(00:54:45):\n我给你举个有趣的例子,我希望我们能把它放进播客里,因为如果你在视频上看这个,你会注意到我的相机不停地调整光线。它总是太暗或太亮。我在试一个新相机。我是个技术宅。我试了很多相机设备,试了很多麦克风设备。我喜欢拥有所有最新的小玩意儿,所以我在尝试新东西。但它不太好用。在我脑海里,我在想,这在传达什么关于我的信息?人们会认为我不在乎或者我不称职。\n\n(00:55:15):\n这就是我在说的。现在,我觉得有必要在播客中解释一下,这样我就可以清楚地表达事实并非如此。我真的认为我在职业生涯中所做的很多事情就是理解其他人的心智模型。他们现在在哪里?我指的是具体的人,比如我的经理或我的关键技术领导者,我指的是一般的人,比如团队,我指的是广泛意义上的普通人。他们在这个对话中处于什么位置?我如何才能精心设计我的语言、我的存在、我的个性,所有一切,来引导他们从他们所在的地方到达我想让他们到达的地方?\n\n(00:55:52):\n这要求我对我想让他们到达的地方有一个非常清晰的想法,必须对他们在哪里有一个清晰的想法。我想告诉你,这并不像听起来那么费力。我想没有人会指责我有这种精心制作的虚假人设。不是那样的。但它确实需要对人们的起点有极大的同理心。这对我来说是关键。其他所有的事情,我在会议上的所有其他表现,试图多微笑,因为我是个又高又壮的大块头,有点吓人,这些都是你需要努力的小事情,它们会成为第二天性,很容易。困难的是对你的受众有同理心,并且想,\"他们在哪里?他们从哪里开始?\"当你没有做到这一点时,要承担极端责任。\n\nLenny (00:56:31):\n这里面有太多好的建议了。有太多线索我想追随,但让我们跟随最后这一个,就是试图理解如何最好地与某人沟通。有没有一个例子能让人们更真切地理解这一点,就是你做了什么,\"哦,我要这样与这个人沟通?\"\n\nAndrew 'Boz' Bosworth (00:56:46):\n我给你举几个例子。一个是多模态性(multimodality)。有句老话,重复从不会毁掉祈祷。我认为大多数有经验的沟通者,无论是作家还是公开演讲者,都会谈到以几种不同的方式多次重申一个观点的重要性,以确保人们有机会内化它。你想使用它,你想直接说出来,你想使用隐喻。所以对我来说,我会开一个全体会议,然后写一篇包含全体会议内容的文章,因为不同的人会对这些模态有不同的反应,并且会以不同的速度在这些不同的模态上吸收信息。这是个简单的例子。\n\n(00:57:23):\n我一直想到的另一个是确保你解决人们的恐惧和担忧。如果人们认为你不知道发生了什么,他们就不会听你的。所以,当我们谈论某种问题时,我最喜欢做的事情之一就是开门见山地说,\"嘿,让我明确一下。这是我们遇到的问题。我知道我们遇到了这个问题。我知道什么是重要的。\"然后我会说我本来要说的话,但如果他们不接受前提,他们实际上会完全忽略我,因为他们怎么能相信我的结论呢?你明白我的意思吗?我认为这里面有很多内容。显然,当你面对面交流时,会容易得多,因为你在解读面部表情。即使在这里,我也在看你点头。我想,\"好的,他跟上了。\"然后我会插入一句,\"你知道我的意思吗?\"而如果你歪着头看我,我就会带来第二个例子来试图强化这个观点。但你要逐步建立起来。现实地说,大多数人在职业生涯开始时会试图影响一两个人。这就是你的起点。一两个人。这就是你要沟通的对象。你的经理,一个队友,这就是你拥有的。然后你逐步建立和发展技能,在越来越大的规模上做到这一点。\n\nLenny (00:58:36):\n我非常喜欢这些建议。我认为这对人际关系也很有帮助。\"这是你不高兴的地方。\"\n\nAndrew 'Boz' Bosworth (00:58:42):\n完全正确,百分之百。\n\nLenny (00:58:43):\n\"这是我认为我们可以做的。\"\n\nAndrew 'Boz' Bosworth (00:58:46):\n再次强调,Meta慷慨地支持我在那里所做的自我提升工作,有很好的导师,Sheryl Sandberg、Mark Zuckerberg,还有其他一些人和教练,这绝对让我成为了一个更好的伴侣和丈夫,还有我的妻子。然后顺便说一句,反之亦然。有了孩子并深入研究关于养育孩子的文献。顺便祝贺你。深入研究那些文献让我成为了一个更好的管理者。绝对让我成为了一个更好的管理者,在思考人们如何管理自己的情绪以及如何在那些时刻与他们互动方面。\n\nLenny (00:59:16):\n太棒了。我们需要第二版 Boz 的育儿建议。\n\nAndrew 'Boz' Bosworth (00:59:19):\n没错。\n\nLenny (00:59:20):\n还有感情建议。\n\nAndrew 'Boz' Bosworth (00:59:21):\n都是好东西。《No Bad Kids》，Lansbury 的书，《Good Inside》，Becky 博士的书。这些都是——\n\nLenny (00:59:28):\n我喜欢 Becky 博士。\n\nAndrew 'Boz' Bosworth (00:59:28):\n我真的认为现代育儿经典著作非常丰富。\n\nLenny (00:59:33):\n太棒了，这么多好内容。本期节目由 Explo 赞助，这是一款面向客户的分析和数据报告领域的游戏规则改变者。你的用户是否渴望在你的产品中获得更多仪表板、报告和分析功能？你是否厌倦了自己构建这些功能？\n\n(00:59:49):\n作为产品负责人，你可能在路线图上有这些需求，但优先级排序的困扰是真实存在的。从零开始构建分析功能可能既耗时又昂贵，而且是一个非常具有挑战性的过程。这时 Explo 就派上用场了。Explo 是一个完全白标的嵌入式分析解决方案，完全以你的用户为中心设计。入门很简单。Explo 可以连接到任何关系数据库或数据仓库，借助其低代码功能，你可以在几分钟内构建和设计仪表板。\n\n(01:00:18):\n准备就绪后，只需用一小段代码将仪表板或报告嵌入到你的应用程序中即可。最棒的部分是，你的最终用户可以使用 Explo 的 AI 功能生成自己的报告和仪表板，从而减少支持团队的客户数据请求。在几天内构建并嵌入一个完全白标的分析体验。访问 explo.co/lenny 免费试用。网址是 E-X-P-L-O dot C-O slash Lenny。\n\n(01:00:47):\n好的。你提到了这些你喜欢玩的小工具和相机。让我们聊聊 Vision Pro 和 VR 头显。你试过 Vision Pro 吗？有什么想法？\n\nAndrew 'Boz' Bosworth (01:00:57):\n实际上，Mark 和我一起试过，我想首先说，当这款头显发布时，我们松了一口气，因为里面的东西并不代表根本性的突破。里面的所有东西都是我们可能已经做到的，除了 Apple Silicon（苹果芯片），这是一个奇迹，但它的价值有限。Apple Silicon 就像是一个 2 倍的奇迹，但当你做诸如扩展显示分辨率这样的事情时，不幸的是这是一个二次方的命题，所以 2 倍的线性扩展优势在你试图扩展分辨率时并不能带来你所期望的那么多收益。这是第一步。但我们仍然认为，在那个价位上，凭借他们传奇般的对细节和打磨的关注，他们可能生产出了一款很棒的产品。实际上我在一周前与 Matthew Ball 的播客中说过这样一句话：\"听着，我准备好进入市场说我们有最具性价比的头显。如果你想要一款出色的、性价比最高的头显，我们有，那就是 Quest 3。\"\n\n(01:01:55):\n当我和 Mark 一起试用 AVP 时，我非常兴奋，我们说：\"不，我们认为我们有真正最好的头显。\"现在，我们并不是说它在所有方面都是最好的。如果你静坐不动观看高分辨率电影，Apple Vision Pro 真的很棒。它真的很棒。分辨率表现出色。如果你静止不动并直视前方，他们调校透视功能的方式非常出色。他们在 UI 方面做了一些非常好的事情。作为产品人员，这是让我们有点恼火的事情之一。\n\n(01:02:31):\n我知道这种事情发生在我们所有人身上。苹果、谷歌、我们都会遇到。我们内部有很多正在试验的东西，这些东西最终会发布，然后我们会被指责偷了它们，但实际上我们并没有偷。如果你愿意，可以去看看我在 Quora 上关于\"点赞\"按钮历史的回答，之前就发生过这种情况，我们在\"点赞\"按钮在其他地方推出之前就已经在内部构建了它。总之，这种事情在我们这个行业经常发生，我真的不应该这么在意。这有点是我的自我在作祟，如果我负责任的话，我应该控制和压制这种情绪。\n\n(01:03:03):\n漂亮的 UI 打磨，他们在眼动追踪方面做得非常出色。眼动追踪有趣的一点是，要以他们的方式做到这一点，这就是为什么你必须使用处方镜片插件，所以它不支持你的眼镜。你必须购买处方镜片插件。它们很贵。他们可以通过镜片以及周围的光线拍摄追踪你眼睛的摄像头。我们的 Quest Pro 是从侧面进行追踪的，这样你就可以戴矫正镜片。\n\n(01:03:27):\n所以像这样的不同选择有不同的权衡，但这仍然很酷。他们能做到这一点很棒。同时，我们的手部追踪更好。显然，我们知道应用库会更好。这对他们来说不完全公平。他们刚刚推出，而且量还很小，但我只是觉得舒适度……真正让我印象最深的是，Apple Vision Pro 的视野真的很小。互联网上有些人对此的描述不正确。他们在靠近镜片的地方进行描述。一旦你考虑到眼距，也就是镜片和你眼球之间的距离，对于几乎所有面孔来说，他们的视野相对于我们的来说都变得相当狭窄,我发现这很让人分心。\n\n(01:03:59):\n他们的显示屏比我们的暗得多，当我在混合现实使用场景中时，我发现运动模糊真的很让人分心。正如我在播客早些时候提到的,我是混合现实的超级粉丝。我非常看好这个潜力，顺便说一句，原因与他们完全相同，我认为手势和混合现实让更多人感觉更容易上手。不过我很高兴我们的设备中有控制器，因为它真的扩展了你能做的事情。我们不只是用一种东西操作电脑。我们有键盘，有鼠标，我们一直在使用多种模式。我真的觉得舒适度、我们的透视功能中缺乏残影和运动模糊、我们显示屏的亮度,我当时想：\"天啊，如果让我选一个带走，我会选 Quest 3。\"\n\n(01:04:40):\n现在，人们理所当然地说：\"这很有偏见。\"当然是的。去形成你自己的观点吧。但最让我难受的是大多数人没有这样做。他们没有试过 Quest 3。这是最让我难受的。如果你去试试 Quest 3，问问自己是想要七个那样的设备——一个给你，六个给你最好的朋友——还是一个 Apple Vision Pro。我确信答案对每个人来说都不是 Quest 3。有些人有一些真正适合他们生活的使用场景，Apple Vision Pro 适合他们，我对此没意见。\n\n(01:05:05):\n但人们甚至不知道 Quest 3 可以做远程桌面。你可以通过一个叫做 Remote Desktop 的非常流行的应用程序来实现，或者你可以进入 workrooms，从你的机器上串流三个环绕你的显示器。我认为这其中一些只是人们甚至没有做功课。他们甚至没有尝试过。我欢迎所有认为我有偏见的人以某种方式证明你的想法，但不要在没有戴上 Quest 3 并全面体验它的情况下就下结论，因为它是一款相当出色的设备。而且你可以用那额外的 3000 美元做很多事情。\n\n(01:05:38):\n顺便说一句，他们是怎么做到的？我们推出了一款售价 1299 美元的头显，人们为此疯狂。他们说：\"啊，3500 美元，没关系。这很好。没人在乎。\"我不知道。要求公平有点过分，我也不在乎这个。苹果赢得了他们建立的伟大品牌。他们真的做到了。我认为这非常了不起。我当然赞赏很多苹果产品。我是他们工作的超级粉丝。我非常欣赏他们所做的事情。这可能就是为什么我对 AVP 期望更高的原因。\n\nLenny (01:06:06):\n好吧，我会给你看我最喜欢的 AR 设备，就是这些 Ray-Ban 眼镜。我实际上买了它们。\n\nAndrew 'Boz' Bosworth (01:06:13):\n是的。\n\nLenny (01:06:13):\n来，我戴上它。我要做的是，我要录制。我没告诉你我要这么做。我要在我们说话的时候录制这个。看这个。\n\nAndrew 'Boz' Bosworth (01:06:20):\n我喜欢。它们在你身上看起来也很好。这很合适。\n\nLenny (01:06:23):\n我岳母说：\"你看起来很有文化。戴上这个你看起来真的很聪明。\"我们实际上买这些是为了拍摄我们的孩子，或者我们的孩子，而不是让摄像机对着脸。这太棒了。\n\nAndrew 'Boz' Bosworth (01:06:34):\n这真的是最好的。看着手机屏幕，让真实的东西在你和屏幕之间，这太难了。不，眼镜是做到这一点的方式。\n\nLenny (01:06:43):\n看这个，我的新造型。我就一直戴着眼镜。\n\nAndrew 'Boz' Bosworth (01:06:46):\n我们得给你弄个多模态的。我从 12 月就开始玩那个了，你可以用摄像头向 Meta AI 助手询问事情。它真的很好。我最近和家人在一个滑雪村，我戴着它们。我就说：\"嘿，看看。告诉我你看到了什么。\"我找到了一个标志，它给了我方向。\"嘿，洗手间在那些楼梯下面右转。你想吃东西吗？在右边。\"它无法告诉我我在哪个村子，但它说：\"你在某个滑雪村。这是便利设施。\"我想：\"哇。\"这里有些真正神奇的东西。\n\nLenny (01:07:18):\n我觉得我需要这个来做播客采访，这样我就可以有一个小声音告诉我要问什么问题以及我现在进行到哪里了。\n\nAndrew 'Boz' Bosworth (01:07:25):\n对，完全是。是的。\n\nLenny (01:07:26):\n这会有多大帮助？\n\nAndrew 'Boz' Bosworth (01:07:27):\n好的，我要在这个问题上作弊一下说，显然我们已经聊了一段时间了，但玩具有完整 AR 功能的眼镜，我们有一款据传很快就会在内部推出，传闻如此之多，以至于你甚至可以说它几乎已经被确认了。真正有趣的是能够玩这些时间机器，就它们的本质而言。这是惊人的技术。人们用眼镜进行演讲，大型全公司范围的演讲，所有笔记都在眼镜上。他们可以只用一个手势控制幻灯片。\n\nLenny (01:08:05):\n哦，天哪。\n\nAndrew 'Boz' Bosworth (01:08:07):\n有令人兴奋的事情即将发生。未来看起来相当光明。\n\nLenny (01:08:10):\n我想谈的一件事是，当 Mark 发布整个视频，\"这是我对 Apple Vision Pro 与 Quest 的看法\"时，很多人只是说：\"哦，天哪，因为他发布了这个视频，他一定非常害怕正在发生的事情，这不是正确的举动。\"这背后有什么思考？有战略思考吗？还是只是他的想法：\"这是我的想法\"？\n\nAndrew 'Boz' Bosworth (01:08:29):\n这家伙对现代时代做了[听不清 01:08:30]。每个人对每件事都想太多了。一切都是四维国际象棋。那只是 Mark 对这个东西的看法。那就是他的想法。我认为他想确保人们记住，嘿，Quest 3 实际上是一个更好的设备，而人们甚至没有试过它。\n\n(01:08:46):\n所以我们并不总是在这里下四维国际象棋。有时我们只是说：\"这是我认为是真实的事情。我要用嘴说出来。\"这就是他做的。这并不难。当我这样做时，每个人都会期待,因为我的人设或品牌或任何东西。我想当 CEO 这样做时人们会感到惊讶。好吧，我理解。这很酷。那里有其他的社会期望。\n\n(01:09:08):\n我们都很熟悉苹果在《纽约时报》上刊登\"欢迎IBM\"广告的事情，还有Slack对微软做同样的事，以及鲍尔默关于iPhone的评论。这些都不是对产品技术优势的真正讨论。那些都只是大型的、鼓舞士气的姿态。但这次不一样。马克很深入，他是这方面的专家。我也是这方面的专家。我对我们的选择感到很满意。\n\n(01:09:39):\n顺便说一句，当我使用它的时候，我能完全进入设计者的思维。我可以通过使用它来告诉你他们得到了什么指示，那个团队得到了什么指示。我可以告诉你他们在优化什么。我可以告诉你他们受到了什么限制。通过他们做出的所有选择，我可以告诉你所有这些事情，我理解它在这方面的一致性。我们做出了不同的选择。这不应该让任何人感到惊讶。我们更喜欢我们的选择。我们本可以做出那些选择，但我们没有。我们做出了这些其他的选择。\n\n(01:10:06):\n所以对我来说，重量、线缆，总是蹭到我的耳朵，可装入口袋这件事，我理解。但这不是我会做的，我知道这一点是因为我有机会这样做，但我选择不这样做。我不知道。我不知道为什么人们会感到惊讶。这不是什么大的、精明的战略举措。这只是，马克有机会使用它。他就想，\"哦天哪,我觉得我们应该告诉人们这里的真实情况。\"然后我们就这么做了。\n\nLenny (01:10:34):\n我喜欢这个见解。我知道很多观看的人会想，\"哦，天哪，他说得对。哇。我没有这样想过。\"所以我认为它产生了很大的影响。\n\n(01:10:41):\n我想稍微放大一下视野，谈谈Meta在过去几年的历程。感觉公众对Meta的看法经历了巨大的下滑，股价也是，然后在过去几年里出现了巨大的转机。感觉总能从这些时期学到很多东西。就拿股价为例,我刚查了一下，它曾跌到80美元左右，现在今天是487美元。\n\nAndrew 'Boz' Bosworth (01:11:05):\n是的。\n\nLenny (01:11:06):\n我很好奇你从经历那次低谷和转机中学到了什么。我知道这还在进行中，但你从那段旅程中学到了什么？\n\nAndrew 'Boz' Bosworth (01:11:16):\n是的。嗯，有很多值得总结的，我得告诉你。我认为我们经历了历史上最大的单日股价下跌，然后在18个月后又经历了股市历史上最大的单日涨幅。\n\nLenny (01:11:27):\n天哪。\n\nAndrew 'Boz' Bosworth (01:11:27):\n正如传奇人物卢·霍尔茨(Lou Holtz)所说，\"当你赢的时候，你永远不会像他们说的那么好，当你输的时候，你也永远不会像他们说的那么糟。\"马克总是用这句话来指导我们内部，试图让我们与外界意见的变化无常稍微隔离一点。这不仅适用于股价。这也适用于媒体和新闻。它适用于很多事情。\n\n(01:11:53):\n我告诉我的团队的一件事，我现在还得向他们重复，就是，\"当你身处其中时很难记住的一件事是，你比批评者知道得多。你比市场上的分析师知道得多。你比媒体知道得多。你比播客主持人知道得多。你比推特知道得多。关于我们公司真实的、实质性的价值，你知道的比他们多。这并不意味着忽视他们，因为他们有不同的视角，你需要理解它。即使总体上不如你知道的多，它可能包含你不知道的部分。\"我是个超级粉丝，我阅读对所有事情的批评，而且我非常仔细地阅读，寻找确认偏差，寻找我可能倾向于抵制但可能是真实的东西。我欢迎所有批评，但我也不会盲目接受批评。我不会只是说，\"是的，这显然是真的。\"\n\n(01:12:55):\n盖尔曼失忆症(Gell-Mann Amnesia)是一个很好的概念，每个人都应该理解。盖尔曼失忆症是这样一种特性：你会读一篇报纸文章，比方说报纸，为什么不呢，关于你是专家的某个主题，你会感到困惑，因为这是一篇不仅仅是错误的文章，它颠倒了因果关系。迈克尔·克莱顿(Michael Crichton)，我会引用迈克尔·克莱顿关于这个的话，\"这是一个湿人行道导致下雨的故事。\"你会想，\"多么糟糕、bizarre的故事啊。\"\n\n(01:13:22):\n然后你会翻到报纸的下一页，那将是另一篇关于你一无所知的主题的文章，你会把它当作福音真理来读。你会想，\"哦，不，看看这个关于这种外国情况的信息。\"就像我说的，完全真实。我们应该比这更聪明。那么这是否意味着你不读那个东西？不，你读它。你只是以这样的视角阅读所有东西，\"等一下，这是另一个观点。我如何将其整合到我可以拥有并了解的整体视角中？\"\n\n(01:13:55):\n首先，宏观的事情是采取长远的观点，意识到当你处于低谷时，它并不像你想的那么糟，当你处于顶峰时，它并不像你想的那么好。在任何时候它都介于两者之间。第二件事是沟通是工作。我认为我们确实没有有效地与市场沟通我们未来的投资。听着，我们有两个长达10年的巨大投资领域。一个是AI(人工智能)，一个是reality labs(现实实验室)。而AI今天看起来相当不错。我认为我们都可以同意Llama 2、FAIR(Facebook AI Research,Facebook人工智能研究院)以及我们取得的突破。\n\n(01:14:33):\n人们没有注意到FAIR，我们的AI研究实验室，是仅次于谷歌的AI领域被引用第二多的研究实验室。我们一直在做这项工作。我们不是随便来这里的。我们一直在做，所以这看起来相当不错。我认为我们没有做足够的工作向人们解释这些最好的方面。以前,核心业务发展得足够强劲，他们愿意忽视它们。用沃伦·巴菲特的老话说，\"只有当潮水退去时，我们才能看到谁没穿泳裤。\"所以当潮水退去时，当你有乌克兰战争、利率上升和经济衰退时，现在每个人都在争夺那增量的美元，他们会说，\"去摆脱这些东西。\"\n\n(01:15:15):\n我们必须告诉公司，\"你不想在一家公司工作，当时局艰难时，它会扼杀所有未来的增长，只是巩固核心业务。\"那是一家只是让自己在某个时候死亡的公司，比预期晚一点，但在某个时候会死亡。你想在一家拥有平衡投资组合的公司工作，而我们有。我们没有很好地解释这一点，所以我们花时间向市场、媒体、每个人解释这一点。\n\n(01:15:38):\n现在，我认为随着人们理解它的规模和范围，当然核心业务克服了来自ATT(苹果的App Tracking Transparency,应用跟踪透明度)和其他类似问题的挑战也有帮助，它看起来相当不错。我确实认为一部分是，作为内部人员，真正调节你对外部叙事和波动的依赖，这非常重要。你基于理解自己的专业知识来做到这一点。第二部分是理解为什么存在差异。那里有什么？抓住它。这通常是沟通问题。\n\nLenny (01:16:10):\n组织结构也有很大的扁平化。这是很多人谈论的事情，管理者变成了IC(Individual Contributor,个人贡献者)。关于如何调整组织以提高效率，还有什么可以学习的吗？\n\nAndrew 'Boz' Bosworth (01:16:22):\n当然，我应该把这一点包括在第一部分中。我有点急于优雅地总结成两点。但你是对的。\n\nLenny (01:16:27):\n我很感激。\n\nAndrew 'Boz' Bosworth (01:16:29):\n我们在业务运营方式上做出了重大转变，这是非常痛苦的。听着，这要追溯到COVID的繁荣时期，当时看起来电子商务、远程工作和这些工具集方面出现了真正持久的结构性转变，这正是我们构建的东西，这为我们做好了准备。所以我们建立了一支庞大的员工队伍来追求这些机会。我们仍然相信这些机会，但它们回到了原来的时间线上。实际上，从字面上看，如果你看看我们内部的一堆图表，它就是COVID的繁荣，然后，不是真正的萧条，但随着它的消退，一切都回到了原来的轨迹。\n\n(01:17:16):\n我们没有失去阵地或失去时间，但提前并没有发生。嗯，这意味着你的经济状况不再有任何意义。现在，你做了一堆投资，它们将在未来太远的地方产生回报，更快地到达那里不会帮助你，而且你承担了很多额外的成本。这很糟糕，伙计。很糟糕。我们对此感觉不太好。我们真的不觉得。这是生意，很糟糕，但它会发生。\n\n(01:17:41):\n我确实认为那段时间有趣的一件事是，对于我们这些成长起来并亲眼目睹了互联网泡沫的人来说，我在硅谷出生和长大，所以当我高中毕业上大学时，这一切都在我周围，然后是2008年的房地产崩盘引发的重大衰退以及市场上的所有那些东西。现在，让我们想象你在2009年大学毕业——\n\nAndrew 'Boz' Bosworth (01:18:00):\n——并找到了一份工作。好吧，该死，你的职业生涯已经15年了，你可能是个总监,但你从未见过经济衰退。我认为我们还有,除了在业务中非常不幸的常规误判导致我们过度招聘,我们不得不纠正之外。你还有一支完全没有这种心态的员工队伍，认为这永远不可能发生。当这发生时感觉就像是天灾,而事实上这就像所有业务的周期性本质,这在某个时候会发生,你希望它不会,你希望它没有,但你必须处理它。所以我认为整个行业都在那里经历了一场相当艰难的风暴,我们仍在感受它。我认为我们仍在感受它。\n\n(01:18:45):\n当然我们很高兴Meta已经超越了那个阶段,我们再次增长,以稳定的速度执行,对此感觉非常好,但我们行业的其他许多公司还没有。对于工程师、产品经理、设计师、每个人以及围绕他们的所有支持职能来说,这是一个非常不确定的时期。我对此非常同情。我认为显然发生在Meta内部的误判在所有地方都发生了,现在尤其是利率更高,现金不那么便宜,跑道更紧。人们只是在做那些务实的决定。我认为我们会从中反弹回来。我认为这是行业正常会发生的事情,但这并不会减少我对那些受到影响或生活在恐惧中的人的同情和共鸣。\n\nLenny (01:19:29):\n我在和一个在Meta工作的朋友聊天,我问她在Meta工作是什么样的,她就说,\"很紧张,以前更轻松。这里那里有些人在混日子,\"现在她说,\"不,所有那些人现在都走了。只剩下紧张的人了,我们工作非常努力。\"这让你想到什么吗?\n\nAndrew 'Boz' Bosworth (01:19:48):\n是的。我不想评论那些离开的人。人们离开Meta有各种各样的原因，同样，职位取消在很多情况下是因为我们只是决定现在不做这项工作。我们打算两年后再做，不需要养一个团队来做这件事。我认为很难一概而论，因为每一个都是一个特定的人，有着特定的生活和丰富的故事，值得被讲述。但我确实认为，如果有人在混日子，而你作为经理必须做出艰难的决定，决定你要带谁，你会倾向于哪个方向——我强烈怀疑，再说一次，我不认识你说的那位朋友——我强烈怀疑那个人可能已经在努力工作了。你明白我的意思吗?那个人可能已经在努力工作了。我不认为我们改变了任何个人的工作努力程度。我真的不这么认为。\n\n(01:20:35):\n我确实认为在将要发生的事情上存在选择偏差,我认为这可能就是你看到的情况。事实上,如果可以找到一个普遍性的话。\n\nLenny (01:20:43):\n也许作为最后一个问题,我有一个环节叫做\"失败角\",我会请嘉宾分享他们职业生涯中的一次失败,以及从那次经历中学到了什么。有什么让你想到的吗?\n\nAndrew 'Boz' Bosworth (01:20:55):\n我失败过很多次。我做过没人用的产品。我构建过无法扩展的技术架构。我失败过很多次。我不后悔其中的大部分。几乎每一次我都有所收获。那是通往更好解决方案路上的一站,或者是认识到这个东西永远不会成功,这本身就是一种礼物。所有我后悔的、我认真对待的失败,都是个人层面的失败——我以一种我不自豪的方式影响了一个人,也许当时也不自豪,因为我没有控制好自己的情绪或心情。我感到恐惧,我感到害怕,有很多这样的事情,其中一两件特别突出,但我不方便分享,因为我认为受影响的人会希望我不要分享。\n\n(01:21:46):\n我会分享一个……我想那个人和我现在关系很好。我们有过一次非常愚蠢的讨论。我记得非常清楚。在客户端-服务器架构(client server architectures)的早期,Facebook显然是一个网站,所以你要调用服务器来获取网页,然后那个服务器会调用其他服务器来收集数据,这是远程过程调用(remote procedure calls,RPC)的主要客户端之一,因为新闻推送排名(newsfeed ranking)都是在另一组服务器上完成的,那些服务器有自己的特殊要求和特殊构建方式。所以你的主网络服务器会通过远程过程调用向远程服务器发出调用并获得响应。我们有一个非常简陋的RPC系统,我不会说是谁建的,但它就是一堆垃圾,经常出故障。完全不稳定。我们最优秀的工程师之一,Mark Sleek,建了一个新的叫Thrift。这是一个很棒的,真的很棒的RPC基础设施。\n\n(01:22:47):\n我最好的朋友之一,Dave Federman,我的一个非常好的朋友,也是一位杰出的工程师,我们在讨论如何进行编码,我说:\"我想要二进制编码(binary encoding)。\"我说:\"你应该用二进制编码。我想让它在传输中超级高效,\"因为我要存储这些RPC。它们为我们做两项工作,一项是主动RPC,但我也会将RPC存储在日志中并重放它们来完成我们在新闻推送排名中正在做的工作。那时候就是这样做的。都是异步离线的,所以我想让它尽可能紧凑。我的内存带宽非常有限,那时候内存非常昂贵,Dave Federman说:\"不不不,那是短期思维Boz,我们应该使用Linux风格的描述符(Linux style descriptors),那是纯英语的。然后你可以查看日志,你可以看到它是什么。内存带宽可能会变便宜,但这些日志对开发来说的可读性将是更好的选择。\"这是工程师诱饵。\n\n(01:23:42):\n你们这些做过工程师的人,这就像Vim与EMX之争。这是工程师诱饵。这很深入。这是一个由来已久的老话题。\n\nLenny (01:23:51):\n我喜欢。继续说。\n\nAndrew 'Boz' Bosworth (01:23:52):\n房间里全是公司的工程师,公司也不大,所以房间里可能有公司一半的工程师。我在大喊大叫。真的,我脸都红了,在冒汗。我对Dave Federman反驳我的提议非常生气,而我是主要的RPC客户。有几件事。这太蠢了。Mark Sleek只是建了两个编码器。这不难。你可以为你的需求选择你想要的编码器。这是最简单的解决方案。第二件事是Dave是对的,顺便说一句。在一年之内,内存带宽确实不重要了,相对于试图进入这些日志有多么难以理解。我不得不构建大量额外的定制软件来解析日志并理解发生了什么。但这也是一个案例,我的身份认同(identity)与正确性绑在一起。对于那些不知道的人,身份威胁(identity threat)是最大的……当你认为你的核心身份受到质疑时,你最糟糕的行为总会暴露出来。\n\n(01:24:51):\n当你觉得你如何看待自己的某个核心部分受到质疑时,你会用你全部的力量来捍卫那个自我概念,因为重新构思你是谁的代价太高了,所以你会保护自己。所以我的身份就是正确。[听不清01:25:08]打手腕。这导致我对我最好的朋友之一,我认识的最好的工程师之一,一个我真的一起住过的人,发生了一场对我来说非常尴尬的冲突,每个人都在挠头想\"Boz现在是怎么了?\"我看起来像一个失控的疯子。我记得那个房间,我记得我当时站在房间的什么位置。我记得那一刻的一切,我不得不回家想\"这他妈是怎么回事?发生了什么?\"我在问自己\"那里发生了什么?\"那是我重新理解什么是正确、什么是开放思维和好奇心、如何参与这种竞争的旅程中的许多步骤之一。\n\n(01:25:47):\n我当时22岁。我现在不为此找借口,但我记得还有几个类似的例子,那些不太技术性而更个人化的事情我不会分享,但我清楚地记得每一个,这些对我来说才是真正的失败。\n\nLenny (01:26:01):\n我喜欢这个故事发生在这么久以前,但它仍然困扰着你,我认为影响很大。\n\nAndrew 'Boz' Bosworth (01:26:06):\n天啊,我永远不会忘记那件事。太尴尬了。对于那些人来说,有句老话,真的是最真实的话之一,我知道这是陈词滥调,有时候陈词滥调之所以是陈词滥调是因为它们很好。就像\"人们不会记得你说了什么。他们只会记得你让他们感觉如何。\"人们记得的只是你让他们感觉如何,我认为在那个房间里,我可能让人们感到不安全。那很糟糕。\n\nLenny (01:26:27):\n我喜欢这个\"身份威胁\"的概念。可以把这期播客叫做\"身份威胁\"。\n\nAndrew 'Boz' Bosworth (01:26:32):\n就这么定了。\n\nLenny (01:26:33):\nBoz,我们开始这期节目时有十亿个问题。我现在有十亿零一个问题。我希望我们能继续,但我知道我们必须结束了。在我们进入非常激动人心的快问快答环节之前,你有什么想分享或留给听众的吗?\n\nAndrew 'Boz' Bosworth (01:26:46):\n嗯,万一我们最终真的把这一集标记为\"身份威胁\",让我告诉你什么真正是……我通过辅导取得了很多突破,学习了解当我感受到身份威胁时自己身体内部的感觉,学习减少我感受到它的可能性的技巧和策略,以及当它发生时如何处理,以及当我犯错时如何修复,我经历了所有这些。我想说我学到的最大教训是多年后的事,只是通过观察某个人。Ami Vora是一位传奇人物,很早就加入了公司,在我们的开发平台上工作,然后和我在广告部门工作了很长时间,然后是WhatsApp的PM负责人很长时间。她后来离开公司做了更多伟大的事情。和她一起工作就像看外星人一样,因为她和我的方法如此不同,她对待……\n\n(01:27:38):\n她可以与某人在世界上有最深刻的分歧,他们会说她认为不仅是错误的,而且是疯狂错误的事情,她会回应。她会说:\"有意思。你必须告诉我更多关于你为什么这么想。\"我无法完全表达,她是发自内心地这么想的。她看到了她和那个人之间的这种分歧,可能是个人的,可能是专业的,可能是任何事情。她看到了他们看待世界的方式与她看待世界的方式之间的分歧,她没有反应得好像有人看法不同就是一种威胁,也没有反应得好像害怕也许她错了并且之前做错了事情,她以最真诚和深刻的好奇心做出反应。我看到它绝对打破了观点之间的墙。人们立即感受到她真诚发自内心的好奇心,会靠过来,这会让他们变得开放。\n\n(01:28:36):\n如果她是对的,顺便说一句她通常是对的,那么他们离开时会说:\"哦,好吧,我在那方面错了,\"但她也会改变主意,这就是关键。从那以后,我真的试图以此为榜样。当我内心有强烈的紧缩感时,我试图拥抱好奇心,比如\"哇,我们看这件事的方式不一样。这很有意思。告诉我你为什么这样看。\"这可以是个人反馈。有人说:\"嘿老板,我觉得你话不够多。\"\"哇,你觉得我话不够多?这出乎意料。我很想听到更多,因为从来没有人对我说过这个,\"所以我想把这个送给任何可能在自己身上认出这种行为的人。有很多事情你可以做,也应该做那些工作。\n\n(01:29:22):\n提升自己的工作总是富有成效和令人满意的,它会得到回报,正如我们讨论的,在你生活的各个方面,与你的家人、朋友以及专业上。这一点我真的认为非常棒,就是好奇心。在那些挑战时刻拥抱好奇心真的完全改变了我的生活,我把这归功于Ami Vora。\n\nLenny (01:29:40):\n哇,我喜欢这个例子。这基本上是\"是的,而且?\"的一个例子,但用一种真正……没人会说\"是的,而且?\"这是一种非常好的表达方式,\"真有意思。告诉我更多。\"\n\nAndrew 'Boz' Bosworth (01:29:50):\n有意思。你得告诉我为什么,我想理解它。\n\nLenny (01:29:54):\n我喜欢。也许新标题就叫\"有意思\"。\n\nAndrew 'Boz' Bosworth (01:29:56):\n就这么定了。\n\nLenny (01:29:58):\n不管怎样,说到这里,Boz,我们到了非常激动人心的快问快答环节。你准备好了吗?\n\nAndrew 'Boz' Bosworth (01:30:03):\n准备好了。\n\nLenny (01:30:04):\n第一个问题,你向其他人推荐最多的两三本书是什么?\n\nAndrew 'Boz' Bosworth (01:30:09):\n《梦想机器》(The Dream Machine)，这是一部关于现代计算机前史的杰出著作，表面上是追随 J.C.R Licklider 的一生，但实际上它涵盖的范围要广泛得多。在我看来，这是一段被严重忽视的历史。我认为在我的学科领域，在计算机科学中，我们没有得到恰当的教育。我们学习了艾伦·图灵，也学习了一些计算机科学理论的技术基础，但现代计算机及其发展路径是深刻而迷人的，它在今天具有特别的共鸣，因为 J.C.R Licklider 的观察是\"人在环路中的计算\"(human in the loop computing)，我认为我们现在处于\"人在环路中的 AI\"(human in the loop AI) 时代，我认为这之间有着巨大的共鸣。第二本是《内在的美好》(Good Inside)，这是 Becky 博士的书，我认为这是一本了不起的育儿书，但不仅如此，它还包含了关于如何思考我们自己的情绪以及如何管理这些情绪的经验教训，我发现这在任何情境下都很有用。\n\nLenny (01:31:00):\n很棒的推荐。她还有一个在线社区，供人们——\n\nAndrew 'Boz' Bosworth (01:31:03):\n她有一个很棒的在线社区，她在里面非常活跃。对于那些为人父母的朋友们，Lenny 你现在还有点早，但你会经历的。在 Instagram 上阅读一些小脚本，当我与孩子们处于极大的情绪挑战时刻时，我能随手拈来这些话语。它们就在我脑海中最容易想起的位置。它们已经被缓存了，对吧?它们已经准备好了，这是一个巨大的改变。\n\nLenny (01:31:24):\n这将用于我们未来的育儿主题节目。\n\nAndrew 'Boz' Bosworth (01:31:27):\n没错。\n\nLenny (01:31:28):\n最近有没有特别喜欢的电影或电视节目?\n\nAndrew 'Boz' Bosworth (01:31:32):\n有的。这个答案很常规，但是《曼达洛人》(Mandalorian)。有趣的是，又回到我的孩子们身上，我们和孩子们一起看这部剧，所以我们有机会去了银河星际巡洋舰 (Galactic Star Cruiser)。你们都知道我是一个彻头彻尾的真正的书呆子。我是 Scott Trowbridge 的超级粉丝，他在迪士尼的星球大战主题乐园所做的工作，还有其他的。所以在那之前，我们让当时九岁和六岁的孩子们一起看了所有的电影，然后我们作为一家人一起看《曼达洛人》，这非常有趣，有那种知识背景的联系很有趣。所以这不仅仅是经典的儿童电影，还有更多内容，我认为对他们来说，他们觉得这是一种他们可以参与的成人对话。我真的很享受这个过程。我也很喜欢 Dave Filoni 和 Jon Favreau 以及团队构建的那个宇宙。\n\nLenny (01:32:19):\n这就是道路 (This is the way)。\n\nAndrew 'Boz' Bosworth (01:32:19):\n这就是道路。\n\nLenny (01:32:20):\n在面试候选人时，你有最喜欢问的问题吗?\n\nAndrew 'Boz' Bosworth (01:32:25):\n我总是会问的最重要的事情之一是，与他们共事过的人会说他们最大的优势和劣势是什么。我喜欢这个问题有几个原因，其中很重要的一点是我经常会跟进推荐人，我喜欢从三角验证的角度了解他们对其他人如何评价自己的认知。还有他们如何回应批评。有时候候选人会让我惊讶。他们会说:\"嘿，你会经常听到这个批评，但我不认为这是公平的。\"这可能是一个可以接受的答案，但他们必须在那里表现得相当稳健。或者是:\"嘿，这是我正在努力改进的地方，这是我的做法。\"但我也喜欢听到他们认为自己的超能力是什么。面试中往往有太多注意力集中在弱点上，我确实关心这个，因为我想知道缺点是什么。但对我来说更重要的是:\"你擅长什么?如果我能搭上便车，那就是我想知道的。你正在碾压的超能力在哪里?\"\n\n(01:33:22):\n有趣的是，人们很少在我的推荐人核查中给出准确的答案。关于批评的部分通常不太准确，但他们对自己优势的认知通常是相当准确的。\n\nLenny (01:33:31):\n有意思。我也是优势论的坚定支持者，不要过分担心你的弱点。\n\nAndrew 'Boz' Bosworth (01:33:36):\n但让人们通过团队来评价自己的表现，这非常重要。我们靠自己无法取得太多成就。\n\nLenny (01:33:44):\n沟通就是工作。太棒了。最近有没有发现什么你喜欢的产品?Meta 的产品也是可以接受的答案。\n\nAndrew 'Boz' Bosworth (01:33:55):\nRay-Ban Meta 眼镜会是一个诱人的答案。多模态功能，我可能会因此惹上麻烦，因为我已经在社交媒体上预告这个功能好几个月了，但它仍然处于封闭测试阶段，就像:\"我们正在慢慢扩大测试范围\"，但问题是:\"人们已经非常想要它了。\"这可能是我最近体验到的最神奇的东西之一。这不太公平，因为你现在就可以购买 Ray-Ban Meta 眼镜，而且很快——我不会说具体时间——但很快它们就会有这个功能，但跳出固有思维会更有趣。好吧，这个答案我可能会惹麻烦，因为有点装腔作势。首先声明，我不是汽车迷。我不喜欢汽车。我不关心汽车。我只想要一辆能用、不坏的车。我成长过程中的所有汽车都是超过十万英里的二手车。\n\n(01:34:38):\n它们总是出故障，动力转向会在你开车时失灵，你不得不[听不清 01:34:43]转动方向盘，刹车会失灵，或者发动机会出问题。我什么都经历过。我只想要一辆车。所以后来我买了一辆本田雅阁开了10年，然后开了一辆特斯拉 Model S 10年。特斯拉 Model S 在停放时出了点问题，我就不细说了。我买了一辆新车，我又想:\"我想买一辆电动车。\"然后我想:\"我要买点好的。我要买点好的。我想买点好的。\"我现在开的是梅赛德斯-奔驰 AMG EQS，我不知道车可以这么好。我从小开二手车什么的，我不知道这是可能的。我认为这是你今天在市场上能买到的最好的增强现实产品。\n\n(01:35:29):\n通过抬头显示器 (heads-up display)，它将你的转向信息以三维方式呈现在空间中。它有面向你眼睛的摄像头，所以显示器上的转向信息相对于你的眼睛位置是正确的。当你接近时，就像你要撞上一堵小墙，你必须在撞墙之前转向。我当时想:\"天哪，我觉得这辆车有出色的增强现实功能。\"我不是汽车迷,我也不是想炫耀这辆车什么的。我很喜欢它。我不知道车可以这么好,但我认为最令人印象深刻的是他们在这辆车上的增强现实做得非常出色。\n\nLenny (01:35:58):\n哇。梅赛德斯-奔驰，增强现实、混合现实领域的玩家。\n\nAndrew 'Boz' Bosworth (01:36:01):\n绝对的。他们在那里，处于领先地位。\n\nLenny (01:36:04):\n我有时会想举办一个竞赛，赠送人们在这个环节提到的产品，现在你把我的预算彻底打爆了。\n\nAndrew 'Boz' Bosworth (01:36:12):\nRay-Ban Meta，你能负担得起。\n\nLenny (01:36:15):\n太棒了，我得去看看。我想我们会为梅赛德斯增加一些销量。下一个问题。你有没有一句最喜欢的人生格言，经常回想、与朋友家人分享、觉得很有用的?\n\nAndrew 'Boz' Bosworth (01:36:27):\n有的。实际上我们有一个有趣的故事，关于我们是如何得到这个格言的。我的家庭，我的直系家庭——我、我的妻子和孩子们的座右铭是\"相信自己\"(Trust yourself)。就是相信自己。实际上,我们有这个座右铭的原因是我们家里有几件不错的艺术品，其中一件是 Tracy Emin 的作品，她是英国著名艺术家，她做霓虹灯作品，上面写着\"相信自己\"。所以它在我们卧室的走廊里，我和所有孩子、我的妻子都在那里，上面写着\"相信自己\"，每天早上霓虹灯亮起，就是\"相信自己\"。然后我有机会在英国制作了一个家族徽章，我的家族很久以前来自英国。所以在徽章上写着\"相信自己\"。我总是和我的孩子们讲，尤其是。我真的认为，当你面临同伴压力时，比如:\"你相信谁?相信他们还是相信你自己?当你有很多自我怀疑和不确定性时，你必须相信自己。\"\n\n(01:37:17):\n我认为我取得的很多成功，这对大多数去创业公司并成功的人来说可能都是如此，就是:\"我只是相信我在做出好的决定。\"我的意思是，这回到我之前关于如何做像新闻推送 (newsfeed) 这样的事情或有争议的事情，或者如何做出重大昂贵的改变时提到的信念点，就是信念。你必须相信你自己，你的眼睛、耳朵和智慧结合起来给了你一个有内在价值的观点，值得你尊重，而不是读那篇关于你公司的报纸文章，并相信它超过你自己的眼睛和耳朵告诉你的。这就是我们遵循的座右铭。\n\nLenny (01:37:57):\n我认为同样重要的是要说，你不会总是对的，这没关系。\n\nAndrew 'Boz' Bosworth (01:37:59):\n完全正确。相信自己也包括承担风险，因为你相信当风险没有回报时你能处理和应对。\n\nLenny (01:38:07):\n很好。最后一个问题。我知道你是一位业余摄影师，也许是半职业摄影师，拍了很多旅行照片。\n\nAndrew 'Boz' Bosworth (01:38:13):\n业余的。业余的，业余的。\n\nLenny (01:38:15):\n业余的。好的。你还有一个我偶然发现的网站，我不知道人们是否知道它，它有一个有趣的名字。我不会提及它，我不知道你是否想让人们……\n\nAndrew 'Boz' Bosworth (01:38:22):\nWarden Shortbow，这是我名字的变位词 (anagram)。Warden Shortbow 是 Andrew Bosworth 的变位词，wardenshortbow.com。我热爱摄影。我热爱它。这是我真正的热情所在。\n\nLenny (01:38:30):\n所以问题是，你拍过的最喜欢的照片是什么?\n\nAndrew 'Boz' Bosworth (01:38:33):\n顺便说一下，艺术实际上是谈论相信自己的好地方。我知道这听起来很俗套，但我认为 Rick Rubin 最近关于什么是艺术以及人们如何创作艺术的采访非常到位。你必须为自己创作，你必须热爱它。如果有其他人也喜欢它，它找到了更广泛的共鸣，那很棒，但这不是你创作的原因。如果你开始试图为更广泛的共鸣而创作，那么你就是在追逐别的东西。那是媒体，是娱乐，但不是艺术。是其他东西。我说这些基本上是在打太极，然后说，我其实很喜欢我的很多照片，很难选出最喜欢的。浮现在我脑海中的一张，它有更多的情感[听不清 01:39:12]，是我给儿子拍的一张在街上玩耍的照片，就是他穿着雨靴、雨衣之类的在水坑里跳跃。它不够锐利，不在焦点上。它是一个小品，是一个意象。\n\n(01:39:27):\n我真的认为安塞尔·亚当斯（Ansel Adams）曾经大量谈论过，摄影师的目标是创作出一张作品，向观众表达身临其境的感受。人们忘记了，他是暗房大师，甚至可能比拍摄本身更擅长暗房技术，照片的冲印才是他做出惊人工作的地方。我有幸去过他在大苏尔（Big Sur）的暗房，和他的儿子一起在那个房间里观看他们进行冲洗。他有精心设计的流程，如何对照片的不同部分进行提亮、遮挡和加深处理，以获得他想要的共鸣效果。他为摄影被接受为一种艺术媒介而奋斗，而在当时摄影并不被认可。我发现这与今天关于AI艺术的对话如此相似，我们又一次试图设定门槛来界定什么是艺术，但不幸的是，你无法这样做。\n\n(01:40:20):\n所以这张我儿子的照片，没有人会称它为技术奇迹，但作为一个小片段，它为我个人，我认为也为所有父母，捕捉到了与孩子共度的那些极其动人、迷人的人性时刻的短暂性，这就是我想到的那张照片。\n\nLenny (01:40:39):\n太棒了。我们会尽力找到它并给大家提供链接。关于瑞克·鲁宾（Rick Rubin）的观点，他说过类似的话，就是把艺术看作你的日记。我只是在描述我觉得有趣和重要的东西，没有人可以来告诉我我的日记是错的。这是我的日记，这是我看待世界的方式，这没有问题。最好的艺术就是来自于这种勇气......实际上我最近刚看过他说这个观点的一个很棒的视频。Boz，这次对话太有趣了。非常感谢你抽出时间。我期待我们未来的育儿和人际关系播客。开玩笑，也不完全是开玩笑。最后两个问题。如果人们想关注你的动态，可以在哪里找到你？听众们如何能帮助到你？\n\nAndrew 'Boz' Bosworth (01:41:19):\n当然。我在Instagram、Threads和X上的账号都是@boztank，Facebook上是facebook.com/boz。我也有自己的播客，是技术深度探讨类的，所以我觉得风格很不一样。它是技术深度探讨，每次尝试深入讨论一到两个主题。播客叫做《Boz to the Future》（Boz的未来）。你可以在Spotify或iTunes上找到。\n\nLenny (01:41:41):\n《Boz to the Future》，买一些Quest的产品。\n\nAndrew 'Boz' Bosworth (01:41:44):\n买一个Quest 3吧。说实话，伙计，犒劳一下自己。\n\nLenny (01:41:48):\n没错。或者这些Ray-Ban太阳眼镜。我是它的忠实粉丝。Boz，再次非常感谢你的到来。\n\nAndrew 'Boz' Bosworth (01:41:52):\n干杯。谢谢，兄弟。\n\nLenny (01:41:53):\n大家再见。非常感谢收听。如果你觉得这期节目有价值，可以在Apple Podcasts、Spotify或你喜欢的播客应用上订阅本节目。另外，也请考虑给我们评分或留下评论，因为这真的能帮助其他听众找到这个播客。你可以在lennyspodcast.com找到所有往期节目或了解更多关于本节目的信息。下期节目见。",
  "chunks_count": 11
}