{
  "guest": "Failure",
  "en": "Lenny (00:00:02):\nToday we've got another very special compilation episode. Something I've been pulling on more and more with the podcast and the newsletter, in case you've noticed, is failure. Normally I spend a lot of time researching how the best companies and the best product leaders operate, but you can learn a lot and often a lot more from failure. And so what we've done with this episode is we've looked at all of the past episodes we've done and pulled out all the most interesting and insightful stories of failure and turned it into this very focused episode on failure. I hope that you find this useful and interesting. Let us know what you think in the comments on YouTube or on lennysnewsletter.com, or just let me know on Twitter. If you like this, we'll keep doing this. If not, we'll, probably not. Either way, I hope you enjoy. Before we dive in, here is a short word from our wonderful sponsors.\n\n(00:00:52):\nLet me tell you about a product called Sendbird. The all-in-one communications API platform designed for both web and mobile apps. In a world saturated with multi-channel communication, product teams are discovering the effectiveness of in-app communication with Sendbird, businesses can elevate their in-app experience with decluttered and branded communication featuring AI-powered chatbots, one-way messages, chat, video calls and livestream capabilities, all tailored for commerce, marketing and top-tier support. Forward-thinking companies such as Hinge, Patreon, Yahoo, Accolade, and more use Sendbird to build in-app communication experiences that drive engagement, conversion, and retention. In-app communication has the highest conversion, highest engagement, and highest satisfaction of any communication channel. And when it comes to investing in this channel, trust Sendbird to take your in-app communication experience to the next level. Start today with Sendbird's free plan and as a listener of Lenny's Podcast, you'll get an additional two months of unlimited usage and access to all premium features, including creating your very own generative AI chatbot. Visit sendbird.com/Lenny to begin your free journey. That's sendbird.com/Lenny.\n\n(00:02:08):\nThis episode is brought to you by Eppo. Eppo is a next-generation, A/B testing and feature management platform built by alums of Airbnb and Snowflake for modern growth teams. Companies like Twitch, Miro, ClickUp and DraftKings rely on Eppo to power their experiments. Experimentation is increasingly essential for driving growth and for understanding the performance of new features. And Eppo helps you increase experimentation velocity while unlocking rigorous deep analysis in a way that no other commercial tool does.\n\n(00:02:38):\nWhen I was at Airbnb, one of the things that I loved most was our experimentation platform where I could set up experiments, easily, troubleshoot issues, and analyze performance all on my own. Eppo does all that and more with advanced statistical methods that can help you shave weeks off experiment time, an accessible UI for diving deeper into performance, and out-of-the-box reporting that helps you avoid annoying prolonged analytic cycles. Eppo also makes it easy for you to share experiment insights with your team, sparking new ideas for the A/B testing flywheel. Eppo powers experimentation across every use case, including product, growth, machine learning, monetization, and email marketing. Check out Eppo at geteppo.com/lenny and 10 X your experiment velocity. That's geteppo.com/lenny.\n\n(00:03:26):\nAll right. First up, we've got Katie Dill, who is head of design at Stripe and former head of design at Airbnb and Lyft sharing this amazing story of how the entire design team at Airbnb basically rebelled against her soon after she joined and what she learned from that experience.\n\nKatie Dill (00:03:42):\nI'm happy to talk about it because frankly, it was the biggest learning experience of my leadership career, or at least that happened in one moment, and it happened in my early days at Airbnb. So I was hired to take on the experience design organization, that's basically the product design team, which was 10 people at the time.\n\n(00:04:02):\nAnd so they had been reporting directly to one of the founders and they were going to start reporting to me. And during my interview process, I learned a lot about what was working and what wasn't working and some of the trials and tribulations with the design organization and its collaboration with others. So it seemed like there was room for improvement in how engineering and product management and design all work together. And there was also really low engagement scores in the design team.\n\n(00:04:29):\nAnd so I came in ready to go and excited to try to help make some change based on all the things that I had learned from various leaders and people across the company. And I came in swinging ready to go, and then about a month into my time there, I got a meeting on my calendar. Thursday 8:30 AM, was an hour and a half with half of the design team, so that was five people, and our HR partner.\n\nLenny (00:05:00):\nOh, no. That's never a good sign.\n\nKatie Dill (00:05:01):\nUsually it's [inaudible 00:05:01]. Yeah. And I remember this so vividly. I remember walking into the office and all the rooms in Airbnb's office are very unique spaces that look like Airbnbs, but of course this was the one room with all white walls and just a gray flat rectangle table. And I walked into the room and there were five of them seated around the table and they had a pack of papers in front of them, and they went on taking turns quietly reading from the papers all the things that they saw that I was doing wrong and all the things that they didn't like about me. And it was a really hard moment there. I went through all the usual stages of grief when one hears feedback, which is just immediate want to respond to be like, \"Oh, well there was a good reason for that.\" And, \"That's not how it actually was,\" and, \"This is why I did that.\"\n\n(00:05:59):\nBut luckily I had, thank goodness, I had the sense to just listen and not respond in that way. Clearly, what they were telling me is that that was one of the things that was missing. And so I heard them out and took it all in. And regardless of each individual thing, what was very clear was that the missing piece, the theme that was across all of that is that I hadn't earned their trust. So whether how right or how wrong what I was doing was is the key piece is that I wasn't bringing the team along with me. They had no idea that they could trust in what I was trying to build and what I was trying to shape and that I cared about them and that I had their best interest and shared goals at heart. And that was absolutely my fault.\n\n(00:06:45):\nAnd in retrospect, as hard as that was, I'm very grateful and very amazed that they could come together and share that with me. It can be hard to bring feedback forward like that.\n\n(00:06:57):\nAnd so it was an extremely valuable learning experience and I took from that to then immediately shift how I was operating. And really a key part in building trust was to listen, to hear out what the individuals on the team were setting out to do, what they cared about, what motivated them. And so I started to make pretty fast change and still moving in the direction that was necessary for the org to make the really large impact in how we were operating, but bringing folks along with me. You can inflict change on people, but if you want to do it with them, really trust is the key element there.\n\n(00:07:37):\nAnd then a couple of months later, we had the best engagement scores in the company. So it actually, it did objectively improve the situation and since then taken that on into next steps in other companies that I've joined and just think about instead of coming in swinging, come in listening, so that you can really set out to make change that actually has true positive impact on the folks around you and you bring along with you.\n\nLenny (00:08:04):\nNext up, Paul Adams, chief product Officer at Intercom, sharing the nightmare experience of freezing on stage in front of thousands of people, having to walk off stage, and then people hearing him curse because the mic was still on, and then how he recovered. Plus a few stories of building some of Google's most infamous product failures.\n\nPaul Adams (00:08:24):\nSome things have happened in work, are very memorable at the time and they don't really scar you. This goes in the book that have scarred for life. Yeah, let's go long story short, I was at Facebook just over a decade ago, loved it at the time. I think it was a great place to be at the time. And basically San Francisco, I did a lot of talks for Facebook internally and externally. Facebook had a keynote slot, always have a keynote slot at Cannes, the world's biggest advertising festival. And the year prior, Zuck had been interviewed. He was the speaker, he'd been interviewed, gotten a hard time on privacy. It didn't go well, as well as they'd hoped.\n\n(00:09:00):\nSo the next year they asked me to do it, maybe it was the Irish accent that made the offer come my way. And yeah, I got out into front the stage of the world's biggest advertising stage, and I'd say I was like three or four minutes into the talk, a talk I'd given, a very similar talk that I'd given lots of times.\n\n(00:09:19):\nAnd I just froze. I couldn't remember what I was supposed to say. It was the first ever time in my life I'd rehearsed a talk word for word. Usually, I have talking points and I'd ad lib and things get mixed around and it's kind of informal. This was media trained, do not say the wrong thing kind of talk. And I just could not remember what to say. I had some version of a panic attack, walked off stage, I was still mic'd up, cursed. I was laughing. I was like, \"Geez, are they laughing at me. Oh my God, this is...\" But I can manage to turn it around, I walked back out, I'd kind of been disarmed internally in my head, and the rest of it went well. And I was famous that night out in Cannes afterwards on whatever the seafront, it's just like rosé everywhere. I was famous and infamous for my performance.\n\nLenny (00:10:13):\nI feel like you lived the worst nightmare that everybody has when they're thinking about giving a talk. And I think what's interesting is you survived, and I think that's a really interesting lesson is you could freeze in front of thousands of people, walk off stage, and then it works out okay.\n\nPaul Adams (00:10:30):\nAnd it all happened organically, I guess, or very naturally. But yeah, ever since then, every time I walk out onto a conference talk stage, still today, I ask myself, I have this tiny doubt in the back of my head. It's never happened since. But yeah, I think you have to go with it with these things. When life kind of throws you these whatever curve balls you have got to kind of adapt, and it's not that big a deal. None of these things are that big a deal. At the end of the day you kind of move on, live and learn. Yeah, but I still hope it doesn't happen again.\n\nLenny (00:11:02):\nI also hate public speaking and I always fear this is exactly what's going to happen to me. And so I think this is nice to hear that even when the worst possible thing basically happens, things can survive.\n\nPaul Adams (00:11:13):\nYou can turn it around. Yeah.\n\nLenny (00:11:15):\nA second area I wanted to hear from is your time at Google and there's a couple products you worked on at Google. Both of them were not what you'd call big successes, and then there's kind of a transition to Facebook, which was also kind messy. Can you just share a couple stories from that time?\n\nPaul Adams (00:11:31):\nYeah. Similar to the walking off stage thing, you live and learn, and I was at Google for four years. I was at Facebook for two and a half years or so. At Google I worked on a lot of failed social projects like you mentioned, Google Buzz, Google, and later Google+. I think a lot of the motivation for those projects came from a place of fear. It didn't come from a place of let's make a great product for people,.let's really understand the things people struggle with when communicating with family and friends. That's really, really try and create something wonderful. It came from a place of fear.\n\n(00:12:10):\nAnd so during those times I learned I think how not to lead in places. And by the way, I should say at the time in Google, there was other things happening that were amazing, like Google building Google Maps. Incredible product, one of my favorite products. I think one of the best products ever made. They were building Android. I was in the mobile team, in the mobile apps team at the time that Android came out. So incredibly good product. So I just happened to be in the social side, which wasn't as good.\n\n(00:12:37):\nAnd yeah, Google Buzz was kind of a privacy disaster, and Google+ similar. And so kind of halfway through I kind of published research about groups, and I've done a ton of research. An interesting kind of side note there is at the time I asked, I was working in the research, in the US team as a researcher, I was being asked to do a lot of tactical research, like usability study type stuff, like can people use these products? And I ended up doing a lot of formative research as well in the same session. So I'd kind of say to the team like, \"Hey, I'll do the research, I'll answer your questions, but also I'm going to do this other thing, and I'm going to take 20 minutes doing that.\"\n\n(00:13:16):\nAnd so what we used to do is, what I used to do with people was map out their social network, all the people in it, their family, their friends, how they communicate. We'd map on all the channels, we'd talk about what worked well, what didn't. And we did this with dozens and dozens of people over the course of maybe 18 months. And the same pattern emerged every single time, which was people need way better ways to communicate with small groups of family and friends. And I kind of look back now and go like WhatsApp, or it maybe iMessage if everyone's on Apple, but really obvious in hindsight, but at the time, not obvious. And so we kind of tried to build a product around that called Google+, but again, it was kind of came from the wrong place. And so halfway through the research that I've done, all this research had been made public through a conference talk and Zuck and Facebook noticed, got in touch, one thing led to another and I left and joined Facebook, which was an amazing thing for me, personally.\n\n(00:14:13):\nFacebook was amazing, an amazing place at the time and exciting. And they were trying to do things for the other reasons, the kind of good reasons, like, \"Hey, let's build an amazing product for people.\"\n\nLenny (00:14:22):\nAnd this was during Google+ being built? You basically shifted.\n\nPaul Adams (00:14:26):\nYeah, midway, I'm stressed to even telling you about it. The project hadn't been launched. It was still under wraps. It was highly confidential. Google had done a lot of things at the time that were the first for them. I don't know if they've done them since, but things like everyone worked in Google+ was sent to a different building. That building had a different key card. If you didn't work on Google+, you could not get in. All sorts of counter-cultural things at the time. And as a result, there was a lot of antagonism internally for Google+. And so when I left in the middle of the project, leaving with all of the plans in my head to the enemy, some people saw me as a traitor, understandably. Other people thought I was enlightened. It depends on who you talked to, but it was the right thing for me to do. But at the time it was a hard thing to do.\n\nLenny (00:15:17):\nI know there's also a lot of scrutiny in what you took with you and the process.\n\nPaul Adams (00:15:23):\nWhen I left, Google kind of assumed that I was one of the spies. I was quarantined when I told them I was leaving. They forensically analyzed my laptop, all sorts of stuff like that. So it was pretty intense. Looking back, I can understand why that happened, but the root cause for me is that the project has been run from a place of fear, competitive fear, which I don't think leads to good things.\n\nLenny (00:15:53):\nSo one of the themes through the stories you just shared is, let's say failure is... I don't want to make it that harsh, but just things not working out. And I'm curious as a product leader, how important you think that is for people to go through if you think that's something that is almost a good thing. And I guess just is there anything there that you find helpful as a coach, as a mentor, as someone, to people that are trying to become basically you?\n\nPaul Adams (00:16:19):\nIt very, very... It still is. It still is. I've personally failed so many times. There are two stories and the Google one is long deep tentacles. There are two stories. I've failed a ton of times like at Intercom. I remember when I was at Facebook, I was very happy and I knew I wanted to [inaudible 00:16:39] the co-founders of Intercom and they're trying to persuade me to join Intercom. It was like 10 person company at the time. But Owen said something to me at that time, which has stuck with me ever since. He said, \"At Facebook you can design the product, but at Intercom you can design the company.\" And that was extremely appealing to me, a great pitch. He's like, \"Just design the company with us that you want to work in.\"\n\n(00:17:03):\nAnd so part of that was a company that embraces failure that says it's okay to try things. I'm a big believer in big bets, higher risk, higher reward. I don't get as excited about incremental things. Now I haven't said that, there's of course a place for that too, especially as companies get bigger. But I get excited about big bets and if you make big bets, you're going to get a lot of it wrong. So a lot of the principles that we built here at Intercom, on building software, we have a principle called ship to learn, and we've actually changed it since, still on the wall here. Ship fast, ship early, ship often is what it says now. Used to say ship to learn. Ship fast, ship early, ship often. It's like in that idea is the idea of failure. It's not going to go right, and it's going to go wrong more often than not. But if you ship early and fast and learn fast, you can change fast, and you can improve fast. And that's the kind of culture that we as much as possible try to embrace and teach people. But it's much easier said than done.\n\nLenny (00:18:05):\nEspecially when you're in the moment. Like Go damn, it, everything's going to fall apart. I really messed this one up.\n\nPaul Adams (00:18:09):\nYeah. And there's a trade-off with quality that people really struggle with. We've high standards of ourselves. A lot of Intercom comes from a design founder background. We value the craft a lot. We never want to be embarrassed by what we ship. So there's a real tension there, a real trade-off where people have these high standards, which we encourage and we encourage them to ship fast and learn and make mistakes. It's a constant kind of tension that we're navigating.\n\nLenny (00:18:38):\nNext up, we have Tom Conrad, who is chief product officer at Quibi and engineering leader at Pets.com. Two of the most memorable failures in product history, sharing his lessons from those wild experiences. Tom is currently CEO of Zero Longevity Science, which is a killer business and an app in case you haven't come across it. I'd definitely check it out. Here's Tom.\n\n(00:19:00):\nYou brought up this phrase of notable disasters and I want to talk about that. You've worked at two of the most famous notable disasters of product companies, Pets.com and Quibi. I think it's really rare someone sees the inside of so much hype and then such a fall at a company. And so I just want to spend some time in these two areas, and maybe the way to set it up is just what's a lesson you took away from each of these two experiences that you've taken with you to future work, and maybe advice you share with people?\n\nTom Conrad (00:19:30):\nProbably the biggest lesson, it's not really about the specifics of the business. The biggest lesson really is these things make you better. In some instances, actually I think in both instances, they became kind of dominoes that opened doors for me in my own ambition and my own sort of professional life that maybe just wouldn't have opened at all if I hadn't gone to those companies and learned those things and had those experiences. And frankly, even in the case of Pets.com, like even the high profile nature of it, I could have worked at one of a thousand e-commerce websites in 1999. And when I went on to some subsequent job interview or something and talked about my experience, I had never heard of the thing that you worked on, but everybody certainly heard about Pets.com.\n\n(00:20:17):\nIt's a pretty funny example too of how some struggles are timeless. That was 23, 24 years ago now. And while as a leadership team, we made, I'm sure, all kinds of mistakes. One of the things that happened was that there were three kind of over-funded pet e-commerce sites, and we all raised in excess of $50 million, which is a tremendous amount of money now. It was a tremendous amount of money then, and we all thought it was a zero-sum game and that we as one player started to spend on promotion or to spend irrationally on national broadcast television advertising. We all did, and it became this kind of unwinnable arms race. So there is, I think a fundamental lesson about having an excess of investment can be its own albatross or lead you to make decisions that maybe would be unwise.\n\n(00:21:28):\nAnd then of course, it's just like timing is really important. Chewy is a online pet store. It's worth $9 billion today. They were a private company and bought by PetSmart and then spun back out. But when they were bought by PetSmart, they were acquired for 3 billion, biggest e-commerce acquisition of all time. And while I think it's probably unfair to compare, Chewy who executed exceptionally well over a decade, grew their business brick by brick, and turned it into something really remarkable. To Pets.com, which was in a very, very different moment in time and tried to go to market in a really different way.\n\n(00:22:07):\nThe critique that is often leveled at Pets.com or at least at the time, was like, this is just a stupid business. They're shipping dog food around. You could never make that work, and that's just wrong. You absolutely can make it work. Probably can't make it work when 80% of the country on the internet is still on dial up. It's really, really early.\n\nLenny (00:22:25):\nI saw a stat I think you shared somewhere that you took Pets.com from nothing, to a public company, to completely out of business in 19 months.\n\nTom Conrad (00:22:33):\nYeah, yeah, I think that's about right. The other thing that's forgotten in the tale is that we actually didn't go bankrupt. We shut the company down and returned the remaining balance to the investors, which no public company had ever done before. And the leadership team just reached the conclusion that given the way market conditions had evolved, there was just no way we were going to be able to get more capital into the company. And it was a company that required additional investment to get to profitability. And so it was better to wind down early, take the money that we had in the bank and get it back to investors than to just spend every last penny on what was sort of a fruitless attempt to salvage it.\n\nLenny (00:23:22):\nDid not know that. Let's talk about Quibi. What went wrong there? Do you think there was a path to Quibi having worked out? Any big lessons that you took away from that experience that you bring with you?\n\nTom Conrad (00:23:33):\nThe kind of miraculous thing about Quibi for me was it relit my enthusiasm for the industry for doing this work. I had left in, I think it was December of 2018, and I thought that maybe I was just done making software. I had done it for a really long time, I had done it for twenty-five years or something. And I had changed a lot. The industry had changed a lot, and I thought maybe I just didn't have the same passion for it that I had a decade before. And it also seemed like maybe it'd be fun to have another chapter of my life that was just completely different. And I had a whole list of things that I thought I might want to do. They were really, they were kind of ridiculous. Maybe I want to be a pastry chef. Maybe I want to be a landscape photographer. Maybe I want to learn to make bad music to put up on SoundCloud or something. Really the only thing they had in common were they were all things that I knew nothing about. People would be like, \"Oh, you think you might want to be a pastry chef? Do you like to bake?\" And I'd be like, \"No, I don't know anything about baking.\" \"Oh, you might landscape photography. Do you take photos?\" \"No, I don't make photos.\"\n\n(00:24:41):\nBut I was kind of committed to the bit, actually to the point where when TechCrunch interviewed me about my departure from Snapchat, I was like, \"I'm out. I'm going to do something else entirely.\" So that story is very much out there. But a few months after my last day at Snap, I got a call from Meg Whitman and Jeffrey Katzenberg who were starting up, it was called New TV at the time.\n\n(00:25:07):\nAnd the pitch was, \"We're going to try to take the best of mobile and Silicon Valley and Consumer Tech and sort of weld it to the best of Hollywood-style content production to build something completely bespoke and purpose-made for consumption on the phone.\" They were looking for both technology leadership and product leadership and wanted to know if I was interested in one or both. And I took the meeting, even though I wasn't really taking these kinds of calls from anybody. It just seemed like who's going to pass up the opportunity to have lunch with the two of them? So I listened to the pitch and politely declined and told them that I was going to be a pastry chef or something. And we kept doing that every couple of months for seven months. We'd go to lunch, they would give me an update on the progress they were making, and I would decline the invitation to get involved somehow.\n\n(00:26:05):\nAnd then late in that year, I went to lunch one more time and Meg explained that they brought on someone to lead technology and they brought another person to lead product, and both of them really truly for reasons that are completely disconnected from Quibi itself, both of them had left after about six weeks. And Meg's like, \"We've raised all this money, and we've told the world that we're shipping this product in about a year. We got an awful lot to do, and I really could use some help, and I would consider it a personal favor if you would come and spend just a couple of days a week helping.\" She's like, \"I'll continue to look for someone who actually wants the job, but it'd be great if you could help me get this off the ground.\"\n\n(00:26:53):\nAnd my wife is a freelance writer, marketing strategist and loves her life as a freelance contributor. And she's like, \"You should do this. Why not? It's two days a week, it's just a few months. What's the worst thing that could happen? Maybe you'll like it.\" And I'm like, \"No, no. Here's the thing that will happen. I won't do it two days a week. It will immediately be three days, then four days, then five days, then six days. I just know myself.\" And she's like, \"No.\" She's like, \"Just on Wednesday night at six o'clock, close your Quibi laptop and be like, all they're paying me for is for Tuesday and Wednesday and then open it back up on Tuesday morning. That's all you've got to do.\"\n\n(00:27:35):\nWell, she's right about most things and she's wrong about this. I fell deeply into it right away, and it was just so fun to get to build a team from scratch and to design and build a product from scratch and to take advantage of all of the sort of modern software architecture stuff that had come into being over the course of the 15 years since we had started Pandora. And I'm embarrassed about some of the what happened with Quibi for sure, but I'm super grateful for the experience, because I just really fell in love with the industry again and was reminded of just how rewarding it can be to build something and to try to put it out there even if you stumble pretty mightily along the way.\n\nLenny (00:28:28):\nIs there something that you took away from that experience that taught you what to try to avoid, to try to pull towards?\n\nTom Conrad (00:28:36):\nI think I sort of misunderstood or misjudged companies sometimes by thinking about them really focused on the product execution. If you find an interesting problem that people care about and you solve that problem in a really beautiful, elegant, delightful way, that's 10 times better than anything else that they can get in that same space, they'll tell their friends and all the rest will take care of itself. And so that was always my ambition. Find a thing that I cared about building, do a great job building it in a delightful way, go really deep on listening to people and their feedback and iterate your way to success and breaking through that membrane that we all strive to get across, the really great word of mouth.\n\n(00:29:27):\nBut I think the thing I've come to better appreciate is that companies are also, they're kind of a math problem that describes how you take investment and pour them into the equation, and out the other side comes returns on some time horizon. And yes, there are variables in that equation that are influenced by the product that you build and all of the little details and decisions that you make about making that product great. But if the equation is fundamentally broken or a big swing in and of itself, no amount of iteration and execution can get you out of the failed outputs of the broken equation.\n\n(00:30:14):\nAnd I think Quibi made a bet that you could build an entirely bespoke content library that was sufficiently scaled to get people to subscribe and retain for a couple billion dollars. It was a huge amount of money, but we made 70 shows in 18 months, which is more content than all of the major broadcast networks combined made in a single year. So it was a pretty major accomplishment. And we made a bet that we would augment those sort of episodic and serialized or Hollywood style shows with a bunch of daily content that we produce at the level of network television, nightly news, and so forth that would be an alternative to some of the sort of daily content that you might otherwise get on YouTube. And that was going to be about a third of the content spend.\n\n(00:31:19):\nOne super interesting thing that no one talks about is that all of that content was designed to be made day of or day before it aired. So there was no back catalog of it, and it was all designed to be shot in these professional studios that we built out, and it was really expensive. Like I said, it was a third of the investment we were going to make in content, almost half the investment we were going to be making content. And we launched two weeks into Covid, and we couldn't make any of that content except literally in the garages of the host's homes. And so we had this thing that was supposed to seem really set apart from YouTube that literally now was being made exactly YouTube content, which is sort of like self-produced at home with very little sort of the support infrastructure of Hollywood.\n\n(00:32:10):\nNow you can argue, I think the content on YouTube is really, really exceptional in this category, and maybe we were never going to do better than that. But I think what was really fundamentally broken with Quibi was that the actual foundational equation of can you make enough premium content that's totally bespoke and made for the service and takes advantage of the nature of the phone, is that enough content to get people to sign up and retain, and can you do that for a couple billion dollars? And I think the answer is no. The library has to be much, much bigger and you have to have, like any company, you have to have sufficient time and energy to iterate on the content format itself. Our roadmap really wanted to innovate on the content format. And so I think part of what happened is pretty quickly it became clear that the math was just wrong. It wasn't going to take 2 billion, it was going to take six or eight or 10 billion. And the risk reward profile of betting 10 billion on the format was just more than anyone can stomach.\n\nLenny (00:33:20):\nNext up, we've got Sri Batchu, former head of growth at Ramp who shares something that I've thought about ever since we had this conversation, which is this idea that when you fail, make sure you fail conclusively to make this failure an actual learning that you can build off of versus just a waste of time. Here's Sri.\n\nSri Batchu (00:33:38):\nGrowth experiments in my history are typically like 30%-ish success rate. So the vast majority of things that you try don't work. And so you want to create a culture where people aren't afraid to take risks and aren't afraid to fail. And for me, failure is not that you didn't drive revenue, failure is not learning. So it's really important that you learn when you fail. And so we celebrate failure as long as you're learning, and you can only learn if you've designed the right test and you failed conclusively, because otherwise I think many of us have been in situations where there's intuition that something might work and it doesn't work, and then you end up doing it over and over for years because every time a new executive or somebody else has the same idea, you try it again. And it's because you haven't been able to design the test to fail conclusively.\n\n(00:34:31):\nIt's hard to do. But at the end of the day, there's only two ways to make an experiment successful. Either you have a very large M or you have a very significant treatment, which is what you're doing in the experiment itself. And in B2B, you don't usually have the luxury of large M, which you [inaudible 00:34:54] consumer.\n\n(00:34:54):\nFacebook can get [inaudible 00:34:56] in two hours. A B2B company could take two years to get to the same number of touch points. And so to counteract that, I recommend people just trying to maximize the treatment effect, which is like if you have a hypothesis that you're testing, just throw all of the possible tactics and resources that you think would move that needle because you can always cost rationalize later if it works.\n\n(00:35:22):\nAnd so just maximize the treatment effect. And if with all of that it didn't work, then you can say, \"Hey, we're not going to try this again because we literally did try everything that we could to test this hypothesis. And if it doesn't work in the best version, and it's expensive as it is, this is not worth spending more time on.\" But if it does work, great. Then you do another version of the test with half the tactics or whichever tactics you think work better or worse and you optimize over time.\n\nLenny (00:35:49):\nIs there an example you could share when you did that?\n\nSri Batchu (00:35:53):\nAccount-based marketing is something that is very common in enterprise software where you've selected certain customers that you think are high priority and you're saying, \"I want to touch them in as many nuanced ways possible to see if that drives conversion.\" And this is something I've seen tried many times where people do it, but they kind of do it halfway where they're like, okay, tried these three things. Conversion of the control group wasn't higher, and so we think it is not going to work. And then a new go-to-market executive comes and they have to do it again. They have to do it again. They have to do it again. It's like a very common one wherever this happens. And so when we did it at Ramp, we did exactly what I just described, which is like, let's really be thoughtful about the experiment design, both in terms of maximizing the number of people as well as maximizing the number of ways and types of ways that we're effectively touching these target customers to show the value one way or the other.\n\nLenny (00:37:03):\nSo what it sounds like is the hypothesis isn't like this email will have a big impact on conversion. It's like this strategy of coming after customers is what we're testing.\n\nSri Batchu (00:37:15):\nThat's the example there. And I think for example, if you had the... This kind of framework is more important for cross-functional, larger scale, bigger tests rather than an email modification. But we can even use it on a micro example like an email modification where you are like, \"Okay, I think this particular email is underperforming because it's not talking to this part of the customer's pain point or journey or what have you.\" And you could just, the simplest test would be, okay, let me make some tweaks to the text and edit that, and that could be the end of that test. And if that doesn't work, you're like, \"Oh, maybe those weren't the right text edits. Let me do a different text edits or whatever.\"\n\n(00:38:02):\nAnd that's fine, that's low cost. It's not the end of the world and it's for you to be wrong there. But an alternative that you could do is like, \"Oh, what are all of the things that I could change about this email in the same test?\" Is it the trigger of the email? Is it the text content of the email? Is it additional personalization? Is it the design of the email? Trying to think of what are all of the various levers that you think could be wrong and put them all together to test your hypothesis of this touch point is wrong, and how do I improve that?\n\nLenny (00:38:34):\nWell, obviously the downside of that is you, if it doesn't work, you don't know if it's like, oh, maybe it was this thing could have worked in the subject.\n\nSri Batchu (00:38:40):\nYeah, so there's always trade-offs on this, but what you're hoping is you've done a complete refresh where you did all the things that you thought were intuitive that should work. And if it doesn't work, then you're like, okay, maybe my hypothesis wrong. But you're right. There's always going to be a challenge if maybe the execution is wrong. And I did too many things potentially in that case.\n\nLenny (00:39:01):\nOur next story is from JZ, who is a colleague of mine at Airbnb, head of product at Webflow when we recorded this episode, and this is her sharing the story of one of the biggest product misses at Airbnb.\n\n(00:39:13):\nYou've seen a lot of new PMs, and you've seen these PMs succeed, you've seen some fail. What are the most common mistakes that you find new PMs make in this experience of helping new PMs get into the field?\n\nJiaona Zhang (JZ) (00:39:27):\nI think something that is really hard to untrain, but I think every human does it, is you jump to solutions. And so one of the biggest things I see, not just in my course, but also just as a PM and some of the mistakes that you make as a PM is the idea of you get really attached to a solution, a way of implementing something, something that you can see in your head that you want to build. And so that's the first thing I really want to like unteach in our course.\n\n(00:39:50):\nAnd so a lot of people will literally come in, they'll be like, \"I want to build X startup,\" or, \"I want to do this thing,\" or, \"I am in blank school, and I've been doing a lot of research on this particular area.\" And so untraining that and being like, \"Hey, we're going to go out there. We are not going to think at all about the thing that you want to build, but instead we're going to be focused on users and people in the real world and their problems. And the first step is to understand their problems and then understand if there's an opportunity here as opposed to, hey, you want to build X thing for Y person.\" So that's the biggest mistake that you really have to unteach and retrain thinking around.\n\nLenny (00:40:25):\nSo let's go to the other side of this question. We talked about what mistakes new PMs make. I'm curious, what's the biggest product mistake that you've made?\n\nJiaona Zhang (JZ) (00:40:34):\nWow, that's a good one. It's so interesting. I feel like as product people we're always making mistakes and we're always learning. Maybe I'll give an example from Airbnb since you and I were both there.\n\n(00:40:43):\n And this one does stand out to me. So we're working on this concept called Airbnb Plus. If you took a step back, what we're really trying to do is to be like, \"Hey, not everyone trusts Airbnb in terms of it's a platform. It's not like it's managed inventory, it's not a hotel. How do you go in and really make sure that we're all the Airbnbs are meeting the quality bar?\" But I do think we were very solution first, and I think we're also competitor afraid at the time. So it was during a time where there were managed marketplaces, there were the Saunders out there, and I think that as a company we're very much like, \"Oh, look at this. What are we going to do in the world of managed marketplaces?\"\n\n(00:41:19):\nAnd so we went really hard down the solution space. We essentially were like, \"Let's go inspect our inventory. Let's actually try to manage our inventory more.\" And really what we should have done is taken a step back and be like, \"What's the real problem?\" The real problem is people want to know what they're getting themselves into. We need to represent the homes a lot better. And I think the other piece here that's really important is what, as a company, is there strategic strength? And what's in your wheelhouse? So for example, Airbnb, we weren't that strong in operations. We again, we're this platform with this marketplace. And so if you don't have that muscle and then you're asking the company, the teams to essentially build it from the ground up, that's really, really difficult. Not to mention the unit economics. Are the unit economics actually going to work, even as you scale?\n\nLenny (00:42:03):\nYeah, I feel like Airbnb Plus is an untold story that somebody should tell, and that could be its own podcast, I guess.\n\nJiaona Zhang (JZ) (00:42:09):\nYou and I can tell it.\n\nLenny (00:42:10):\nWe could tell it. This could be Airbnb Plus the hidden, the story. As you said, the problem it was trying to solve was people don't really trust, they don't want to even consider Airbnb. Like, \"No, I don't want to stay in someone's home. I don't know what it'll be. It's unpredictable.\" And so as an outsider, it felt like a really clever approach. We're going to get them, we're going to make sure they're awesome. There's a minimum bar. And I guess this is the question is do you think it was just like this is never possible because we'll never make money as a business doing this, because we don't make that much booking and investing time, resources, sending people pillows, all that stuff is ever going to be economical. Or do you think there was a path, and it was just not executed well?\n\nJiaona Zhang (JZ) (00:42:51):\nI think there wasn't really a clear path. I think there was [inaudible 00:42:55]. Exactly. And it was more just like if you understood, again, this is my point around unit economics, there are things where I think you have magical thinking around unit economics. You're like, \"Well, when we get to the scale of X, it's all going to work out. We can make these things happen.\" I think you actually need to really make sure the unit economics work right at the beginning. So that is definitely one lesson.\n\n(00:43:14):\nAnd I think the other thing is, and going back to the spirit of what are you trying to achieve. If you're trying to achieve this idea of really knowing the quality of the place, and for a platform like Airbnb, the right way to go about doing is through our reviews, through our guest reviews, which are essentially free as opposed to literally sending out inspectors.\n\n(00:43:32):\nAnd I think that the other things are if you can get signal on what are the things around quality that people care about? Is it cleaning? Is it the, \"Hey, I'm locked out.\" And I think that there are other solutions besides inspection that then get at that. So for example, it is actually cheaper to go send everyone a lockbox than to deploy an inspector and go look at your property, right? It is actually cheaper to maybe do a partnership with a bunch of cleaners in different local areas, and then get that as part of the feat as opposed to doing inspection.\n\n(00:44:04):\nSo again, it's really about what are you really trying to achieve? What is the user problem in each of these areas, and can you target that problem with the particular listing that you're looking at? And so yeah, I personally don't believe the unit economics ever would've really worked out. I think we should have known that, or we should have dug into that more at the very beginning, and then to get very tailored instead of one blunt instrument to solve it all. Hey, we're going to go inspect. It's like, what is the problem for this listing, and what's the best solution to fix that problem?\n\nLenny (00:44:33):\nOur second to last story is from Gina Gotthilf, who was an early growth leader at Duolingo. She's currently COO of Latitud, and this is her sharing a wide-ranging and important point about how everyone has both an A side and a B side to their career, and people often only share their A side. So this is Gina sharing her B side.\n\nGina Gotthilf (00:44:53):\nWe are very encouraged in our lives, especially professionally, to talk about our A side all the time because that's what impresses people. That's what opens doors, that's what allows us to keep growing, and it's so important. So it means that a lot of what you hear in podcasts and on stage ends up being the Instagramable version of someone or a company or a country's trajectory. It's just the highlights. And when I talk about my A side, it's very impressive. I did things like, we'll talk about, I met President Obama, I worked on the Mike Bloomberg presidential campaign. I helped Duolingo scale from three to 200 million users. I worked with Tumblr, helping them scale Latin America, Andreesen Horowitz invested in my company, etc.\n\n(00:45:34):\nBut between all of those highlights, there were so many B moments that get shoved under the rug because it's just easier for me and it's more impressive for others. But I really like to highlight those because I think that most of us have a lot of B moments every day, every week, every month, and every period of our lives. And it's easy to think that things aren't just not going to work out for us because we're in one of those B moments if we don't recognize them as moments.\n\nLenny (00:45:59):\nI love this concept. We're going to talk as you expected about a lot of your A side stuff. Is there any example of a B side story of your life that would be interesting to share?\n\nGina Gotthilf (00:46:09):\nLook, I think those are the most interesting because they're funny or ridiculous. I had a lot of B sides, and I still do. For example, I had no idea what I wanted to do. I actually wanted to be. I thought I wanted to be an actress. I either wanted to be that person in Sea World, who goes like this with a dolphin. This is before Sea World was canceled. Or I wanted to be an actress. I applied to schools. I didn't get into any Ivy League. I didn't get into any of the top schools I wanted to go to. When I got to college, I actually ended up dropping out because I got so depressed, incredibly depressed, couldn't get out of bed depressed. Ironically, I dropped out of Reed College, which is the same college that Steve Jobs dropped out of. So I was just destined for greatness. I knew it at that moment.\n\nLenny (00:46:53):\nIt all makes sense looking backwards, as he said.\n\nGina Gotthilf (00:46:55):\nTotally. I was dropping out, being like, \"Yes, this is exactly the path.\" No, I was miserable. I thought there was no path forward. And I finally went back and graduated. The college counselor looked at my curriculum and said, \"What have you even done with your life? There's nothing to show for.\" And it was shocking because I was always the overachiever who wants to do the maximum curriculum and ace all of my classes and do whatever. I did three diplomas in high school, the international, the American, the Brazilian.\n\n(00:47:22):\nAnd so that for me, I think my one learning there that has stuck with me, and I think it can work for other people too, is that it's not just about doing things that actually matter and learning. It's about being able to tell the story, and it's about understanding what other people perceive as valuable. I applied to a hundred companies. I didn't hear back from most of them. I finally got an internship at kind a tier B/C digital marketing agency in New York City because I wanted to live in New York so badly. And they forgot to apply for my visa on time. So I lost my visa and had to go back to Brazil, and then I ended up leaving that organization to go work for another one. And I won't even go into the details of the shadiness of that company that I worked for, but then they ended up laying me off. So I lost my visa again, had to go back home, found another opportunity, got fired that time. So there was just a lot of rockiness in my start that I don't think you would imagine when you see someone up on stage leading a conference for 5,000 people. That I think is important.\n\n(00:48:26):\nAnd even when I started working for Tumblr, I was like, \"This is it. I made it. This is a really interesting company. This is going to work out.\" That was super rocky because it was an early stage startup. So for example, they couldn't figure out how to wire money to Brazil. So I was not paid for six months. And at one point, me and my colleagues were trying to get money out of the teller to pay contractors because we had no money to pay them, and we borrowed money from people. And finally they also laid me off because they decided to sell to Yahoo.\n\n(00:48:54):\nAnd then I had to figure out what am I going to do? No one's going to hire me. I've been fired and laid off so many times. So this is all before I started an agency to help US-based tech companies and startups grow in Latin America because I figured I was in this really great place to make that happen. And it eventually worked for, well-known companies such as Duolingo. At the time they weren't well-known. They were a tiny little startup. They didn't have an Android app. And that's how I started working with Duolingo because their head of marketing connected with someone they had worked with at Flickr and said, \"I noticed Tumblr grew a lot in Brazil last year. Can you recommend a company or an agency to help?\" And they said, \"This girl.\" And I was twenty-six. And so that's how they connected me with Duolingo. And I started helping them grow in Brazil as a consultant. They were like, \"This is great. Can you help us grow in Chile, Argentina?\" And I was like, \"Yes.\" They were like, \"How about Mexico?\" And I was like, \"Yes.\" Did I know anything about these places, Lenny? Did I know people there? No, but you can figure it out.\n\n(00:49:51):\nAnd then they ended up asking me to come on full time, do that across the world, Japan, China, Korea, Turkey, Spain, France, et cetera. And then to own growth, which ended up meaning communications, social media, government partnerships, anything to grow. And then eventually became an A/B testing growth engine with engineers and PMs and designers of which I knew nothing about.\n\n(00:50:15):\nAnd even after that, I left Duolingo five years later, didn't know what to do with my life. You'd think, \"Oh wow, you have it figured out now. You left Duolingo, you have the world in front of you.\" And I'm like, \"Maybe I can finally go work for nonprofits,\" which is what I actually wanted to do in the first place. Tried a hand at that. Had a couple of experiences before going to work for the Mike Bloomberg campaign.\n\n(00:50:36):\nWorking for the Mike Bloomberg campaign is impressive. But you know what? Mike Bloomberg didn't win. He's not the president. So that was not a successful campaign if you really look at it. And yeah, Latitud seems like it's a really promising path, but there's A days and B days. So it's just a lot of that. And just staying resilient and believing in yourself and getting back on the horse when you fall on your face.\n\nLenny (00:51:00):\nAmazing. That's such an important message. I think one of the threads from what you're describing, something that I think about a lot is people kind of underestimate how long their career is. There's just so much time to do stuff and for things to start to work. This going to sound really fancy, but I think Marcus Aurelius has this quote about how our life is actually very long. We just use it really badly and we just waste a lot of our time.\n\nGina Gotthilf (00:51:21):\nI think you're so right, Lenny, and I love that because people are going around being like, \"Life is short, life is short.\" But that's so true. We waste so much time. But also I think we don't recognize how much opportunity we have in front of us. And as a 26-year-old, I definitely thought my career was over. I was like, \"I blew it.\" And looking back, it's funny.\n\nLenny (00:51:40):\nYeah, I know exactly what you mean. I spent nine years at my first job at a random company in San Diego in a startup. I was like, \"What am I doing here so long?\" And it turned out that was really useful for the thing I did next. And then eventually, wow, things started to really take off. So I think that's a really good lesson for people. It's just a long time. This is my fourth career. I've switched careers many times. I was an engineer then. I was a founder. Then I was a product manager, and whatever this is. Whatever you call this thing.\n\nGina Gotthilf (00:52:06):\nI guess me, too. I was an operator. I was a consultant. Well, I was an employee. I was a consultant. Then I was an operator, which is a fancy way to say employee at a startup. And then now I'm a founder and a VC and an angel and whatever this is..\n\nLenny (00:52:22):\nAwesome. Awesome. So I think that's a really important takeaways. Just there's a lot of time to do stuff and don't stress if things aren't moving as fast as you want. I'm curious, what's a mess-up or a big mistake maybe that you made or your teammate that was like, \"Oh wow, that was a big waste of time.\"\n\nGina Gotthilf (00:52:38):\nYeah, look, a lot of things didn't work out. More than 50% of our A/B tests didn't work out. We made bets that didn't make sense. I will say though, that in the spirit of A and B sides, I, and I think in general, we are really good at forgetting the B stuff. I talk so much about all the stuff that worked that it's hard to remember all of those moments that didn't actually work. And the thing that I tend to talk about, which is this mistake that we made as the growth team is almost like one of those, when you get asked in an interview, what's your biggest weakness, and you're like, \"I'm a perfectionist.\" It's like one of those things that actually makes you sound good because it's the story about how my team really wanted to implement badges. We spent a lot of time playing all the games that were popular at the time, trying to understand how those gamification growth hacks that we could find in those apps would potentially overlay onto Duolingo and how we would do that.\n\n(00:53:35):\nAnd badges was just pervasive in all of the top games. And so it seemed like a no-brainer, but since we ranked all of our experiments in terms of ROI and return being like how many users we think we're going to get from this DAUs, and time investments, it never made sense to focus on this because we thought that the time sink would be too high. So I actually ended up not letting the team run this experiment for six months so that we focused on lower hanging fruit. So that's a mistake on my end.\n\n(00:54:04):\nThen we decided to run this experiment in the most lean way possible. We're like, \"You know what? There's MVEs. There's minimum viable experiments. We don't have to run a whole badges thing. We can just do something more simple and actually see if that leads to growth in an interesting way, and then we'll know.\"\n\n(00:54:20):\nAnd we ran this very simple experiment that was like, you signed up and then you get a badge. And it was like this girl with a balloon. I don't know, she was happy or whatever. And of course in retrospect, it led to no results, because no one is proud of signing up. It's not an exciting moment, and you don't even have badges to collect. You can't show it to other people. None of the things that make badges compelling were there, but we were like, \"Okay, well, we tested it didn't work.\" And then we moved on.\n\n(00:54:42):\nSo we moved on for another, I don't know, eight months and we didn't look back. And then when we did look back, first of all at that point we discovered that we hadn't been dogfooding, which also was embarrassing. Looking back, we hadn't been dogfooding in the growth team. We just come up with hypotheses. We were super careful about prioritizing them and making sure that we were doing the best possible write ups and all these things. But the dogfooding piece, I didn't come from a product background. I was a marketer and I didn't really understand the term dogfooding, but when we thought, we had a conversation, we were like, \"You know what? If we had just tested that, we would've all known that this was a super lame badge.\" And I was like, \"Why are we not testing our experiments?\" And so that became part of our practice.\n\n(00:55:26):\nIt's still relevant. I just had a conversation yesterday with engineers at Latitud. I haven't explained what we built yet, where we're building it. Maybe we'll get there, but I was talking yesterday, [inaudible 00:55:35] at Latitud, and they're awesome. In terms of product team, we have the number eight employee at NewBank. You might've heard of NewBank, but it's this massive banking fintech in Latin America. And we have people from other fintechs. And then we have this guy who was a lead PM at Twilio, and I was explaining to them why we should be dogfooding. And they were all like, \"Oh yeah, we should dogfood.\" It's just easy to forget stuff like that.\n\n(00:55:58):\nSo that was a mistake that we could have probably gotten to the growth that we got to with badges much earlier on. And not only did we get to growth with badges, but it became this amazing treasure trove of opportunity because once you have badges and people want them, you can now ask people to do anything. Go find friends, go buy things, whatever it is. And so we impacted almost all metrics across the company positively, including some we hadn't expected, but it's easy to talk about a mistake that ended up being a win. So that's why I compared it to the interview thing in the beginning. But we tried making Duolingo a social app really early on and failed. It was called Dual Duels. Dual Duels. You could duel.\n\nLenny (00:56:42):\nVery clever.\n\nGina Gotthilf (00:56:43):\nYeah, I know we were clever, but people didn't use it and we didn't figure out why. We tried making a Duolingo for schools platform. We couldn't get it to pick up. I went and watched dueling go in China and it got downloaded by a million people in the first day, and then the app got blocked because of the government, and then we couldn't figure out what to do. And then everyone rated the app like one star because it didn't work. And so then we had a lot of trouble actually recovering from that. We launched Duolingo in India and didn't realize because we couldn't have unless we went there, which we finally did, that most people set their phone UI in India to English, because typing in Hindi is hard. And of course there's a lot of languages throughout India, and we were making it so that when you downloaded Duolingo, whatever UI you open your app, your phone was set to, we offered not that language for you to learn. That was your base language. So we were telling people learn French, Spanish, German from English, and they were all trying to learn English, so they didn't find what they were looking for and they left. There were so many mistakes and luckily I think we were able to bounce back from most of them in terms of how Duolingo was doing today.\n\nLenny (00:57:53):\nAnd our final story is from Maggie Crowley VP of product at Toast, and one of the most beloved episodes of the podcast. This is Maggie sharing something a little bit different, her favorite interview question about failure and what it tells you about the person you're interviewing. Plus a story of her own product failure. Here's Maggie.\n\nMaggie Crowley (00:58:12):\nA question I ask in every product interview is, what's the worst product you've ever shipped? And that's because I don't think you're a good PM if you haven't shipped something that's really shitty. You just haven't had enough reps, you haven't done it enough times. And it's not only that you've done it, but that you can admit it and which one it is. That's so important.\n\n(00:58:34):\nI remember... It was so dumb. I'm still so mad about this that we did this. I won't name which team, which company, I'm not going to call that out, but we decided we needed to do a rewrite red flag number one of existing product, and engineer who I'd worked with many times, we had a really good relationship and this person was like, \"Yeah, yeah, it's going to take six months. No problem.\" Core part of the product, been around for forever. One of those things that the code is still the code written by the founders kind of thing.\n\n(00:59:07):\nIt didn't take six months. It took two and a half years. It still wasn't done. It almost never... It went on for so much longer than it should have. It took us forever to get to feature parody. It was the worst project. So many people rotated in and out of it. Everyone thought it was dumb. Sunk cost fallacy, just the worst. And it's because, A, we got arrogant and we thought we could do it. B, we skipped discovery. We didn't really write a one pager. We just went for it. We didn't do enough technical and design research into what the requirements would actually have to be. And there you have it.\n\nLenny (00:59:46):\nAnd did not work out, or was it a huge success in the end and it changed the trajectory of the business?\n\nMaggie Crowley (00:59:50):\nAbsolutely not. But you know what? I didn't get fired, so it's fine.\n\nLenny (00:59:54):\nI feel like I've gone through those experiences and then three, four years later, it's like another... Maybe this rewrite and redesign may work. We haven't updated this thing in a long time.\n\nMaggie Crowley (01:00:04):\nJust don't do it. Don't rewrite. If anyone ever tells you to do a rewrite, don't do it. A side-by-side rewrite, nope.\n\nLenny (01:00:11):\nYeah, I've never had... What I run into is once you get too far down a redesign slash rewrite, everyone's building in that new world, and then you launch, and experiment's negative, and then it's just like, \"Oh, we just got to launch it. We're going to call it back. We're going to figure out how to get back to neutral someday.\"\n\nMaggie Crowley (01:00:26):\nYeah yeah. Don't do that.\n\nLenny (01:00:28):\nGood times.\n\n(01:00:29):\nAnd that is a wrap. I hope you enjoy these stories of failure. I want to give a huge special thank you to all of our amazing guests for being vulnerable and sharing these stories of failure in their career. I hope you leave this episode with a new perspective on how setbacks and challenges and failure can often be exactly what you need to get to the next step of your career or your life. If you've got a great story to tell about failure, I'd love to hear it. Leave a comment either on YouTube or on Lennysnewsletter.com or just DM me on Twitter. Or you could reach out at LennyRachitzky.com and click the big contact button. Thank you for listening. Bye, everyone.\n\n",
  "zh": "Lenny (00:00:02):\n今天我们又迎来了一集非常特别的合集节目。如果你注意到的话，我在播客和时事通讯中越来越多地探讨一个主题，那就是“失败”。通常我会花很多时间研究最优秀的公司和最优秀的产品领导者是如何运作的，但你可以从失败中学到很多东西，而且往往能学到更多。因此，在这一集里，我们回顾了过去做过的所有节目，提取了其中最有趣、最深刻的关于失败的故事，并将它们汇编成了这集专门讨论失败的节目。我希望你会觉得这些内容既有用又有趣。请在 YouTube 的评论区或 lennysnewsletter.com 上告诉我们你的想法，或者直接在 Twitter (现为 X) 上联系我。如果你喜欢这种形式，我们会继续做下去。如果不喜欢，我们可能就不做了。无论如何，希望你喜欢。在开始之前，先听听我们优秀的赞助商的一段简短介绍。\n\n(00:00:52):\n让我向你介绍一款名为 Sendbird 的产品。这是一个专为网页和移动应用设计的全方位通信 API (Application Programming Interface，应用程序接口) 平台。在多渠道沟通泛滥的今天，产品团队发现应用内沟通的效果更为显著。通过 Sendbird，企业可以提升其应用内的体验，打造简洁且具有品牌特色的沟通环境，其功能涵盖 AI (Artificial Intelligence，人工智能) 驱动的聊天机器人、单向消息、聊天、视频通话和直播功能，全部针对电商、营销和顶尖客户支持而定制。像 Hinge、Patreon、Yahoo、Accolade 等具有前瞻性的公司都使用 Sendbird 来构建应用内沟通体验，从而推动用户参与、转化和留存。在所有沟通渠道中，应用内沟通的转化率、参与度和满意度都是最高的。当你考虑投资这个渠道时，请相信 Sendbird 能将你的应用内沟通体验提升到新的高度。今天就开始试用 Sendbird 的免费方案吧，作为 Lenny's Podcast 的听众，你将额外获得两个月的无限使用权，并可以使用所有高级功能，包括创建你自己的生成式 AI 聊天机器人。访问 sendbird.com/Lenny 开启你的免费旅程。那就是 sendbird.com/Lenny。\n\n(00:02:08):\n本集节目由 Eppo 赞助。Eppo 是由 Airbnb 和 Snowflake 的前员工为现代增长团队打造的新一代 A/B 测试 (A/B Testing，对照实验) 和功能管理平台。Twitch、Miro、ClickUp 和 DraftKings 等公司都依靠 Eppo 来支持他们的实验。实验对于推动增长和了解新功能的表现越来越重要。Eppo 能够帮助你提高实验速度，同时实现其他商业工具无法提供的严谨深度分析。\n\n(00:02:38):\n当我在 Airbnb 工作时，我最喜欢的事情之一就是我们的实验平台，在那里我可以自己轻松地设置实验、排查问题并分析表现。Eppo 不仅能做到这些，还拥有先进的统计方法，可以帮你缩短数周的实验时间。它还有易于操作的 UI (User Interface，用户界面) 用于深入研究表现，以及开箱即用的报告功能，帮你避免那些烦人且漫长的分析周期。Eppo 还能让你轻松与团队分享实验洞察，为 A/B 测试的飞轮激发新灵感。Eppo 支持各种场景下的实验，包括产品、增长、机器学习、商业化和邮件营销。访问 geteppo.com/lenny 了解 Eppo，让你的实验速度提升 10 倍。那就是 geteppo.com/lenny。\n\n(00:03:26):\n好了。首先，我们请到了 Katie Dill。她是 Stripe 的设计负责人，曾任 Airbnb 和 Lyft 的设计负责人。她将分享一段精彩的故事：在加入 Airbnb 后不久，整个设计团队基本上都对她发起了“反抗”，以及她从那次经历中学到了什么。\n\nKatie Dill (00:03:42):\n我很乐意聊聊这个，因为坦白说，那是我领导生涯中最大的学习经历，或者至少是那一瞬间发生的最大教训。那是发生在我加入 Airbnb 的早期。我被聘去接管体验设计部门，基本上就是产品设计团队，当时有 10 个人。\n\n(00:04:02):\n那时他们一直是直接向其中一位创始人汇报的，然后开始改向我汇报。在面试过程中，我了解了很多关于哪些行得通、哪些行不通的情况，以及设计团队在与其他部门协作时的一些磨难。所以，在工程、产品管理和设计如何协同工作方面，似乎还有提升空间。而且当时设计团队的员工敬业度得分 (Engagement Scores) 也非常低。\n\n(00:04:29):\n因此，我满怀信心地加入，迫不及待地想根据我从公司各处领导和同事那里学到的东西来尝试做出一些改变。我当时一副“大展拳脚”的姿态准备就绪。然后，在我加入大约一个月后，我的日程表上出现了一个会议。周四上午 8:30，一个半小时，参与者有一半的设计团队成员（也就是 5 个人）和我们的 HR (Human Resources，人力资源) 合作伙伴。\n\nLenny (00:05:00):\n噢，不。那可不是什么好兆头。\n\nKatie Dill (00:05:01):\n通常不是 [听不清 00:05:01]。是的。我对此记忆犹新。我记得走进办公室，Airbnb 办公室的所有房间都是非常独特的空间，看起来像各种 Airbnb 房源，但偏偏那个房间全是白墙，只有一张灰色的扁平长方形桌子。我走进房间，他们五个坐在桌边，面前放着一叠纸。他们开始轮流安静地读纸上的内容，列举了所有他们认为我做错的事，以及所有他们不喜欢我的地方。那真的是一个非常艰难的时刻。我经历了听到反馈时通常会有的“悲伤的五个阶段” (Stages of Grief)，即立刻想要反驳：“噢，那是由于某个好理由才那样做的。” 还有“事实并非如此，” 以及“这是我为什么那么做的原因。”\n\n(00:05:59):\n但幸运的是，谢天谢地，我有理智仅仅去倾听，而不是那样回应。显然，他们告诉我的是，那正是缺失的东西之一。所以我听完了他们的诉说，全盘接受。抛开每一件具体的事情不谈，非常明确的一点是，贯穿所有这些事情的主题，也就是缺失的部分，是我还没有赢得他们的信任。所以，无论我做的事情是对是错，关键在于我没有带着团队一起前进。他们不知道他们是否可以信任我想要构建和塑造的东西，不知道我是否关心他们，是否把他们的利益和共同目标放在心上。那绝对是我的错。\n\n(00:06:45):\n现在回想起来，尽管当时很难受，但我非常感激，也非常惊讶他们能聚在一起向我分享这些。提出这样的反馈是非常困难的。\n\n(00:06:57):\n所以这是一次极其宝贵的学习经历，我从此立即改变了我的运作方式。建立信任的一个核心部分就是倾听，去听取团队中每个人的目标、他们关心的东西以及他们的动力。所以我开始做出相当迅速的改变，虽然仍然朝着组织运作所需的、能产生重大影响的方向前进，但这次我是带着大家一起走的。你可以把变革“强加”给别人，但如果你想和他们“一起”实现变革，信任才是关键因素。\n\n(00:07:37):\n几个月后，我们得到了全公司最高的敬业度得分。所以这实际上客观地改善了局面。从那以后，我在加入其他公司时也沿用了这一经验：与其一进来就“大展拳脚”，不如先倾听，这样你才能真正做出对周围人产生积极影响的改变，并带着他们一起前进。\n\nLenny (00:08:04):\n接下来是 Paul Adams，Intercom 的首席产品官 (CPO)。他分享了一段噩梦般的经历：在数千人面前在台上突然大脑空白，不得不走下台，然后因为麦克风没关，大家都听到了他在咒骂，以及他随后是如何恢复的。此外，他还会分享一些关于构建 Google (谷歌) 历史上最臭名昭著的几款失败产品的往事。\n\nPaul Adams (00:08:24):\n有些工作中发生的事在当时令人难忘，但并不会真的让你留下创伤。而这件事完全属于“终生阴影”那一类。是的，长话短说，十多年前我在 Facebook，当时我很喜欢那里。我觉得那时那是一个很棒的地方。基本上在旧金山，我为 Facebook 内部和外部做了很多演讲。Facebook 在戛纳 (Cannes)——全球最大的广告节——总是有一个主旨演讲 (Keynote) 时段。前一年，小扎 (Zuck) 接受了访谈。他是演讲者，在隐私问题上被问得很尴尬。效果没有他们预想的那么好。\n\n(00:09:00):\n于是第二年他们让我去。也许是我的爱尔兰口音让我得到了这个机会。是的，我登上了世界上最盛大的广告舞台。我想演讲大概进行了三四分钟，那是我做过很多次的一个非常类似的演讲。\n\n(00:09:19):\n然后我就卡住了。我记不起该说什么了。这是我生平第一次逐字逐句地排练演讲。通常，我会有一些谈话要点，然后即兴发挥，内容可能会被打乱，显得比较随意。但这次是经过媒体培训的 (Media Trained)，那种“千万不能说错话”的演讲。我就是记不起该说什么了。我有点恐慌发作 (Panic Attack)，走下了台。我身上还带着麦克风，我骂了脏话。我在自嘲，我想着：“天哪，他们在笑我吗？噢我的天，这……” 但我设法扭转了局面，我重新走了出去，在脑海中我已经卸下了负担，剩下的部分进行得很顺利。那天晚上在戛纳的海滨，到处都是桃红葡萄酒，我因为那场表现变得“名声大噪”，也“臭名昭著”。\n\nLenny (00:10:13):\n我觉得你经历了每个人在考虑做演讲时都会有的最可怕的噩梦。我觉得有趣的是你挺过来了，这是一个非常有趣的教训：你可能会在数千人面前卡壳，走下台，然后结果也还好。\n\nPaul Adams (00:10:30):\n我想这一切都是有机发生的，或者说非常自然。但没错，从那以后，直到今天，每次我走向会议演讲台时，我都会问自己，脑子里总有那么一丝疑虑。虽然那之后再也没发生过。但是，是的，我认为你必须随遇而安。当生活向你抛出这些“变化球” (Curve Balls) 时，你必须去适应，这没什么大不了的。这些事到头来都不是什么大事。最终你会继续前行，生活并学习。是的，但我仍然希望这种事别再发生了。\n\nLenny (00:11:02):\n我也讨厌公开演讲，我总担心这正是我会遇到的情况。所以我觉得听到即使在基本发生了最糟糕的情况后，事情依然能解决，这很令人欣慰。\n\nPaul Adams (00:11:13):\n你可以扭转局面。是的。\n\nLenny (00:11:15):\n我想听的第二个领域是你在 Google 的时光。你在 Google 参与了几款产品，它们都算不上是巨大的成功。然后你跳槽到了 Facebook，那次变动也挺波折的。你能分享几个那段时间的故事吗？\n\nPaul Adams (00:11:31):\n是的。就像那个走下台的经历一样，这就是在生活中学习。我在 Google 待了四年，在 Facebook 待了大约两年半。在 Google 时，我参与了许多你提到的失败的社交项目，比如 Google Buzz、Google Friend Connect，以及后来的 Google+。我认为这些项目的很多动力都源于恐惧，而不是出于“让我们为人们打造一款伟大的产品”或“让我们真正理解人们在与家人朋友沟通时的困扰”这种初衷。它不是真的想创造一些美好的东西，而是源于恐惧。\n\n(00:12:10):\n所以在那段时间里，我学会了在某些情况下不该如何进行领导。顺便说一下，我必须说当时在 Google，还有其他非常了不起的事情正在发生，比如 Google 正在开发 Google Maps（谷歌地图）。那是一款不可思议的产品，是我最喜欢的产品之一，我认为它是史上最出色的产品之一。他们当时还在开发 Android。Android 发布时，我正在移动团队、移动应用团队工作。所以那是极其优秀的产品。我只是刚好在社交产品线，而那条线当时做得并不好。\n\n(00:12:37):\n是的，Google Buzz 算是一场隐私灾难，Google+ 也差不多。所以在项目进行到一半时，我发布了一些关于“群体”的研究报告，我做了大量的研究。这里有一个有趣的插曲：当时我在美国团队担任 Researcher（研究员），我被要求做很多 Tactical research（战术性研究，侧重于具体操作层面的研究），比如 Usability study（可用性测试，评估产品是否易于使用的研究）之类的，看看人们会不会用这些产品。但我最终在同一场调研中也做了大量的 Formative research（形成性研究，在开发初期用于探索需求和发现洞察的研究）。我会跟团队说：“嘿，我会做调研，我会回答你们的问题，但我也要做另外一件事，我会花 20 分钟来做那个。”\n\n(00:13:16):\n所以我们过去常做的是——或者说我过去常和用户一起做的——是绘制他们的社交网络图，包括其中所有的人、家人、朋友，以及他们如何交流。我们会画出所有的渠道，讨论哪些好用，哪些不好用。在大概 18 个月的时间里，我们对几十个人进行了这样的研究。每次都会出现同样的模式，那就是：人们需要更好的方式来与家人和朋友组成的小群体进行沟通。我现在回头看，会觉得这不就是 WhatsApp 吗，或者如果大家都在用苹果的话，就是 iMessage。这在事后看来显而易见，但在当时并非如此。于是我们尝试围绕这一点打造了一款名为 Google+ 的产品，但正如我所说，它的初衷又是错误的。在我做完这些研究的中途，所有这些研究都通过一次会议演讲公开了，Zuck（扎克伯格）和 Facebook 注意到了，并取得了联系，顺理成章地，我离开并加入了 Facebook，这对我个人来说是一件很棒的事情。\n\n(00:14:13):\n当时的 Facebook 非常出色，是一个令人兴奋的地方。他们尝试做事情是出于其他原因，也就是那些好的原因，比如：“嘿，让我们为人们打造一款惊人的产品吧。”\n\nLenny (00:14:22):\n那是发生在 Google+ 正在建设期间吗？你基本上是直接跳槽了。\n\nPaul Adams (00:14:26):\n是的，就在中途，我现在跟你说起这件事都觉得压力很大。当时项目还没发布，仍处于保密状态，高度机密。Google 当时做了很多对他们来说是开天辟地头一回的事情。我不知道他们后来还做没做过，但当时比如：所有开发 Google+ 的人都被送到了另一栋大楼。那栋楼有不同的门禁卡，如果你不参与 Google+ 项目，你就进不去。这在当时是很多反公司文化的行为。结果就是，公司内部对 Google+ 产生了很多抵触情绪。所以当我在这项目进行到一半时离开，带着脑子里所有的计划投奔“敌人”，一些人理所当然地把我视为叛徒。另一些人则认为我是觉醒了。这取决于你和谁聊，但对我来说那是正确的一步。不过在当时，那是一个艰难的决定。\n\nLenny (00:15:17):\n我知道在那个过程中，对于你带走了什么以及整个流程，也有很多审查。\n\nPaul Adams (00:15:23):\n当我离开时，Google 某种程度上认定我是间谍之一。当我告诉他们我要离开时，我被隔离了。他们对我的笔记本电脑进行了 Forensic analysis（法证分析，通过科学手段提取和分析电子数据的过程），诸如此类的事情。所以当时情况非常紧张。回过头来看，我能理解为什么会发生那种事，但对我来说，根源在于那个项目一直是在一种恐惧感和竞争压力下运作的，我不认为这能带来好的结果。\n\nLenny (00:15:53):\n在你刚才分享的故事中，有一个主题是，我们姑且称之为“失败”……我不想说得那么严苛，但就是事情进展得不顺利。我很想知道，作为一名产品领袖，你认为经历这些对人们来说有多重要？你是否认为这几乎是一件好事？我想知道，作为一名教练或导师，对于那些想要成为像你这样的人，你有没有发现什么有帮助的建议？\n\nPaul Adams (00:16:19):\n这非常重要，现在依然如此。我个人失败过很多次。有两个故事，Google 的那个影响深远（Long deep tentacles）。我失败过无数次，比如在 Intercom 也是。我记得我在 Facebook 的时候过得很开心，但我知道我想 [听不清 00:16:39] Intercom 的联合创始人，他们当时正试图说服我加入 Intercom。当时那还是一家只有 10 人的小公司。但 Owen（Intercom 联合创始人）当时对我说的一句话一直留在我的脑海里。他说：“在 Facebook，你可以设计产品；但在 Intercom，你可以设计公司。” 这对我非常有吸引力，是一个很棒的 Pitch（说辞/推销）。他说：“就和我们一起设计一家你想在其中工作的公司吧。”\n\n(00:17:03):\n所以，那部分理想就是建立一家拥抱失败的公司，一家认为尝试新事物是可以的公司。我非常相信 Big bets（豪赌/大额投注，指高风险高回报的重大决策），高风险，高回报。我对那些 Incremental（增量式的/渐进式的）小改动不太兴奋。虽然这么说，但这些改动当然也有其地位，特别是当公司变大时。但我对大赌注感到兴奋，如果你下大赌注，你就会犯很多错误。所以我们在 Intercom 建立的很多关于软件开发的原则中，有一条叫作 Ship to learn（以发布促学习）。我们后来改了这条原则，现在还贴在墙上。现在写的是：Ship fast, ship early, ship often（快速发布、及早发布、频繁发布）。这种理念本身就包含了失败的可能性。事情不会总是一帆风顺，而且往往会出错。但如果你能及早并快速地发布，就能快速学习，从而快速改变和改进。这就是我们尽可能去拥抱并教给人们的文化。但这往往是知易行难。\n\nLenny (00:18:05):\n特别是当你处于那个时刻，比如：“天哪，一切都要崩盘了，我真的把这事搞砸了。”\n\nPaul Adams (00:18:09):\n是的。而且这里还涉及到一个人们非常纠结的关于 Quality（质量）的权衡。我们对自己有很高的标准。Intercom 的很多东西都源于设计出身的创始人背景。我们非常看重 Craft（工艺/匠心）。我们永远不想因为自己发布的东西而感到尴尬。所以这中间存在一种真正的紧张关系（Tension），一种权衡：人们既有我们鼓励的高标准，同时我们也鼓励他们快速发布、去学习、去犯错。这是我们一直在处理的一种持续的张力。\n\nLenny (00:18:38):\n接下来，我们有 Tom Conrad，他曾是 Quibi 的首席产品官，也是 Pets.com 的工程负责人。这两个都是产品历史上最令人难忘的失败案例，他将分享从那些疯狂经历中汲取的教训。Tom 目前是 Zero Longevity Science 的 CEO，那是一家非常棒的公司，如果你还没见过，一定要去看看那个 App。下面是 Tom。\n\n(00:19:00):\n你提到了“著名的灾难”这个词，我想聊聊这个。你曾在两家最著名的灾难性产品公司工作过：Pets.com 和 Quibi。我觉得一个人能亲历如此巨大的关注度（Hype）然后又是如此惨痛的坠落，是非常罕见的。所以我想在这两个领域多花点时间。也许我们可以这样开始：你从这两次经历中各吸取了什么教训，并带到了未来的工作中？你会分享给别人什么建议？\n\nTom Conrad (00:19:30):\n可能最大的教训并不是关于业务细节。最大的教训其实是，这些经历会让你变得更好。在某些情况下，实际上我认为在这两个例子中，它们都成了某种多米诺骨牌，为我的个人抱负和职业生涯打开了大门。如果我没去那些公司、没学到那些东西、没经历过那些事情，这些门可能根本不会开启。坦率地说，即使是以 Pets.com 为例，即使它是这种高调的失败，我在 1999 年本可以去一千家电子商务网站中的任何一家。如果我在随后的工作面试中谈论我的经验，人们可能从未听说过你工作的地方，但每个人肯定都听说过 Pets.com。\n\n(00:20:17):\n这也是一个挺有趣的例子，说明某些挣扎是跨越时代的。那是 23、24 年前的事了。虽然作为一个领导团队，我敢肯定我们犯了各种各样的错误，但当时发生的情况之一是，有三家资金过剩的宠物电商网站，我们的融资额都超过了 5000 万美元，这在现在是一笔巨款，在当时更是天文数字。我们都认为这是一个 Zero-sum game（零和博弈，指一方的收益必然导致另一方的损失），当我们中的一个玩家开始大肆搞促销，或者不计后果地在全国广播电视上做广告时，我们都跟进了。这变成了一场无法取胜的 Arms race（军备竞赛）。所以我认为，这其中有一个根本性的教训：过度的投资本身可能成为一种 Albatross（沉重的负担/枷锁），或者引导你做出一些不明智的决定。\n\n(00:21:28):\n当然，Timing（时机）也非常重要。Chewy 是一家在线宠物商店，如今市值 90 亿美元。他们曾是一家私有公司，被 PetSmart 收购后又重新拆分上市。当他们被 PetSmart 收购时，收购价是 30 亿，是当时史上最大的电商收购案。虽然我认为将 Chewy 与 Pets.com 进行比较可能不公平——Chewy 在十年间执行得异常出色，一步一个脚印地建立了业务并将其转化为非凡的事业。而 Pets.com 处在一个完全不同的时代背景，并尝试以一种完全不同的方式进入市场。\n\n(00:22:07):\n人们常对 Pets.com 提出的批评，或者至少是当时的看法是：“这业务太蠢了。他们居然在到处运送狗粮，这根本行不通。” 这种看法是错误的。这绝对行得通。只是当全国 80% 的上网人口还在使用 Dial-up（拨号上网）时，可能行不通。那时候真的太早了。\n\nLenny (00:22:25):\n我看到你在某处分享过一个数据：你带着 Pets.com 从零开始，做到上市公司，然后到彻底倒闭，总共只用了 19 个月。\n\nTom Conrad (00:22:33):\n是的，没错，差不多是这样。那个故事中另一件被遗忘的事是，我们实际上并没有破产。我们关闭了公司，并将剩余资金退还给了投资者，这在此前从未有上市公司这样做过。领导团队得出的结论是，鉴于市场环境的变化，我们根本无法再为公司注入更多资金了。而这是一家需要持续投资才能实现盈利的公司。因此，与其把最后一分钱都花在注定徒劳的挽救尝试上，不如早点清算（Wind down），把银行里的钱拿回来还给投资者。\n\nLenny (00:23:22):\n这点我之前还真不知道。那我们聊聊 Quibi 吧。那里到底出了什么问题？你觉得 Quibi 当时有成功的可能吗？那次经历有没有带给你什么重大的教训，是可以应用到现在的？\n\nTom Conrad (00:23:33):\n对我来说，Quibi 最神奇的地方在于它重新点燃了我对这个行业、对这份工作的热情。我在 2018 年 12 月左右离开（Snap）时，曾以为自己可能再也不会做软件了。我已经做了很久，大概 25 年了。我也变了很多，行业也变了很多，我觉得自己可能已经没有十年前那种激情了。而且当时我觉得，开启一段完全不同的人生篇章或许也挺有趣的。我列了一大堆想做的事情，现在看来挺离谱的：比如想去当个面点师，或者去当风景摄影师，甚至想学着做点烂音乐发到 SoundCloud（在线音频分享平台）上之类的。这些想法唯一的共同点就是，我对它们一窍不通。人们会问：“哦，你想当面点师？你喜欢烘焙吗？” 我会说：“不，我对烘焙一无所知。” “哦，你可能想搞风景摄影，那你拍照片吗？” “不，我不拍照片。”\n\n(00:24:41):\n但我当时挺能演的，甚至在 TechCrunch（科技媒体）采访我离开 Snapchat 的原因时，我说：“我不干了，我要去做点完全不一样的事情。” 所以那个说法流传很广。但在我离开 Snap 几个月后，我接到了 Meg Whitman（梅格·惠特曼）和 Jeffrey Katzenberg（杰弗瑞·卡森伯格）的电话，他们当时正在筹划一个叫 New TV 的项目，也就是后来的 Quibi。\n\n(00:25:07):\n他们的推介（Pitch）是：“我们要尝试结合移动互联网、硅谷和 Consumer Tech（消费级技术）的精华，并将其与好莱坞风格的内容制作相结合，打造一种完全 bespoke（定制化）且专门为手机端消费而设计的产物。” 他们在寻找技术负责人和产品负责人，想看看我对其中一个或两个职位是否感兴趣。虽然我当时几乎不接任何人的这类邀约，但我还是参加了会议。毕竟，谁会拒绝和他们两位共进午餐的机会呢？于是我听了他们的推介，然后礼貌地拒绝了，告诉他们我要去当面点师之类的。接下来的七个月里，我们每隔几个月就这样聚一次。我们去吃午饭，他们向我更新进度，而我则继续拒绝加入的邀请。\n\n(00:26:05):\n就在那年年底，我又去吃了一次午餐。Meg 解释说，他们已经招到了一位技术负责人和一位产品负责人，但由于一些与 Quibi 本身完全无关的原因，这两位都在六周左右就离开了。Meg 说：“我们已经融了这么多钱，而且已经向世界宣告要在一年后发布产品。我们有很多工作要做，我真的需要帮助。如果你能每周抽出一两天来帮帮忙，我会把这看作是个人的人情。” 她还说：“我会继续寻找真正想要这份工作的人，但如果你能帮我把这个项目启动起来，那就太好了。”\n\n(00:26:53):\n我的妻子是一名自由撰稿人和营销策略师，她非常享受自由职业的生活。她说：“你应该去做，为什么不呢？每周只有两天，就几个月。最坏的情况能是什么？也许你会喜欢的。” 我说：“不，不。事情会是这样发展的：我不可能只做两天，很快就会变成三天，然后四天、五天、六天。我太了解自己了。” 她说：“不会的。你就周三晚上六点关上 Quibi 的电脑，对自己说‘他们只付了我周二和周三的钱’，然后到下周二早上再打开。你只需要做到这一点。”\n\n(00:27:35):\n好吧，她在大多数事情上都是对的，但在件事上她错了。我立刻就深深陷入其中了。从零开始组建团队、从零开始设计和构建产品，这真的太有趣了。而且还能利用过去 15 年里（自我们创办 Pandora 以来）出现的各种 modern software architecture（现代软件架构）技术。当然，我对 Quibi 发生的一些事情感到尴尬，但我非常感激那段经历，因为它让我重新爱上了这个行业，并提醒我，即使在过程中摔得很惨，能够亲手打造并发布一些东西，其回报感也是巨大的。\n\nLenny (00:28:28):\n在那次经历中，有没有什么教训教会了你哪些是要避开的，哪些是要争取的？\n\nTom Conrad (00:28:36):\n我觉得我以前有时会误判公司，因为我太专注于 Product execution（产品执行）了。我曾认为，如果你发现了一个人们关心的有趣问题，并以一种优美、优雅、令人愉悦的方式解决了它，比同领域的其他任何产品都要好上 10 倍，那么人们就会告诉他们的朋友，剩下的事情自然水到渠成。这一直是我的雄心壮志：找一个我真心想做的东西，用令人愉悦的方式把它做好，深入听取人们的反馈，然后不断 iteration（迭代）直至成功，跨越我们都梦寐以求的那个门槛——真正伟大的 word of mouth（口碑）。\n\n(00:29:27):\n但我现在更深刻地意识到，公司其实也是一个“数学问题”：它描述了你如何将投资投入到等式中，并在某个时间范围内产生回报。没错，等式中确实有一些变量会受到你构建的产品、以及你为使产品变得出色而做出的所有细节和决策的影响。但如果这个等式从根本上就是破裂的，或者本身就是一个巨大的赌博，那么再多的迭代和执行也无法挽救这个破裂等式所产生的失败结果。\n\n(00:30:14):\n我认为 Quibi 下了一个赌注，认为你可以建立一个完全定制化的内容库，其规模足以吸引人们花几十亿美元去订阅和 retain（留存）。那是一笔巨款。我们在 18 个月内制作了 70 部剧，这比所有主流广播网络一年制作的内容总量还要多。所以这是一个相当重大的成就。我们还押注，除了好莱坞风格的剧集外，还会制作大量 Daily content（日常内容），其制作水平相当于电视网的晚间新闻等等，作为人们在 YouTube 上观看的日常内容的替代品。这部分大约占了内容支出的三分之一。\n\n(00:31:19):\n一件非常有趣且没人提起的事是，所有这些内容都是设计成在播出当天或前一天制作的。所以没有 back catalog（过往节目目录/库存内容），而且都设计在我们建造的这些专业工作室里拍摄，成本非常昂贵。就像我说的，这占了我们内容投资的三分之一，甚至快到一半了。结果我们在新冠疫情爆发两周后上线了，除了在主持人家里的车库，我们根本无法制作任何内容。所以这个本应与 YouTube 截然不同的东西，现在实际上做得和 YouTube 内容一模一样——在家里自行制作，几乎没有好莱坞的支撑架构。\n\n(00:32:10):\n当然你可以说，YouTube 上的内容在这一类别中是非常出色的，也许我们永远做不到更好。但我认为 Quibi 根本性的问题在于，那个基础等式是破裂的：你是否能制作足够的优质内容（完全定制、专为服务打造、利用手机特性），这些内容是否足以让人们注册并留存，以及你是否能用几十亿美元做到这一点？我认为答案是否定的。内容库必须大得多，而且像任何公司一样，你必须有足够的时间和精力去对内容格式本身进行迭代。我们的路线图其实很想在内容格式上创新。所以，部分原因在于很快就发现数学模型算不通了。它需要的不是 20 亿，而是 60 亿、80 亿甚至 100 亿。而花 100 亿去赌一种新格式的风险回报比，超出了任何人的承受能力。\n\nLenny (00:33:20):\n接下来是 Sri Batchu，他是 Ramp 的前增长负责人。他分享了一个自从我们那次谈话后我就一直在思考的观点：当你失败时，确保你失败得彻底（fail conclusively），让这次失败成为你可以借鉴的真实教训，而不是单纯的浪费时间。请听 Sri 的分享。\n\nSri Batchu (00:33:38):\n在我的经历中，Growth experiments（增长实验）的成功率通常只有 30% 左右。所以你尝试的大多数事情都是行不通的。因此，你希望建立一种文化，让人们不害怕承担风险，不害怕失败。对我来说，失败不是你没有带来收入，失败是没能学到东西。所以，在失败中学习非常重要。只要你在学习，我们就庆祝失败。而你只有在设计了正确的测试并“彻底地失败”时，才能学到东西。因为否则的话，我们很多人都遇到过这种情况：凭直觉觉得某件事可能行得通，结果没成功，然后由于每隔几年换个新高管或别人有同样的想法，你就会一遍又一遍地重复做这件事。这是因为你没能设计出一个能让你“彻底失败”的测试。\n\n(00:34:31):\n这很难做到。但归根结底，让实验成功的路径只有两条：要么你有很大的 M（此处指样本量 N），要么你有非常显著的 treatment（实验干预/处理效应），也就是你在实验本身中所做的动作。在 B2B（企业对企业）领域，你通常没有 Consumer（消费级）领域那样的大样本量。\n\n(00:34:54):\nFacebook 可以在两小时内得到结果。而一家 B2B 公司可能需要两年才能达到相同的触达次数。为了应对这一点，我建议人们尽量最大化 treatment effect（实验干预效果）。也就是说，如果你正在测试一个假设，就把所有你认为能推动指标的策略和资源都投进去。因为如果成功了，你以后随时可以进行 cost rationalize（成本合理化）。\n\n(00:35:22):\n所以，只需最大化干预效果。如果在投入了所有这些之后还是不行，那你就可以说：“嘿，我们以后不会再尝试这个了，因为我们真的尝试了所有能测试这个假设的手段。如果在这个最好的版本下它都行不通，而且成本还这么高，那就不值得再花时间了。” 但如果成功了，太好了。然后你可以再做一个版本的测试，减掉一半的策略，或者去掉那些你认为效果较差的策略，随着时间的推移不断优化。\n\nLenny (00:35:49):\n你能分享一个你这样做的例子吗？\n\nSri Batchu (00:35:53):\n大客户营销 (Account-based marketing，简称 ABM) 在企业级软件领域非常普遍，你会挑选出某些你认为高优先级的客户，然后对自己说：“我想尽可能通过各种细致入微的方式与他们接触，看看是否能推动转化 (Conversion)。” 我见过很多人尝试这种方法，但往往只做了一半。他们会说，好吧，我们试了这三件事，对照组 (Control group) 的转化率并没有提高，所以我们认为这行不通。然后，一位新的负责进入市场 (Go-to-market，简称 GTM) 的高管来了，他们不得不重做一遍，再重做一遍，循环往复。只要发生这种情况，这都是一个非常普遍的现象。所以我们在 Ramp 尝试时，完全按照我刚才描述的方式去做：让我们真正深入思考实验设计，既要最大化触达的人数，也要最大化我们有效接触这些目标客户的方式和类型，从而以各种方式证明其价值。\n\nLenny (00:37:03):\n所以听起来，这里的假设 (Hypothesis) 并不是“这封邮件会对转化产生巨大影响”，而是“这种接触客户的策略”才是我们正在测试的东西。\n\nSri Batchu (00:37:15):\n这就是那个例子。我认为，这种框架对于跨职能 (Cross-functional)、更大规模的测试比邮件修改更重要。但我们甚至可以把它用在像邮件修改这样的微观例子上。比如你会想：“好吧，我认为这封特定的邮件表现不佳，因为它没有触及客户的痛点、旅程或其他什么。” 最简单的测试就是，好吧，让我对文本做一些微调和编辑，测试到此为止。如果这不起作用，你会想：“哦，也许这些文本编辑不对，让我换一种编辑方式。”\n\n(00:38:02):\n这没问题，成本很低。出点错也不是世界末日。但另一种替代方案是：“在这个测试中，关于这封邮件，有哪些是我可以改变的所有事情？” 是邮件的触发机制 (Trigger) 吗？是邮件的文本内容吗？是额外的个性化设置吗？还是邮件的设计？试着思考所有你认为可能出错的各种杠杆 (Levers)，并把它们放在一起，来测试你的假设——即这个触点 (Touch point) 是有问题的，以及我该如何改进它？\n\nLenny (00:38:34):\n显然，这样做的缺点是，如果它不起作用，你不知道是不是因为，比如，也许只是主题行里的某个东西本可以起作用。\n\nSri Batchu (00:38:40):\n是的，这之间总是有权衡的。但你希望的是你已经完成了一次全面的更新，把你认为直觉上应该起作用的所有事情都做了。如果还是不行，那你就可以想，好吧，也许我的假设是错的。但你是对的，如果执行层面出了问题，这总会是一个挑战。在这种情况下，我也许做了太多事情。\n\nLenny (00:39:01):\n我们的下一个故事来自 JZ，她是我在 Airbnb 的同事，录制这期节目时她是 Webflow 的产品负责人。她将分享 Airbnb 最大的产品失误之一。\n\n(00:39:13):\n你见过很多新入行的产品经理 (PM)，你看过他们成功，也看过一些人失败。在帮助新 PM 入行的过程中，你发现他们最常犯的错误是什么？\n\nJiaona Zhang (JZ) (00:39:27):\n我认为有一件事很难纠正，但我觉得每个人都会这样做，那就是“急于跳转到解决方案”。所以我看到的最严重的事情之一——不仅是在我的课程中，也是作为一名 PM 在职业生涯中会犯的错误——就是你过于执着于一个解决方案，一种实现方式，或者你脑子里构思的某种想要建造的东西。所以这是我在课程中真正想要“教化掉” (Unteach) 的第一件事。\n\n(00:39:50):\n很多人真的会跑过来说：“我想做 X 创业项目，” 或者 “我想做这件事，” 或者 “我在某某学校，我一直在对这个特定领域做大量研究。” 我们要纠正这种思维，告诉他们：“嘿，我们要去实践。我们完全不要去想你想建造的东西，相反，我们要专注于用户、现实世界中的人以及他们的问题。第一步是了解他们的问题，然后了解这里是否存在机会，而不是‘嘿，你想为 Y 人群建造 X 东西’。” 这是最需要纠正和重新训练思维的重大错误。\n\nLenny (00:40:25):\n那让我们来看看这个问题的另一面。我们谈到了新 PM 会犯什么错误。我很好奇，你犯过的最大的产品错误是什么？\n\nJiaona Zhang (JZ) (00:40:34):\n哇，这是个好问题。很有意思，我觉得作为产品人，我们总是在犯错，也总是在学习。也许我可以给出一个 Airbnb 的例子，因为你和我当时都在那里。\n\n(00:40:43):\n这一个确实让我印象深刻。当时我们正在开发一个名为 Airbnb Plus 的概念。退一步讲，我们真正想做的是：“嘿，并不是每个人都信任 Airbnb 这个平台。它不像酒店那样有托管的库存 (Managed inventory)，它不是酒店。你如何去确保所有的 Airbnb 房源都达到质量标准？” 但我确实认为我们当时是非常“解决方案导向”的，而且我认为当时我们也害怕竞争对手。那是托管式市场 (Managed marketplaces) 兴起的时期，外面有像 Sonder 这样的公司，我认为作为一家公司，我们当时的想法是：“哦，看那个。在托管式市场的世界里，我们要怎么做？”\n\n(00:41:19):\n于是我们在解决方案的空间里走得很远。我们基本上是想：“让我们去检查我们的房源。让我们尝试更多地管理我们的库存 (Inventory)。” 实际上我们本该做的是退后一步，问问：“真正的问题是什么？” 真正的问题是人们想知道他们预订的是什么样的房子。我们需要更好地展示这些房源。我认为另一个非常关键的点是，作为一家公司，你的战略优势是什么？什么是在你的能力范围 (Wheelhouse) 之内的？例如，Airbnb 在运营 (Operations) 方面并不擅长。再说一次，我们是一个平台，一个市场。如果你没有那种基因 (Muscle)，然后你要求公司和团队基本上从头开始建立它，那是极其困难的。更不用说单位经济效益 (Unit economics) 了。即使在规模扩大后，单位经济效益真的能跑通吗？\n\nLenny (00:42:03):\n是的，我觉得 Airbnb Plus 是一个没人讲过的故事，有人应该讲讲它，我觉得这本身就可以做一期播客。\n\nJiaona Zhang (JZ) (00:42:09):\n你和我可以一起讲。\n\nLenny (00:42:10):\n我们可以讲。这可以叫做《Airbnb Plus：幕后的故事》。正如你所说，它试图解决的问题是人们不太信任，他们甚至不想考虑 Airbnb。就像，“不，我不想住在别人的家里。我不知道会是什么样子。它是不可预测的。” 所以作为一个局外人，这看起来像是一个非常聪明的做法。我们要抓住他们，我们要确保这些房源非常棒。这里有一个最低标准。我想问的是，你认为这是否根本不可能实现，因为作为一家企业我们永远无法通过这种方式赚钱，因为我们的订房收益没那么多，而投入时间、资源、给房东寄枕头之类的所有这些开销永远不符合经济效益。还是说你认为其实有一条路，只是执行得不好？\n\nJiaona Zhang (JZ) (00:42:51):\n我认为当时并没有一条清晰的路径。我觉得存在 [听不清 00:42:55]。没错。更多的是，如果你理解——这又回到了我关于单位经济效益 (Unit economics) 的观点——在某些事情上，我认为你会对单位经济效益产生“幻想式思维” (Magical thinking)。你会想：“嗯，当我们达到 X 规模时，一切都会好起来的。我们可以让这些事情发生。” 我认为你实际上需要在最开始就确保单位经济效益是可行的。这绝对是一个教训。\n\n(00:43:14):\n我认为另一件事是，回到你想要实现的目标的初衷。如果你想实现“真实了解房屋质量”的目标，对于像 Airbnb 这样的平台，正确的方法应该是通过我们的评价系统，通过客人的评价，这基本上是免费的，而不是真的派检查员去。\n\n(00:43:32):\n我认为还有其他事情，如果你能获得关于人们关心的质量方面的信号。是清洁问题吗？是“嘿，我被锁在门外了”吗？我认为除了人工检查之外，还有其他解决方案可以解决这些问题。例如，给每个人发一个密码钥匙盒 (Lockbox) 实际上比部署一名检查员去现场查看房产要便宜，对吧？也许与不同地区的清洁公司建立合作伙伴关系，并将其作为服务的一部分，也比派人检查要便宜。\n\n(00:44:04):\n所以，这还是关乎你真正想达到什么目标？在这些领域中，每个用户的具体问题是什么？你能不能针对该特定房源的问题进行针对性处理？所以是的，我个人不相信单位经济效益能跑通。我认为我们本该在最开始就意识到这一点，或者挖掘得更深一些，然后变得非常定制化，而不是用一个“钝器” (Blunt instrument) 去解决所有问题。嘿，我们要去检查。相反，应该是：这个房源的问题是什么，解决这个问题的最佳方案是什么？\n\nLenny (00:44:33):\n我们的倒数第二个故事来自 Gina Gotthilf，她是 Duolingo (多邻国) 早期的增长负责人。她目前是 Latitud 的首席运营官 (COO)，她将分享一个广泛且重要的观点：每个人的职业生涯都有 A 面 (A side) 和 B 面 (B side)，而人们通常只分享他们的 A 面。这是 Gina 在分享她的 B 面。\n\nGina Gotthilf (00:44:53):\n在我们的生活中，尤其是在职业生涯中，我们被极力鼓励一直谈论我们的 A 面，因为那是让人印象深刻的东西。那是敲门砖，那是让我们不断成长的动力，这非常重要。所以这意味着你在播客和舞台上听到的很多内容，最终都变成了某个人、某家公司或某个国家轨迹的“精致版” (Instagramable version)。那只是高光时刻。当我谈论我的 A 面时，听起来非常厉害。我做过很多事，比如，我们会聊到，我见过奥巴马总统，我参加过迈克·布隆伯格的总统竞选活动。我帮助 Duolingo 将用户规模从 300 万扩大到 2 亿。我曾与 Tumblr 合作，帮助他们扩展拉美市场，安卓森·霍罗威茨 (Andreesen Horowitz) 投资了我的公司等等。\n\n(00:45:34):\n但在所有这些高光时刻之间，有太多的 B 面时刻被掩盖了，因为对我来说分享高光更容易，对别人来说也更令人印象深刻。但我真的很喜欢强调那些 B 面，因为我认为我们大多数人每天、每周、每月以及生命中的每个阶段都有很多 B 面时刻。如果我们不把它们看作只是一个过程，我们就很容易认为事情不会有好结果，仅仅因为我们正处于那些 B 面时刻之一。\n\nLenny (00:45:59):\n我喜欢这个概念。正如你预期的那样，我们会谈论很多关于你 A 面得事情。那么在你的人生中，有没有什么 B 面得故事是值得分享的？\n\nGina Gotthilf (00:46:09):\n听着，我认为那些经历是最有趣的，因为它们要么很滑稽，要么很荒谬。我曾有过很多“B-sides”（人生低谷或背面），现在也依然如此。例如，我当时完全不知道自己想做什么。实际上，我曾想成为一名演员。我曾想过要么去海洋世界（Sea World）当那种和海豚一起表演的人——这是在海洋世界被抵制（canceled）之前。或者我想当一名演员。我申请了学校，但没考上任何常春藤盟校，也没考上任何我想去的顶尖学校。上大学后，我最终退学了，因为我变得非常抑郁，极度抑郁，甚至到了无法下床的地步。讽刺的是，我从里德学院（Reed College）退学了，那正是史蒂夫·乔布斯（Steve Jobs）退学的同一所大学。所以当时我觉得自己注定要成就非凡，那一刻我就知道了。\n\nLenny (00:46:53):\n就像他（乔布斯）说的，回头看时，一切就都说得通了。\n\nGina Gotthilf (00:46:55):\n完全正确。我当时退学的时候心想：“没错，这正是通往成功的道路。” 不，其实我当时痛苦极了。我觉得前面已经没路了。最后我还是回去了并顺利毕业。大学顾问看着我的课程表说：“你这辈子到底都干了些什么？什么成果都没有。” 这让我很震惊，因为我一直是个“Overachiever”（过度追求成就的人），总是想修最多的课，拿全优，做任何能做的事。我在高中拿了三个文凭：国际文凭、美国文凭和巴西文凭。\n\n(00:47:22):\n所以对我来说，我认为那次经历中让我受益匪浅、且对其他人可能也有用的一点是：这不仅仅关乎于去做那些真正重要的事情和学习，更关乎于你讲述故事的能力，以及理解他人眼中什么是具有价值的。我申请了一百家公司，大部分都没有回音。最后我在纽约一家 B/C 级的“Digital Marketing Agency”（数字营销机构）找到了实习机会，因为我太想在纽约生活了。但他们忘了及时为我申请签证，所以我失去了签证，不得不回巴西。后来我离开了那家机构去另一家公司工作。我甚至不想细说那家公司的“Shadiness”（那些阴暗、不可靠的细节），但最后他们把我裁掉了。所以我又失去了签证，不得不回家，然后找到了另一个机会，结果那次被开除了。所以我的职业起步阶段非常坎坷，当你看到一个人站在舞台上领导一个 5000 人的会议时，你可能想象不到这些。我觉得这些经历很重要。\n\n(00:48:26):\n甚至当我开始在 Tumblr 工作时，我想：“就是它了，我成功了。这是一家非常有趣的公司，一定能行。” 结果那段经历也非常坎坷，因为它是一家“Early stage startup”（早期初创公司）。例如，他们不知道怎么把钱电汇到巴西，所以我连续六个月没领到工资。有一次，我和同事们试图从银行柜员那里取钱付给承包商，因为我们没钱付给他们，我们还向别人借钱。最后他们也把我裁掉了，因为他们决定卖给雅虎（Yahoo）。\n\n(00:48:54):\n然后我不得不思考该怎么办？没人会雇我了，我被开除和裁员了这么多次。这些都发生在我创办代理机构之前，那家机构旨在帮助美国的科技公司和初创公司在拉丁美洲（Latin America）增长，因为我觉得我处在一个非常有利的位置来实现这一点。最终，这在一些知名公司身上起到了作用，比如 Duolingo（多邻国）。当时他们还不出名，只是一家极小的初创公司，甚至没有安卓应用。这就是我开始与 Duolingo 合作的原因，因为他们的营销主管联系了一个曾在 Flickr 工作过的熟人，说：“我注意到 Tumblr 去年在巴西增长很快，你能推荐一家公司或代理机构来帮忙吗？” 他们说：“找这个女孩。” 当时我 26 岁。这就是他们把我介绍给 Duolingo 的经过。我开始以“Consultant”（顾问）的身份帮助他们在巴西实现增长。他们觉得：“太棒了，你能帮我们在智利、阿根廷增长吗？” 我说：“没问题。” 他们又问：“墨西哥呢？” 我说：“可以。” 莱尼，我对这些地方了解吗？我在那里有人脉吗？并没有，但你可以去摸索。\n\n(00:49:51):\n后来他们邀请我全职加入，在全球范围内做这件事，包括日本、中国、韩国、土耳其、西班牙、法国等。然后让我负责“Growth”（增长），这最终意味着要负责通讯、社交媒体、政府合作伙伴关系——任何能带来增长的事情。接着，这里最终变成了一个拥有工程师、PM（Product Managers，产品经理）和设计师的“A/B testing growth engine”（A/B 测试增长引擎），而当时我对这些一无所知。\n\n(00:50:15):\n甚至在那之后，我在五年后离开了 Duolingo，又不知道该怎么过日子了。你可能会想：“哦哇，你现在肯定想清楚了，你离开了 Duolingo，全世界都在你面前。” 而我当时想：“也许我终于可以去‘Nonprofits’（非营利组织）工作了，” 这其实是我最初想做的事情。我尝试了一下，在去为迈克尔·布隆伯格（Mike Bloomberg）的竞选团队工作之前，有过几段经历。\n\n(00:50:36):\n在布隆伯格的竞选团队工作听起来很了不起。但你知道吗？布隆伯格没赢，他没当上总统。所以如果你仔细看，那并不是一次成功的竞选。是的，Latitud（Gina 创办的公司）看起来是一条很有前途的道路，但也分“A 面”和“B 面”。所以这其中包含了很多坎坷。关键是要保持“Resilient”（复原力/韧性），相信自己，在跌倒时重新振作起来。\n\nLenny (00:51:00):\n太棒了。这是一个非常重要的信息。我认为从你的描述中可以总结出一点，也是我经常思考的一点，就是人们往往低估了自己的职业生涯有多长。你有足够的时间去做各种事情，让事情开始起步。这听起来可能有点深奥，但我记得马可·奥勒留（Marcus Aurelius）有一句名言，大意是我们的生命其实很长，只是我们利用得很糟糕，浪费了太多时间。\n\nGina Gotthilf (00:51:21):\n我觉得你说得很对，莱尼，我很喜欢这个观点。因为人们总在说“人生苦短，人生苦短”。但事实确实如此，我们浪费了太多时间。但同时，我认为我们没有意识到面前有多少机会。26 岁时，我绝对认为我的职业生涯完蛋了。我想：“我搞砸了。” 现在回想起来，这很有趣。\n\nLenny (00:51:40):\n是的，我完全明白你的意思。我的第一份工作在圣地亚哥一家名不见经传的初创公司干了九年。当时我想：“我为什么在这里待这么久？” 结果证明，那段经历对我接下来的事情非常有用。最终，哇，事业开始真正腾飞了。所以我觉得这对大家来说是一个很好的教训：时间还长着呢。这是我的第四份职业了，我换过很多次职业。我当过工程师，然后是“Founder”（创始人），然后是“Product Manager”（产品经理），再到现在的这个工作——不管你怎么称呼这份工作。\n\nGina Gotthilf (00:52:06):\n我想我也是。我曾是一名“Operator”（运营者/执行者），曾是一名顾问。嗯，我当过雇员，当过顾问，然后是“Operator”——这是对初创公司员工的一种高级说法。现在我是创始人、VC（Venture Capitalist，风险投资人）、“Angel”（天使投资人），以及现在的这些身份……\n\nLenny (00:52:22):\n太棒了，太棒了。所以我觉得这是一个非常重要的收获：有足够的时间去做事情，如果事情进展没有你想象的那么快，也不要感到焦虑。我很好奇，有没有什么搞砸了的事情，或者你或你的团队犯过的一个大错误，让你觉得“噢哇，那真是巨大的浪费时间”？\n\nGina Gotthilf (00:52:38):\n是的，听着，很多事情都没有成功。我们超过 50% 的“A/B tests”（A/B 测试）都没有结果。我们做了一些毫无意义的赌注。但我得说，本着 A 面和 B 面的精神，我——我认为通常情况下我们所有人——都很擅长忘记 B 面的事情。我经常谈论那些成功的案例，以至于很难记住那些失败的时刻。我倾向于谈论的那件事，也就是我们增长团队犯的一个错误，就像你在面试中被问到最大的缺点是什么，你回答“我是个完美主义者”一样。这听起来反而像是在自夸，因为这个故事是关于我的团队非常想实现“Badges”（勋章系统）。我们花了大量时间玩当时流行的所有游戏，试图理解我们在那些应用中看到的“Gamification growth hacks”（游戏化增长黑客手段）如何能叠加到 Duolingo 上，以及我们该如何实施。\n\n(00:53:35):\n在所有顶级游戏中，“Badges”几乎无处不在。所以这看起来是个显而易见的选择。但由于我们根据“ROI”（Return on Investment，投资回报率）来给所有实验排名——“Return”是指我们认为能获得的“DAUs”（Daily Active Users，日活跃用户）数量，以及时间投入——专注于这个项目似乎从来都不合理，因为我们觉得耗费的时间太长了。所以我实际上有六个月没让团队运行这个实验，以便我们专注于那些“Lower hanging fruit”（容易实现的目标）。这是我个人的一个失误。\n\n(00:54:04):\n后来我们决定以最“Lean”（精益）的方式运行这个实验。我们想：“你知道吗，有 MVE（Minimum Viable Experiments，最小可行性实验）。我们不需要搞一整套勋章系统，我们可以做点简单的，看看它是否能以一种有趣的方式带来增长，然后我们就知道了。”\n\n(00:54:20):\n我们运行了一个非常简单的实验，内容是：你注册了，然后获得一个勋章。那是一个拿着气球的女孩，我不确定，反正她看起来很高兴或者之类的。当然，回过头来看，这没有产生任何结果，因为没有人会为“注册”感到自豪。这不是一个令人兴奋的时刻，你甚至没有其他勋章可以收集，也不能展示给别人看。任何让勋章具有吸引力的因素都不存在，但我们当时想：“好吧，我们测试过了，没用。” 然后我们就转向别的事情了。\n\n(00:54:42):\n于是我们又有大概八个月的时间没再理会它。当我们再次回顾时，首先，在那一刻我们发现我们一直没有进行“Dogfooding”（内部测试/吃自家的狗粮），这回想起来也很尴尬。在增长团队中，我们一直没有进行内部试用。我们只是提出假设。我们非常小心地确定优先级，确保我们做了最好的方案撰写之类的。但关于“Dogfooding”，我不是产品背景出身，我曾是个营销人员，我并不真正理解这个术语。但当我们思考并交流时，我们意识到：“你知道吗？如果我们当时哪怕自己试用一下，就会知道那个勋章超级差劲。” 我当时想：“为什么我们不测试我们的实验？” 于是那之后这就成了我们实践的一部分。\n\n(00:55:26):\n这在今天依然适用。我昨天刚和 Latitud 的工程师们谈过。我还没解释我们建造了什么，在哪里建造，也许后面会聊到。但我昨天正在和 Latitud 的成员交流，他们非常优秀。就产品团队而言，我们有 NewBank（巴西的一家大型金融科技银行）的第 8 号员工。你可能听说过 NewBank，它是拉丁美洲巨大的金融科技银行。我们还有来自其他金融科技公司的人。还有一个曾是 Twilio（云通讯公司）的首席 PM。我当时向他们解释为什么要进行“Dogfooding”，他们都说：“噢对，我们应该这样做。” 这种事情确实很容易被遗忘。\n\n(00:55:58):\n所以那是一个失误，我们本可以在更早的时候就通过“徽章” (Badges，一种游戏化激励机制) 实现那样的增长。我们不仅通过徽章实现了增长，它还成为了一个惊人的机会宝库。因为一旦你有了徽章，且人们渴望得到它们，你就可以要求用户去做任何事情：去寻找好友、去购买东西，无论是什么。因此，我们几乎正面影响了公司所有的指标 (Metrics)，包括一些我们未曾预料到的指标。谈论一个最终转化为胜利的错误是很轻松的，这就是为什么我一开始把它比作那个面试案例。但我们在很早期曾尝试将 Duolingo 做成一个社交应用，结果失败了。它叫 Dual Duels (双人对决)。你可以进行对决。\n\nLenny (00:56:42):\n听起来很聪明。\n\nGina Gotthilf (00:56:43):\n是的，我知道我们很聪明，但人们就是不用，而我们也没搞清楚原因。我们还尝试搭建一个 Duolingo 教育版 (Duolingo for schools) 平台，但没能推行起来。我去中国观察过 Duolingo 的情况，第一天就有 100 万人下载，然后应用就因为政府原因被封锁了，接着我们不知道该怎么办。于是所有人都因为应用无法运行而给它打了一星好评。在那之后，我们费了很大劲才恢复过来。我们还在印度推出了 Duolingo，但当时并没有意识到——除非亲身去到那里，我们后来确实去了——印度的大多数人会将手机界面 (UI) 设置为英文，因为输入印地语很困难。当然，印度各地有很多种语言，而我们当时的设计是：当你下载 Duolingo 时，无论你手机设置的是什么语言，我们就会提供该语言以外的其他语言供你学习，并将手机语言作为你的母语 (Base Language)。所以我们当时是在告诉印度用户“用英语学习法语、西班牙语、德语”，而他们其实是想学习英语，所以他们没找到想要的东西就离开了。我们犯过太多的错误，幸运的是，从 Duolingo 现状来看，我想我们已经从大多数错误中恢复过来了。\n\nLenny (00:57:53):\n我们的最后一个故事来自 Toast 的产品副总裁 Maggie Crowley，那是我们播客中最受观众喜爱的剧集之一。Maggie 分享了一些稍显不同的东西：她最喜欢的关于“失败”的面试问题，以及这个问题能反映出面试者的什么特质。此外，她还讲了一个她自己的产品失败故事。请听 Maggie 的分享。\n\nMaggie Crowley (00:58:12):\n我在每一次产品面试中都会问的一个问题是：“你发布过的最糟糕的产品是什么？”这是因为我认为，如果你还没发布过什么特别烂的东西，你就不是一个好的 PM (Product Manager，产品经理)。那说明你的练手次数 (Reps) 还不够，经历得还不够多。而且这不仅在于你做过这件事，还在于你能坦诚承认它并指出是哪一个。这非常重要。\n\n(00:58:34):\n我记得……那次真的很蠢。我现在想起来还会因为我们做了那件事而生气。我不会点名是哪个团队、哪家公司，但当时我们决定要对现有产品进行“重写” (Rewrite，指彻底推倒旧代码重新编写)——这是第一个红灯 (Red Flag，危险信号)。和我合作过多次的一位工程师，我们关系很好，那个人说：“没问题，大概需要六个月。”那是产品的核心部分，已经存在很久了。就像那种代码还是由创始人亲手写就的老古董。\n\n(00:59:07):\n结果并没有花六个月。它花了两年半，而且还没做完。它几乎从未……它持续的时间远超预想。我们花了整整几个世纪才达到“功能对等” (Feature Parity，指新旧版本在功能上完全一致)。那是史上最糟糕的项目。无数人加入又离开。每个人都觉得这很蠢。这就是“沉没成本谬误” (Sunk Cost Fallacy，指因已投入无法回收的资源而继续投入更多)，简直糟透了。这是因为：第一，我们变得傲慢，觉得我们能搞定；第二，我们跳过了“探索”阶段 (Discovery，指在开发前调研需求和可行性)。我们没怎么写“单页文档” (One Pager，简要的产品说明)，就直接上手了。我们没有对实际的需求规格进行足够的工程技术和设计调研。结果就是你看到的这样。\n\nLenny (00:59:46):\n那最后是彻底没戏了，还是说最终获得了巨大成功并改变了业务的发展轨迹？\n\nMaggie Crowley (00:59:50):\n完全没有。但你知道吗？我没被开除，所以也还好。\n\nLenny (00:59:54):\n我觉得我也经历过类似的事情，然后过个三四年，又会觉得……也许这次重写和重新设计能行呢？我们已经很久没更新这玩意儿了。\n\nMaggie Crowley (01:00:04):\n千万别这么做。不要重写。如果有人让你搞重写，别答应。特别是“并行重写” (Side-by-side Rewrite，指在旧系统运行的同时开发新系统)，绝对不行。\n\nLenny (01:00:11):\n是的，我还没遇到过成功的……我遇到过的情况是，一旦你陷入重新设计或重写太深，所有人都在那个“新世界”里构建，然后你发布了，实验结果却是负向的 (Experiment's negative)，接着大家就说：“噢，我们必须发布它。我们以后再想办法修正，总有一天会回到正轨的。”\n\nMaggie Crowley (01:00:26):\n对，对。千万别那样。\n\nLenny (01:00:28):\n真是段难忘的时光。\n\n(01:00:29):\n以上就是本期的全部内容。希望你们喜欢这些关于失败的故事。我要特别感谢我们所有了不起的嘉宾，感谢他们展现出脆弱的一面，并分享职业生涯中这些失败的故事。我希望你在听完这集后能有一个新的视角：挫折、挑战和失败往往正是你迈向职业生涯或人生下一步所需要的。如果你也有精彩的失败故事，我很想听听。请在 YouTube 或 Lennysnewsletter.com 留言，或者直接在 Twitter 上私信我。你也可以通过 LennyRachitzky.com 点击巨大的联系按钮联系我。感谢收听，大家再见。",
  "chunks_count": 7
}