{
  "guest": "Gustav Söderström",
  "en": "Gustav Söderström (00:00:00):\nThe internet started with curation, often user curation. So you took something, some good like people or books or music, and you digitize it and you put it online and then you ask users to curate it. And that was your Facebook, Spotify, and so forth. And then after a while, the world switched from curation to recommendation, where instead of people doing that work, you had algorithms. And that was a big change that required us and others to actually rethink the entire user experience and sometimes the business model as well. And I think what we're entering now is we're going from your curation to recommendation to generation. And I suspect it will be as big of a shift that you will eventually have to rethink your products. We have to rethink the user interface and the experience for recommendation first era. And so what does that mean in the generative era? No one really knows yet.\n\nLenny (00:00:47):\nWelcome to Lenny's Podcast where I interview world-class product leaders and growth experts to learn from their hard one experiences building and growing today's most successful products. Today, my guest is Gustav Söderström. Gustav is a product legend and he's now the co-president, chief product and chief technology officer at Spotify, where he's responsible for Spotify's global product and technology strategy and oversees the product design data and engineering teams at the company. I've had Gustav on my wish list of dream guests to have on this podcast since the day I launched the podcast and I'm so happy we made it happen.\n\nLenny (00:01:19):\nIn our conversation, we dig into what Gustav has learned about taking big bets and what to do when they don't work out, how Spotify moved away from squads and how they structure their teams now, how AI is already impacting their product, and also the future of music generated by AI. Also, why all great products need to pull some magic trick, how accurately succession represents Swedish business culture, and his hilarious analogy of peeing in your pants. Enjoy this episode with Gustav Söderström after a short word from our sponsors.\n\nLenny (00:01:51):\nThis episode is brought to you by Microsoft Clarity, a free easy to use tool that captures how real people are actually using your site. You can watch live session replays to discover where users are breezing through your flow and where they struggle. You can view instant heat maps to see what parts of your page users are engaging with and what content they're ignoring. You can also pinpoint what's bothering your users with really cool frustration metrics like rage clicks and dead clicks and much more. If you listen to this podcast, you know how often we talk about the importance of knowing your users, and by seeing how users truly experience your product, you can identify product opportunities, conversion wins, and find big gaps between how you imagine people using your product and how they actually use it.\n\nLenny (00:02:33):\nMicrosoft Clarity makes it all possible with a simple yet incredibly powerful set of features. You'll be blown away by how easy Clarity is to use and it's completely free forever. You'll never run into traffic limits or be forced to upgrade to a paid version. It also works across both apps and websites. Stop guessing, get Clarity. Check out Clarity at clarity.microsoft.com.\n\nLenny (00:02:59):\nThis episode is brought to you by Eppo. Eppo is a next generation AB testing platform built by Airbnb alums for modern growth teams. Companies like DraftKings, Zapier, ClickUp, Twitch, and Cameo rely on Eppo to power their experiments. Wherever you work, running experiments is increasingly essential, but there are no commercial tools that integrate with a modern grow team stack. This leads to waste of time building internal tools or trying to run your own experiments through a clunky marketing tool. When I was at Airbnb, one of the things that I loved most about working there was our experimentation platform, where I was able to slice and dice data by device types, country, user stage. Eppo does all that and more delivering results quickly, avoiding knowing prolonged analytic cycles, and helping you easily get to the root cause of any issue you discover.\n\nLenny (00:03:44):\nEppo lets you go beyond basic click-through metrics and instead use your north star metrics like activation, retention, subscription, and payments. Eppo supports test on front end, on the backend, email marketing, even machine learning claims. Check out Eppo at getE-P-P-O.com. That's geteppo.com. And 10X, your experiment velocity.\n\nLenny (00:04:08):\nGustav, welcome to the podcast.\n\nGustav Söderström (00:04:11):\nThanks for having me, Lenny. Pleasure to be here.\n\nLenny (00:04:13):\nIt's my pleasure to have you on. So at this point, you've been at Spotify for over 14 years, which is a rare feat in the tech world, and you've held a lot of different roles while you've been at Spotify. Can you just start off by giving us a sense of what these various roles and what you've done over the years at Spotify and then just what are you up to these days? What are you responsible for now?\n\nGustav Söderström (00:04:33):\nSo I came into Spotify in early 2009, late 2008. And my job then, I had been an entrepreneur, started some of my own companies in the, back then, very, very early feature phone, smartphone space. So I had a bunch of knowledge there. I had sold the company to Yahoo in the mobile space. I worked there for a while. I came back to Sweden and then I met through a mutual friend, Daniel Ek, the CEO and co-founder of Spotify. And they had built the desktop product already, the free streaming desktop product, and it was amazing and I could try it, but they needed someone to figure out what to do with mobile. And because I had been an entrepreneur in that space, I got that job.\n\nGustav Söderström (00:05:20):\nSo my job was to head up mobile for Spotify and figure out what the mobile offering would be, which was a challenge because, obviously, Spotify desktop was a free on-demand streaming application and back then, specifically with edge networks, you couldn't really stream at all in real time. The performance wasn't there and also you couldn't fund that with an ads model. So it was a product and business model innovation that was a lot of fun. So that's how I started. Then after a few years, I took on all of product development for Spotify. And then a few years later, I actually took on the technology responsibility, the CTO role for Spotify as well. And recently, my official title is co-president of Spotify together with Alex Nordstrom. So we run half of the company each. I run the product and technology side and he runs for the business and content side. So that's the super fast version.\n\nGustav Söderström (00:06:20):\nAside from getting more responsibilities taking on the technology department, it has been the same job by title. I've always reported to Daniel, but because Spotify's grown so much every six to 12 months, it's been starting at a new company. First, it was sort of a Swedish Nordic challenge and then it was a European challenge and then it was getting into the US and then we became a public company. So it's as if I had jumped around between a lot of jobs actually, even though it was largely the same title and role.\n\nLenny (00:06:55):\nYour story makes me think of the classic be careful what you're good at because you end up taking on more and more. And clearly, you've been given more and more responsibility over the years and so clearly things are going well and you're doing well.\n\nLenny (00:07:08):\nShifting a little bit. So you're on my podcast currently. You actually have your own podcast, which was this limited series on the product story of Spotify, which I listened to and loved, and it's surreal to listen to your voice in real time because I've been listening to that recently in preparation for this conversation. Two questions, just what made you decide to launch your own podcast knowing you had a full-time job and a lot going on and the production value for your podcast was very high for what I could tell? And then two, just what did you learn from that experience in terms of the product you ended up a building and just empathizing with the podcast creator side of?\n\nGustav Söderström (00:07:41):\nThere were a bunch of different reasons why I did that. One is, and not a small one, I think, like you, I love writing and I have this secret creator dream in me. I used to write blog posts a long time ago and I write internally a lot. You can't write that much externally when you work at a company like this.\n\nLenny (00:08:01):\nYeah.\n\nGustav Söderström (00:08:02):\nBut I love writing and talking and presenting. So there was certainly that. And then no small part was, from a product point of view, to empathize with one of our main constituents, the podcast creator. I'm, unfortunately, not a great musician. I try to play instruments and so forth, but I don't have any records. I don't sing very well. But I decided to make a podcast and that taught me a huge amount about what it's like to be a creator, creating different styles of podcast.\n\nGustav Söderström (00:08:33):\nFor example, we wanted to do a higher production cost podcast with music and then right away you run into a bunch of problems as Spotify is actually pretty well positioned to solve, but still, it's really hard to have music in a podcast from a rights perspective. So you understand all these problems that podcasters have and you can be better at solving them. But the biggest benefit and the real reason for doing the public podcast was that I have actually done an internal podcast through a hack where we could gate the podcast-only employees. And I tried to figure out internally how to build more culture around Spotify and help define for new employees and existing employees, who we are, the mistakes we did, the successes we had, and how we think about strategy specifically in product strategy because we were quite well known externally for technology and the squads and all of these things, not so much for product strategy.\n\nGustav Söderström (00:09:36):\nAnd because I love storytelling more than Google Docs, I decided to do an internal podcast and I went around and I interviewed actually Daniel's direct reports. So the CMO, the CHRO and CFO. And just ask them about a bunch of stuff. And the idea was to make them more approachable for employees because I felt listening to podcasts, even these people that have no idea who I am because I've never met them, I feel like I know them, I feel like I know how they think and I just like them much more. So the secret idea was, what if you could get to know your leaders much better than you do through occasional meetings or some town hall? So I did that internally, and because I'm a product person, we ended up talking a lot about product and product strategy. And people internally really like that.\n\nGustav Söderström (00:10:26):\nSo next time, the question was, what if people that don't even work at Spotify yet could feel as if they knew people at Spotify? That'd be great because most leaders in most companies are very opaque and appear as some otherworldly creatures that aren't really real, I think, when you see them in business papers or something. So what if you have heard them talk for an hour or so? So that was general idea. So a combination of recruitment tool, sharing more about how we think about product strategy and just because I think it was a lot of fun. I got to interview a bunch of smart and interesting people both externally and internally.\n\nLenny (00:11:09):\nDid it have the effect that you were hoping after looking back?\n\nGustav Söderström (00:11:12):\nI think it did. The podcast did well and, no, we did not give it our own promotion. I had to compete as everyone else, which also gives you a lot of empathy for the problem of like, okay, now you have a product, what about user acquisition? How do you actually get people to listen to it? So it did achieve what I wanted in the sense that we have this thing called intradays where especially in the past few years when we've hired a lot, we actually fly people to Stockholm for an onboarding session to learn about Spotify. And the leadership is on stage, talking about what they do and the departments and strategy and so forth. And it's very common that people come and tell me that, \"Oh, I listened to this podcast or this and the episode and it's at least one of the key reasons why I joined or sometimes the reason why I joined.\" So it's anecdotal, but it may be in the many tens of people, at least, who have said it. So that seems to work.\n\nLenny (00:12:12):\nThat's really interesting. Just again, and this comes up a few times on the podcast, is just the power of content in all these different ways for hiring for culture building. And it sounds like the original goal was just internally build this clinic culture and strategy.\n\nGustav Söderström (00:12:24):\nThat was the original goal, make senior leadership more approachable and reduce the distance and then also share more of the thinking in an entertaining way rather than just through docs that people end up not reading.\n\nLenny (00:12:38):\nI love that. So I was listening to it, as I said, and what was really interesting is I think episode four was actually all about AI, and I think your first attempts at leveraging machine learning in AI within Spotify. And I think that's what led to Discover Weekly and a few other tools. And that was years ago. And it's interesting listening to it now where AI is, again, a huge deal. And so I'm curious very tactically on the product team what you advise product managers and product teams on how to think about AI in their product thinking and also just in their day-to-day work.\n\nGustav Söderström (00:13:12):\nI can give a few examples there and I don't know that we're more sophisticated than anyone else, but we'll be doing at least the traditional machine learning for quite a long time. And I think in the podcast, I think I talked about the journey of the internet in stages. And one way to think about it is that the internet started with curation of the user curation. So you took something, some good, like people or books or music and you digitize it and you put it online, and then you ask users to curate it. And that was your Facebook, Spotify and so forth. And then after a while, the world switched from curation to recommendation, where instead of people doing that work, you had algorithms. And that was a big change that required us and others to actually rethink the entire user experience and sometimes the business model as well.\n\nGustav Söderström (00:14:04):\nAnd I think what we're entering now is we're going from your curation to recommendation to generation. And I suspect it will be as big of a shift that you will eventually have to rethink your products. So that's one lens. So I tend to talk to my teams about, even though it's all machine learning, I ask them to think of this as something completely different. The recommendation error was one type of machine learning. The generation error is a different type, so don't think of it as just more of the same, think of it as something actually completely new instead. And what we learned in ... Well, a few things. So if you look at this new era of large language models and the fusion models and so forth, there are two types of applications. As I said for the recommendation error, we had to rethink the user interface and the experience for recommendation first error.\n\nGustav Söderström (00:14:57):\nAnd so what does that mean in the generative area? No one really knows yet. As usual, there are a bunch of iterative improvements. So we use these large language models to improve our recommendations. You can have bigger vectors that can have more cultural knowledge. You can use it for safety classification on podcasts that no one has listened to yet and so forth. So there's lots of obvious improvements and we're doing those. But so far, we've only really done one real generative product in the hard definition, which is a product that couldn't have existed without generative AI, and that is the AI DJ. So that's a concept that we've been thinking about for a very long time. And the AI DJ is you press a button, a digitized person, there's a real person named X, digitized X. So he's now an AI, comes on and talks to you about music that you like and suggests music, and you can listen to it. And if you don't like it, you can just call him back and he says, \"Okay, now, let's listen to something maybe from a few summers ago,\" or \"Here's some new stuff that were trending yesterday in The Last of Us episode or something like that.\"\n\nGustav Söderström (00:16:10):\nSo that product couldn't have existed without generative AI, both generating the voice and generating the content of what the voice says. So you can have individualized, personalized voice at the scale of half a billion people. And so we had the use case we have seen for many, many years. Sometimes people call it the radio use case. We called it the zero intent use case internally when you actually don't know what you want to listen to at all.\n\nGustav Söderström (00:16:40):\nSpotify wasn't that good. Spotify was good when, at least roughly, you knew the use case of what you want to do, if it was a workout or dinner. We had lots of options for all of those. But if you really didn't know at all, it was hard to open Spotify and stare at it. And people used to say longingly that this was the one thing that radio was good at. Radio was quite bad, to be honest. I mean, it's not personalized to you at all. It's not on demand. You come in in the middle of things, it's actually terrible in many ways. But people still often say that there was something good about it. And I think that's something was the fact that you had a knob and you could just switch between contexts. It's like no, boring, boring, boring, boring, okay, this is good.\n\nGustav Söderström (00:17:23):\nAnd Spotify never had that mode of, I don't know what I want, but I want to cycle through things until I find something that I like. And I think with the AI DJ, that's actually the use case we managed to solve. So X comes on and says, \"I'm going to suggest something to you that you can listen to.\" And if you like it, you can keep listening, but if you don't like it, you bring him back again and you change channel. And for one reason or another, we tried to solve that for many times for a long time, but just starting to play a random song without any context as to why you would hear this, it just never worked. So that was our first foray into a product that couldn't exist before. And I think to your question of principles around that, there are a few pretty distinct principles that we've learned.\n\nGustav Söderström (00:18:09):\nOne that I really like that is not my principle at all, I think it is straight from Chris Dixon, is the principle of fault-tolerant user interfaces. So I can't say how many times during the early machine learning era when we said we're moving from curation to recommendation. I saw a design sketch that was a single big play button because clearly that is the simplest user interface you can do, but if you don't understand the performance of your machine learning, you can't design for it. The quality of your machine learning, if you're going to have a single play button, needs to be literally 100% or zero prediction error, and that's never the case. So let's say that you have a one in five hits, four out of five things are done, then you need a UI that probably at least shows five things at the same time on screen. So you have a one in five of something being relevant on screen.\n\nGustav Söderström (00:19:03):\nSo you need to understand the performance of your machine learning to design for it. It needs to be fault tolerant and often you need an escape hatch for the user. So you make a prediction. But if you were wrong, it needs to be super easy for the user say, \"No, you're wrong, I want to go to my library or to this or to that.\" So we have that principle of having fault-tolerant user interface and a user interface that corresponds to the current performance of your algorithms. And I think that is going to be true for generative machine learning as well. I think a very clear example actually is Mid Journey. If you think about the early Mid Journey user interface inside the Discord channel, actually generating an image was very, very slow.\n\nGustav Söderström (00:19:48):\nIt took a long time to generate high-quality image and they could have built the silver button thing where you put in a prompt, you wait for minutes, you get an image, and I think one out of four times, it's going to be bad. So you would've been disappointed three out of four times and it's a minute each, so like four minutes later, you'd be, \"This is a shitty product.\" What they did was they generated four simultaneous low-res images very quickly and you could say, \"So apparently, their performance was probably one in four, that's why they showed four and not six.\" And so one in four was usually pretty good. You click that one and either continue to iterate or scale it up. So that's also an example of, I think, people understanding where the performance of generative AI was when they built the UI. So that's something that I would be inspired by.\n\nGustav Söderström (00:20:37):\nAnd for the AI DJ specifically, another principle is to try to avoid this urge of just wanting to show off the technology and then have this voice that talk and talk and talk and talk. You have to remember that people came there for the music. So the principle for the AI DJ coming from the team, by the way, this was a bottoms-up product actually, it required a lot of support. We actually acquired big companies and so forth to be able to build it. But the idea had been built by teams bottom up. So the principle there was literally to do as little as possible and get out of the way. And I think that was really helpful. It's not telling you what the weather is and what happened in the news and going on and on and on about this band. It is trying to get you to the music and I think that's why it's working because it is working very well for us.\n\nLenny (00:21:24):\nI love this distinction between recommendation and generation. And this begs the question of, there's this trend that I imagine you're seeing of people autogenerating music using artists catalog. There's this Drake and The Weeknd thing that came out a week or two ago. Where do you think this ends up going and how do you think artists adjust to this world where music can just be autogenerated? This play button is all of it is generated versus just like the DJ in between the songs.\n\nGustav Söderström (00:21:53):\nFirst, big caveat, this is just super early. No one knows anything about how this is going to play out or the legal landscape and so forth, but I think it's going to have a lot of impact. And I think if we talk about two things, one is what it could do for music, the other is the right situation, and if rights-holders are getting compensated and so forth. So we talk about the first thing in isolation. I think an interesting example is right about when I grew up, Avicii came along. And it's interesting to think about because Avicii was not really considered by the existing music industry as a real artist because he couldn't really play an instrument and he couldn't sing, and he was just sitting with this computer in this DAW, digital audio workstation. And so it wasn't really considered real music. And I think now all of us consider it very real music and that he had tremendous real musical talent.\n\nGustav Söderström (00:22:51):\nSo I think right now, we're probably in the face where people say this isn't real music and it's somehow fake. I think the way to think about these diffusion models if and when they get good enough at generating music is probably the same like an instrument. It's just a much more powerful instrument and we'll probably see a new type of creator that wasn't proficient at any instrument and they couldn't assemble a full orchestra and do the thing that they had in their head and they can now generate very new things. I also think, by the way, that there is this distinction between AI music and real music that doesn't exist. For sure, very talented real musicians are using AI to get better and to help create new ideas. So that distinction doesn't really exist. It's all going to be AI. The question is what percentage, which makes the problem harder because you can't talk about if it should exist or not.\n\nGustav Söderström (00:23:50):\nYou have to talk about what percentage should exist and who gets to use it or not. But I think the way to think about it is probably as an instrument and that could help create a huge amount of art. And I think this is not news to you who probably use these things a lot, but I think if you don't use these generative models, there is the perception that you tell it to create a hit and you will get that. That's not how it works. Actually, what these models do is because they've been listening to a lot of music, they are very good at doing something that sounds very similar to what already exists. Actually being original is very hard. And from one point of view, as it now gets easier to create more generic music, it will actually be more difficult than ever to be truly unique.\n\nGustav Söderström (00:24:39):\nSo I still think there would be tremendous skill in creating something truly unique. And my hope would be that what happened with the DAW and that technology jump was you got a whole new genre like EDM that you couldn't really produce it with an orchestra or live. And maybe we'll see completely new music styles with these technologies. I think that would be very exciting. So that's on the positive side, but then you have the rights issue, which I have a lot of empathy for. And Spotify specifically has seen this before. So we had a different technology shift like this, which was the technology shift to online downloads of music and piracy and peer to peer. So first, it was a big technology shift in peer to peer and it was exciting for consumers. More consumers started listening to more music than ever. And I think that's where we are now with generative AI.\n\nGustav Söderström (00:25:31):\nThere's a new technology, but it also required a new business model before creators and industry could actually participate and benefit from this. And that's, obviously, self-serving to say because we were a big part of innovating that business model. But I still think that's what's necessary and I hope that that's what I and we could be part of. So I think we've seen the first part, the technology shift, and there will probably be a lot of discussion and chaos here which have a lot of empathy for, but I think we haven't seen the second part yet. What is a model where this could be a benefit? What actually happened after piracy is that the music industry got bigger than ever, not just as big but bigger than ever. And I think that could happen with this technology as well. But we're right in the beginning.\n\nLenny (00:26:20):\nSo along the same lines, something else you teach is this idea of all truly great products have to pull some magic trick. This comes up in your podcast a lot and I think you mentioned this other places, and thinking about all the stuff you're talking about here, it feels like, in a sense, everything's going to feel like magic because AI's baked into it.\n\nGustav Söderström (00:26:38):\nI think when we did the AI DJ, we did a small version of that. When people first listened to it, we could see that reaction in use of testing when they've wondered ... So the magic trick there was that how could they record this person saying so many different things because it's talking about my music. So the magic trick was, obviously, didn't record a person saying, it's generated, and that magic trick wears off. You hear it all the time now and so forth, but it was one of those magic tricks. So I still think that concept is important and it seems to correlate with products going viral and taking off.\n\nGustav Söderström (00:27:15):\nAnd I think it was the same using something like Dall-E or Stable Diffusion or Mid Journey the first time. It completely seemed like a magic trick. And, obviously, there is no magic, it's just data and statistics. But I think getting to that point and iterating a product to the point where it feels like magic the first time is very helpful. And it's often a question of just getting the performance to a certain level, scoping down, removing things. There's a lot of fine-tuning, I think, that makes you cross that line from it's cool and impressive but not magic to it feels like magic. I don't understand how this could be done.\n\nLenny (00:28:00):\nYeah, it reminds me of the launch of GBT which ended up being the biggest, most fastest growing product in history, and it's like the epitome of a magic trick. It feels like actual magic.\n\nGustav Söderström (00:28:09):\nAbsolutely, absolutely. And to most people, it is still very ... Actually to a lot of ascent, even to researchers, it's a little bit magical. No one really understands fully. So I guess there's maybe some magic left in the world.\n\nLenny (00:28:23):\nAbsolutely. And I think a lot of people are worried about not understanding what's going on there. Shifting to the way you all build product at Spotify. So Spotify is famous for popularizing this idea of squads and tribes. And correct me if I'm wrong, but you guys have moved away from that approach.\n\nGustav Söderström (00:28:39):\nYeah, that's right.\n\nLenny (00:28:41):\nOkay. So I'd love to understand just why you shifted and what you learned from that approach to building product, and then just like how do you organize the teams now? What do you do now?\n\nGustav Söderström (00:28:51):\nThis was something that we focused a lot on early and it turned out to be smart of us to name these things into squads and chapters and so forth. It wasn't really ... Well, maybe it was deliberately branding, but it wasn't for purposes of branding that we made it up. We made it up because we thought it was a good structure to use and we needed names for things and this was the early internet eras you were allowed to make things up. And so it was very good for where we were at the time and it certainly helped us in recruiting. It's become a little bit of a cost to us because people still think that we organize that way and it's not a very efficient way of being organized at this scale or maybe even if you started over right now because we've learned more.\n\nGustav Söderström (00:29:35):\nBut I think the big difference is the idea with the squad specifically was twofold. They were supposed to be small and full stack. So squad should be about seven people and it should have front and backend, mobile, QA, agile coaches and so forth, and it should be very autonomous was the idea. And that's really what we shifted. So, first of all, as you grow the company, scaling in increments of seven engineers just creates a ton of overhead. So, obviously, our teams now tend to be much bigger, maybe two, three times that at least per manager to maybe have 14 or something instead of seven and just less overhead roles. So that's one. It looks more traditional as you learn more and is reasonable as you scale. The second big thing I think we struggle with was back then when I joined, the average age at Spotify was ... I mean, I was the oldest and this was 14 years ago. So I think the average age was probably under 30 or something and it wasn't most tech companies.\n\nGustav Söderström (00:30:46):\nAnd so we had coming from Sweden, which is a different culture than the US, and I love a lot of things about Swedish culture and I think we managed to keep the best parts, but Sweden is a very bottoms-up autonomous culture. There's this famous drawing on how you make decisions in Sweden. In the US, I think it's just a hierarchy. In Sweden, it's a circle. It's in a circle, no one is in the middle, there is no leader and so forth.\n\nLenny (00:31:13):\nInteresting.\n\nGustav Söderström (00:31:14):\nSo I think by culture, we're very inspired by this super autonomous thing. And I think the idea with autonomy is very reasonable and the right one, which is we work and we are hiring the smartest people we can find and we pay high salaries for that. So if you're hiring smart people, one way to think about it is you're renting brain power.\n\nGustav Söderström (00:31:39):\nSo if you're renting all of this expensive brain power and then you give them no room to think for themselves, that doesn't sound smart, then you should actually hire less smart people and keep your costs down or something. So I think you have to give a bunch of autonomy to actually maximize the value of the investment you're making. So that's very reasonable that you would give a lot of space for people to use as much of their talent and capacity as possible. But the problem with that is if you put autonomy very far towards the leaves of the organization, and also if you combine that with having a very junior organization, which we did back then, there's a fair chance that you're just going to produce heat. You're going to have a hundred squads with a hundred strategies running in a hundred directions. And Spotify has been there in that camp.\n\nGustav Söderström (00:32:29):\nI mean, we managed to get somewhere, for sure, in spite of this, but I'd struggle to say we were efficient in doing that. So we've done a few things. The team structure is more traditional, larger teams, less overhead. And we've been specifically working with where in the org do we put the autonomy because the extremes are at the leaves and we were there. The other extreme may be at the top, let's say maybe some Twitter, there's one person. Both have problems. If you have it at the leaves, you're going to produce a lot of heat. If you have it at the top, you need someone with a lot of capacity and Elon has a lot of capacity, but you are, by definition, going to bottleneck. All decisions have to go through there. And Daniel, it's not his personality that he even wants to make all the decisions.\n\nGustav Söderström (00:33:19):\nHe wants to maximize throughput rather than to bottleneck the throughput. So the question is, if it's not at the top and not at the very bottom, where do you put it? And what we've found, which I don't think is very contrarian at all, I think this is the case in most companies, is around the VP level. So if you have Daniel, then you have the C level, myself and others, then you have the VP level, that is a good mix of instead of having one person in the company think, so only Daniel then and the rest just do, you have on the VP level in the company this many tens to maybe hundreds of people that have a lot of autonomy to think. So you get a good amount of freedom of thought and people thinking in different directions, but it's not like 8,000 people. And these people on the VP level are both quite a lot of them, but they're also usually quite senior. They have a lot of pattern recognition.\n\nGustav Söderström (00:34:16):\nSo I think that solves for, it's a good ... If you think of it as an optimization problem, it's a good optimization space. So the autonomy level in Spotify now tends to be quite high at the VP level and then lower around those levels.\n\nLenny (00:34:33):\nAnd when you say autonomy, what does that actually mean? Is it the VP of, say, the podcasting product has a lot of say over what happens and there's not a ton of ... I don't know how involved are people above? And I know Maya's the VP of product, I believe, for the podcast product.\n\nGustav Söderström (00:34:48):\nExactly.\n\nLenny (00:34:49):\nWho I think is going to come on the podcast someday. What does that mean in terms of Tommy for her, what practically?\n\nGustav Söderström (00:34:54):\nSo it means that I would ask Maya to define a strategy for what we do in podcasting, how are we going to be different, why would a podcaster want to be here? Whereas another company, I will make that strategy or another company, Daniel would make that strategy. Same with ... The AI DJ, for example, came from our personalization team. And so that was a bet that they made. So they have autonomy to make those kinds of bets and define strategies. Same with the user interface, we have an experienced team, can talk about the org structure later, but I put a lot of autonomy on the VP of experience to define and suggest what it is that we want to do. And in other companies, I would define all of that myself, for example.\n\nLenny (00:35:45):\nJust going even a little bit further here, I know you have just strong opinions on the way to organize teams and how the organization helps you optimize for specific things. What are your just thoughts along those lines and what have you learned about how the impact of organization and what you're optimizing for?\n\nGustav Söderström (00:36:03):\nYeah. So I talk about an idealized spectrum or maybe not idealized but exaggerated spectrum. Nothing is really true, but you create extremes to make a point. So on one spectrum, you have something like Amazon, which is known for two-pizza teams, no dependencies. You try to minimize dependencies so you can run in parallel. Teams compete with each other even on the same project and so forth. But they have direct access to the user.\n\nGustav Söderström (00:36:37):\nAnd so the benefit here is if you have an idea, the time to get the user is very low and it has worked for them. It's produced Kindle, it produced Alexa, it's produced a lot of very novel things. There are a few interesting downsides here. One downside that I'm extremely impressed with Jeff Bezos' foreseeing is if you have teams that compete with each other, the incentives are to hide your results, hide your code. And that should make for an organization that gets no platform leverage because no one's corporating. And I think either he had that insight or because he saw this, he had to do this, but he's well known for pushing extremely hard on hard APIs. If you don't create hard APIs to your technology, you're out. And if you think about it, it has to be that way because otherwise no one would do it.\n\nLenny (00:37:32):\nAnd a hard API is essentially everyone knows how to use this API and connect to this team to interface with.\n\nGustav Söderström (00:37:38):\nExactly. You have to expose your technology to others. You have to maintain those APIs and they have to be very structured because otherwise the whole thing would collapse as everyone's supposed to compete because there are no incentives. You have to centrally force that. And interestingly, even though theoretically then they're the worst position to have a structured platform, I think, because they forced it so hard, they were the ones who did Amazon Web Services because they had such hard defined APIs because of this rule that it was easier for them to turn it inside out and expose it the rest of the world. Whereas if you look at someone like Google, I think they struggled more with externalizing their APIs maybe because it is so friendly and soft. So they didn't need as hard APIs on the inside because there was no competition. People could just go into each other's code.\n\nGustav Söderström (00:38:18):\nSo it's interesting anecdote around it, but the main point is you're faster there, but it's going to be hard to corporate. And so you will see something like maybe exaggerating a bit. Sometimes you'll see multiple search boxes on the same page from different teams. And this has been true in Spotify, by the way, as well. You've seen multiple toasters on the Now Playing view coming up from different teams because they're working. When we were in the autonomous mode, everyone running. And then ... So you get the benefit of speed, but you get the drawback of shipping your org chart and shipping complexity to the end user. But clearly, that's been the right choice for Amazon because they're a trillion-dollar company. But then on the other spectrum, you have something like Apple who's also a trillion-dollar company. So clearly, both models work, where you would never see two search boxes from the same team popping up on an iPhone. That is centrally organized by something that is close to single individual.\n\nGustav Söderström (00:39:20):\nSo they are instead in what is probably the world's biggest largest functional org, they're doing as much. If you think about what goes into the Apple, I mean, they certainly do everything we do. They have music service, podcast service, audiobooks, and they have a billion other services. So it's not like they have an easier problem. And yet they build something that feels more like it was built by a single developer for a single user. So they centralize and they have this bottlenecking function that everything has to go through and be decided how it fits with everything else. And so that has the benefit of the user experience being simpler and not shipping the org chart and increasing complexity. But it also has the drawback of speed without having facts on it. I've heard people working at Apple have said, \"Yeah, it took seven years to get that thing to market,\" because you just had to wait in the pipeline.\n\nGustav Söderström (00:40:17):\nSo you have these extremes. And I think the most interesting example, I think, to think about is when you double click the power button on an iPhone, the Apple Pay comes up. That decision, how did that happen? You can imagine that all the services team would like to pop up when you double click that button. And so someone had to decide, should music come up, should payments come up, should something else come up? And so they have a different structure there. And on that spectrum of centralized versus decentralized, because of our strategy, which is we're a single application, trying to add or not trying to, we have added multiple types of content with actually very different business models on the backend, rev shares and royalties and book deals and so forth into single user experience. That is our strategy. We think the user experience in keeping that simple is the most important thing.\n\nGustav Söderström (00:41:12):\nSo we've chosen more of the centralized model, where these different vertical businesses, if you think about it, the music business, podcast, audiobooks business, they have it to go through a single recommendation organization because that's another problem. Which one do you recommend to which user? Should be a book or podcast or music? And how do you weigh them against each other? And also the user interface could easily get incredibly complicated if everyone built their own UI. The music team built their UI and then someone added features on top. So that's how we chose to optimize. But it is based on our strategy and I think both models work.\n\nLenny (00:41:50):\nThis episode is brought to you by Eco. Last month, Eco users earned an average of $84 in cashback rewards. How? With Eco, the future of personal finance. Eco is the update to a misaligned financial system. Providing an app that works just like your bank but removes almost all of the middleman, helping even the best money optimizers optimize in less time automatically. What if you earn rewards for paying your rent or got rewarded for ordering food and shopping online or even earn rewards for saving each month? And then imagine if you got rewarded again just for getting rewarded. With Eco, you can spend at some of your favorite merchants and automatically get 5% cashback, plus Eco's APY rewards look more like $80, not 80 cents. And then there are Eco points, the world's first open reward system. You earn them whenever you do almost anything in the Eco app.\n\nLenny (00:42:40):\nEco is working to make these points the most rewarding points ever. So it pays to be early. Sound too good to be true? Go to eco.com/lenny, sign up for an onboarding and find out why it isn't. Lenny's Podcast listeners who attend an Eco welcome session will get an exclusive 4% APY on deposits over $1,000. Learn more at eco.com/lenny, that's E-C-O.com/lenny.\n\nLenny (00:43:05):\nIt's interesting these two examples you gave, Apple and Amazon, they're two of the biggest companies in the world and they're like at the extremes of these two into the spectrum. And it's interesting, most companies are somewhere in the middle. I wonder if there's just a benefit to being in an extreme and that ends up being really important.\n\nGustav Söderström (00:43:21):\nI think so. In almost all industries, you have this smiling curve concept, where you want to be at the extremes on the smiling curve, and that's where big business opportunities are but not in the middle. So it's probably true in terms of organizational models as well.\n\nLenny (00:43:34):\nSpeaking of extremes, I want to talk a bit about taking big bets. So you guys had this big launch event recently where you basically redesigned the whole primary feed of Spotify to make it feel more like where apps are going, like TikTok reels feel of just stream, and you start hearing videos and music starts playing and some people loved it, some people did not. And I'm curious as a product leader, how you think about thinking long term and dealing with people that are just like, \"What the hell's ... I hate change, stop changing things.\" How do you think about that? Who do you listen to? Who do you ignore? How do you know to stay the course? How do you approach that?\n\nGustav Söderström (00:44:10):\nYeah, you're being very kind. There was a lot of negative feedback on Twitter on some of that. So let me actually dig into some detail because I think for product people listening to this, this is an interesting lesson that I think few companies talk about because you want talk about everything that went exactly as you thought they would and you don't want to talk about the things that didn't go exactly as you thought they would.\n\nGustav Söderström (00:44:39):\nSo I'll go through what we are trying to achieve and what we learned. So Spotify is mainly a background application, and for a long time, we've been considered very good at background music and podcast recommendation. When the phone is in your pocket and you're listening to an EDM playlist or pop playlist or something, we're really good at inserting another EDM track there or another pop track there or something like that in the background.\n\nGustav Söderström (00:45:09):\nWhat we hear from users again and again, though, is that they say that they get trapped in a taste bubble. So I love my Spotify, I love this, but I'm a little bit bored with EDM now and Spotify's not suggesting something completely new. And if you think about that problem, it may sound similar to the recommendation problem, it's just another recommendation problem, but it's actually fundamentally different because when you're recommending another EDM track inside the EDM playlist, you have a lot of signal from that user that they like EDM. But if you're going to recommend a completely new genre, by definition, you have no idea. Because if you had an idea, it wasn't new to them. So you can't know anything. So back to hit rate, your hit rate is going to be incredibly low when you suggest something completely new to the user.\n\nGustav Söderström (00:46:03):\nSo this problem of helping people get out of the taste bubble isn't that easy as it sounds. And we can't really take some genre that maybe isn't typical. So I'm a big fan of Reggaeton, for example. It's not typically ... It's not that common in Sweden. And if you would look the rest of my profile, it's EDM heaviness, you probably wouldn't have guessed it. And Spotify wouldn't have guessed it. So if I'm listening to my favorite EDM playlist in the background or maybe my metal playlist, metal is very big in Sweden, it's really hard for us to just insert a Reggaeton track in the middle of that. Most people are going to think Spotify's broken.\n\nLenny (00:46:41):\nYeah.\n\nGustav Söderström (00:46:41):\nWhat the hell are they thinking? So that doesn't really work. So in order to help people break out of their taste bubbles, you need something different. You need something where your hit ratio can be very low and you need people to expect it to be very low.\n\nGustav Söderström (00:47:00):\nSo when we recommend things in the background, our hit ratio needs to be at least nine out of 10, maybe one dud is okay, but if you get five duds, you're going to think we broke your playlist and your session. We need something where one out of 10 is a success. If you find one gem out of 10 tries, you're very happy. So you need a completely different paradigm. And you also need to be able to go through many candidates quickly because the hit rate is so low. You can't take three minutes per item. It's like, \"Okay, I didn't like this,\" and it's still like two minutes left before the next one comes on. You need to quickly say, \"No, no, no.\" So the obvious candidates for this are these feed-type experience, where you can go through lots of content, you're expecting the hit ratio to be much lower. And if you don't like it, the cost is very low, you just swipe.\n\nGustav Söderström (00:47:50):\nAnd then this is the reason why people have been ... When they want to break out of their taste bubbles or when they come into Spotify and listen to something completely new, it is usually because they found it on one of these services, like a TikTok or YouTube or something, where they get exposed to lots of new content. So people were asking us for these tools and so that's what we wanted to solve for. And so we built a bunch of features, feed-like structures, where you can go through either a new genre with many tracks or a podcast channel with genre with many episodes or even full playlists. And we implemented those and we put them in something called subfeeds. So in the current experience, and this is roll out worldwide, if you click the podcast subfeed, you get a feed of podcast episodes. Click the music subfeeds, you get a feed of playlists where you can go through many playlists. And if you don't understand the name, you can quickly hear what they sound like and check out a few tracks and understand if this is for you. And if you go through the search and browse page, you can find completely new genres that you can quickly go through.\n\nGustav Söderström (00:48:59):\nAnd so those are working as we intended. People go to them when they want to find new music. They browse through them and they save new songs. So they're working as we intended. The thing that didn't work as we intended was when users asked us for this again and again, we took the sum of these things and we put it on Home because people ask so much about discovery and we can see clearly how correlated discoveries with retention on Spotify and so forth. But what we misjudged or failed or rather learned about our own homepage is that the way it works right now, and this is what you can see in the Twitter comment, if you remove the angry voices and try to see what they're saying, they're saying the following, which is actually quite clear in the quantitative data as well, that if you look at what people do on Spotify's homepage, the current one, it is almost 90% what we call recall.\n\nGustav Söderström (00:49:59):\nSo it is either getting to a session that you're already in or a specific playlist that you know you want to get to or at least a specific use case. So you come in with a high intent, you actually knew what you wanted, and maybe only 10% of the time as a true discovery, like I don't know what I want. So if you think about, that is 90% recall and 10% discovery. When we tested the design ... So the subfeeds were working and not working, but when we tested some of them on Home, we switched it from 90/10 to 10/90. So 10% recall, 90% discovery. And while people want discovery, they probably don't want 90% discovery, instead of 90% recall. So if you then look at the comments on Twitter, what they're saying is like, \"Hey, I can't find my playlists anymore. Where are these things?\"\n\nGustav Söderström (00:50:47):\nThey're not really complaining about the discovery, they're complaining about the things they don't get anymore. And we can see this in the quant data as well. And you can see traffic shifting from home into search and into library, which is a clear sign people are trying to find the things they can't find anymore. And you can even see people then trying to use these discovery tools which are optimized for quickly understanding new things to do the recall. Where's that workout playlist I know I want? And it's actually very bad UI for recall, it's like a slot machine, right? Very unpredictable if you ever get to that workout playlist. It was optimized for finding new things, not for recall of existing things. When you do recall, you want the dense UI with many items on screen because you know what it is you're looking for. So you don't need a lot of real estate when you're doing discovery of new things. You want a lot of pixels and you probably want sound because you don't know what it is.\n\nGustav Söderström (00:51:40):\nSo what we learn about our UI, and I think there's maybe a little bit of product jealousy here, you always look at other experiences. And if you look around, it could be forgiven for thinking that most other products, if you look at something like YouTube, for example, their homepage is exactly that. It's a huge single-item discovery feed with only new items. And people don't seem to tweet angrily about how angry they are at you to say they love YouTube and it's a big product. And I think what we discovered was that we actually did something really well on our homepage, which was supporting you being inside a multiple sessions at the same time. So you could be in the middle of two podcasts and an audiobook and also them actually I just want to get to that workout playlist. I don't remember the name of it, but I know it's workout.\n\nGustav Söderström (00:52:31):\nWe actually did that part really well. I would venture just say much better than the other experiences where you literally have to go to some tab and into library and start browsing to get back to where you were. And so maybe it's path dependent. Because we have done recall pretty well, people got, I think, reasonably upset when they couldn't do the recall anymore. And we didn't want lose that because it was one of the things we did well and underestimated. And my takeaway is actually we do it better than other experiences. So we certainly want to keep that. So what we did was now we're just updating their hypothesis to achieve the same goal, which is these things are working and when people want to discover, they use them and they seem to work, they can also get better.\n\nGustav Söderström (00:53:20):\nYou're on this hill-climbing journey from a machine learning point of view, but the question is, how do you make sure that whenever people feel that they are in that I'm trapped in my taste bubble, they understand that these things are there and they're easy to use? So now we have a version of Home that we are also testing, obviously, where these things are very available but voluntary and you can still do all of the recall. And so from my point of view, this is the reason we A/B test because you want to be scientific about it and you want to learn as much as possible about your own product and your users. And now I'm sharing a lot of the learnings. Maybe we should keep them to ourselves, but my hunch is that it's going to make it a much better product.\n\nGustav Söderström (00:54:09):\nBut what I told my teams when we went into this, because I've done this a few times, agree to signing, I think there are two fundamentally different types of product development. One is designing a new feature. It is hard, but it's voluntary for people to use. So you do the AI DJ. Some people love it, that's fine. If you don't like it, it didn't make it worse for you. But when you redesign, it is much more tricky because it's not voluntary to participate in the redesign. So there's a cost even for people who don't like it. Then you have a very tricky problem here, which is there are going to be two types of feedback. One is you did something and it was right, but people are upset because you changed stuff. The other is you did something and it wasn't right, and people are also upset but for good reasons.\n\nGustav Söderström (00:55:08):\nAnd so how do you separate these two? Because I think I explained this to ... When we talk through this with my teams, I think the analogy to think about is you have your desktop, your physical desktop, you have your computer in one place, you have your pencil over here, you have your notebook over there, and I come in and I just rearrange all of it. And you have spent, in our case, maybe 12 years with that setup. It doesn't matter if I have a lot of quantitative data that my new setup is better, you're going to get upset because you are effective in this old setup. And it's hard to tell those apart. The most classic use case is the Facebook newsfeed, which people are very upset about when it became a single newsfeed. But it turned out to solve a lot of user problems that you didn't have to run around all of Facebook collecting events yourself.\n\nGustav Söderström (00:55:58):\nSo there are some ways of understanding if you made it better, but people's habits are broken or if it's not better. And one thing is, for example, to look at new user cohorts that don't have that behavior versus all user cohorts and so forth. So we went through all of this with the teams. Before we did it, I said, \"This is going to be painful.\" There's probably going to be a lot of tweets because chances that we get it exactly right are very low. So for that reason, it hasn't been very hard on the team. It is hard ... You want to respond to people, but the right way to do it is to listen, understand, try new hypothesis to really figure out what's going on. So I think I've done it maybe three or four times now. Three maybe. One unsuccessful, two successfully. So kind of knew what I was getting into.\n\nGustav Söderström (00:56:45):\nSo it's almost like you punish yourself, very painful, but also the most exciting things. And I think any product person knows that the easiest, the most straightforward thing to do is to iterate around where you are. There's no risk. You're not going to get fired, no user is going to get angry. But everyone also knows that eventually if you don't adapt new technologies, new paradigms, et cetera, you're going to get replaced. You have to find this balance of trying new things. And when you work in software, you have this tool of A/B testing and being scientific about it. When you build hardware, it's worse. If you're wrong, you're wrong. You can't update.\n\nLenny (00:57:26):\nI love this story. I so appreciate you sharing it. I imagine also with a big launch like this, you can't actually A/B test it ahead of time because of the press season. They're like, \"Oh my God, look what Spotify's doing.\" And so you're limited there. Imagine, right? You couldn't really test this ahead of time.\n\nGustav Söderström (00:57:40):\nThe hardest thing about this is if you're trying something completely new, the MVP needs to be very big so you can build a new IU, but if you didn't do algorithms for single item feed, you can't tell if it was the right idea but poor machine learning, right? UI poor machine learning. Or you have to build a lot and that gets quite expensive. That's actually ... The biggest why it's painful is not really the feedback from the outside. It is the cost you have to take on the inside. You incur a lot of costs as you're really hoping you're right.\n\nGustav Söderström (00:58:15):\nAnd in our cases, the changes on the homepage aren't that hard for us to do. The important thing is that the underlying hypothesis of, can we help you break out of your taste bubble actually works and then you update the acquisition funnels into that experience. But I think the problem is that you need to get so many things in place to be able to say, \"You might get a false negative,\" just because you didn't do it well or not. That's the biggest challenge, I think, with these big rewrites where everyone has to update everything before you can know if you're right or wrong.\n\nLenny (00:58:52):\nWhat was that process like of helping you understand what is not working and what is working and what you wanted to change? I imagine there's a bunch of data you're looking at, some tweets, things like that. What was the tactical, \"Oh, shoot, something's not going the way we expected, here's what we should do?\"\n\nGustav Söderström (00:59:08):\nWell, the feeds, we tested, but the home feed, we rolled out and tested afterwards. And we tested out on users, a few different variants of it. And then we got the data back and we looked more at the quantitative data. And we do a lot of user research where people sit and use the feeds to understand and build our own theorem mind of what is working and what is not working. And then, obviously, you look at user feedback, of course, and some users are very good at expressing what is of it that isn't working, others are not as good as expressing what isn't working. So it can be hard to parse that, but certainly, that's a factor as well.\n\nGustav Söderström (00:59:49):\nAnd so then once you do that, then you have quantitative data to look at. And then you sit in recent through, what do you think is right and wrong? What are the different hypotheses? What is working, what is not working? And then just update and test again and again until you prove or disprove your hypothesis. Trying to be as scientific as possible about it. And also I think the biggest risk also when you've invested so much time in something is getting precious about things. You have to just be brutal. You have to believe in things 100% until the data says no and then you believe in something else 100%. That sounds easy. It's very hard to do, to the extent that people get upset when you do it because, for some reason, people don't like when people change their minds. It is what we should want from everyone. I would love a politician who said, \"I'd looked at the data and I realized actually this is right and now I believe this.\" But we hate politicians that do that. They feel untrustworthy and we ridicule them.\n\nGustav Söderström (01:00:56):\nSo I think that's the biggest risk with anyone. You just have to be unemotional and just look at the proof and the data. And then if you do that, you just move on and then you get to where you want to be, and you solve the same problem but you adapt.\n\nLenny (01:01:14):\nI really like that philosophy. Essentially, it's the idea of strong opinions loosely held. Is that-\n\nGustav Söderström (01:01:19):\nExactly. Exactly what it is. And it sounds so easy, but it's hard.\n\nLenny (01:01:23):\nRight? Because to your point, people don't respect someone changing their mind. They're like, \"Oh, I see, they were wrong the whole time and they were so confident about being wrong.\"\n\nGustav Söderström (01:01:31):\nYeah, exactly. And it's unclear why it is what we should want, but I think it has something to do with human psychology. We actually tend to love profits and people who hold very strong opinions with very little data. Those are the people we like. People will look at a lot of data and actually that, we don't like. Not sure why.\n\nLenny (01:01:57):\nWe're flawed creatures.\n\nGustav Söderström (01:01:59):\nFor sure.\n\nLenny (01:02:00):\nIs there something that you've recently changed your mind about along these same lines that maybe comes to mind of like, \"Oh, yeah?\"\n\nGustav Söderström (01:02:06):\nNo, I think these learnings about the science system and homepage does really well, maybe better than others, that we don't want to wash out with a bath water or whatever the [inaudible 01:02:20] expression is. I think that's the biggest current learning I'm actually very happy about.\n\nLenny (01:02:26):\nYeah, I love learning that we're doing some really well that we didn't really realize necessarily and maybe we should lead into that more.\n\nGustav Söderström (01:02:34):\nExactly.\n\nLenny (01:02:35):\nGoing in a somewhat different direction. Shishir Mehrotra suggested to ask you something. He's on your board, I believe.\n\nGustav Söderström (01:02:41):\nYes.\n\nLenny (01:02:41):\nAnd he suggested to ask you about your 10% planning time. What is that about?\n\nGustav Söderström (01:02:46):\nThis is a concept that I think Shishir has used for a long time ever since he worked at YouTube. And the idea is that, roughly, you shouldn't be spending more than 10% of your time planning versus executing or building, which means that if you're working quarterly 10 weeks, you should spend one week planning as we work in six-month increment. So we try to spend two weeks planning and roughly successful. And this is ... Actually, when we talk about org models, give a shout-out to Brian Chesky at Airbnb, who is actually one of the first, I think, to have these more contrarian old models. He's much more applesque than most of Silicon Valley. He also works in six-month increments. He has a lot of experience in that as well. So that's what the 10% planning time is. And I think if you find yourself planning much more than that, you're either planning too much or your execution period is just too short for that amount of planning. It's a rule of thumb, but I find that it works.\n\nLenny (01:03:53):\nI asked a few PMs what I should ask you, PMs that work at Spotify actually, that I haven't told you. And someone pointed out that you always bring a lot of energy and clarity to a room. That's something they see you as really strong at. What have you learned about just the importance of that or just how to do that well as a leader?\n\nGustav Söderström (01:04:11):\nWell, that's great to hear. I didn't know that so I'm trying to figure out what to answer. I think that the energy, I don't know. I guess I'm just excited about what I do. I've always been excited about technology. I love seeing new things. My core drive is still this notion of you see something which I think you'll empathize with that doesn't exist yet. And you're like, \"Wow, I wonder if that could exist. That would be so cool.\" And then in order to get people to do it, you try to share that excitement. So I don't think I can bring a lot of energy for something I'm not excited about. So I have to work on things I actually believe in and that I'm excited about. And so maybe then the energy comes more naturally. Unfortunately, for me, so far, Spotify has been in this phase where a lot of innovation is allowed and I'm even asked to try to do new cool things.\n\nGustav Söderström (01:05:09):\nMaybe I would have less energy for a pure optimization phase. On the clarity, I've always liked trying to explain things. It's a well-known fact that the best way to understand something is to try to explain to someone else. So I go around explaining things to people who didn't ask for it and not to sound smart, but to see if I actually understood it. And so maybe it's that practice. And on that note, I actually do ask my leaders that work for me and I ask them to ask their leaders to always explain themselves. And I think when ... We talked a little bit about autonomy and so forth, we don't promise everyone that they have to agree, but I think the promise we should make to all employees is that even if they don't agree, they should be entitled to understand why you're making the decision.\n\nGustav Söderström (01:06:06):\nWhat I don't think is acceptable is to say, \"No, we're going to do it this way because I'm more senior. I've seen this a bunch of times. You are not smart enough.\" All of those things. I think you have to explain yourself so you owe an explanation. And I find that valuable back to the only way to understand something is to explain it because it usually turns out that if you can't explain it yourself, you probably don't really even understand it yourself. Sometimes I think it's possible that you can have product instincts that are good but you can't express them. But most of them, when people say there's something there but they can't explain it, they actually don't understand it themselves. And many times, there actually isn't anything there. And also if you can explain it as a product person, that knowledge is now shared. So it just becomes much more effective for the organization. So sometimes I try to provoke people a little bit and say ... When people ask how much is art versus science, I say, \"It's 0% art, 0% magic, and 100% science.\" And that's because I want to force people to try to explain it. I think we use the word art and magic. We have historically used the word art and magic for anything that we couldn't yet explain.\n\nGustav Söderström (01:07:33):\nGenetics was magic and art until it was science. And quantum physics was magic until it was science. And most recently, actually, intelligence and creativity was art and magic until it was statistics in an LLM. So I think I try to push people to say, \"Are you sure you can explain this?\" because that forces people to think through. So maybe I like it and I try to force it on people. So maybe that's why people think I sometimes bring clarity.\n\nLenny (01:08:07):\nI love that. Question along those lines, is there a system or an approach to explaining that you recommend? Is it just write it out in a document? Is it explaining in a certain style or is it just however is natural to the person?\n\nGustav Söderström (01:08:20):\nI used to write everything and then write and rewrite and make it more and more condensed. So that worked for me. I don't write as much anymore. Now, I tend to walk and talk in my head myself. What I actually do is I ... And I found this different for different people and a lot of people want to bounce something with someone else, that's how they think. You repeat the same thing again and again and you get some feedback on it. And so I used to write a lot. I sometimes do when it's an idea I want to understand better. And at some point in my life, I would love to write something real like a book or something. But what I do increasingly now is I do my one-on-ones with peers or people who report to me or something, and I just put on AirPods and do a distributed walk and talk.\n\nGustav Söderström (01:09:12):\nBoth people are walking but in different locations and you spend an hour discussing something. That has actually turned out to be very, very fruitful. So then you get the power of you're not alone so you get more brain power than your own. And I don't think there is strong evolutionary proof for this, but there's certainly indications that you're thinking better when you're walking, whether it's because you're oxygenating your brain or because it's evolutionary for some other reason, I'm not sure. But I found that walking, talking, and thinking actually even if you're not in person, just over AirPods, it's super effective. It was the pandemic that forced us. I thought we would get less creative and strategizing will suffer during the pandemic and I found the opposite. We had more of this than ever and I started thinking about why, and I think it's all of these walk and talks that we did.\n\nLenny (01:10:07):\nYou threw out there that you want to write a book someday. What do you think your book would be about?\n\nGustav Söderström (01:10:11):\nI have no idea. I have no idea. Statistically, it's probably going to be about something that I did a lot, so it has to be about something with technology or product or something. But I would love to write something fictional. That'd be a lot of fun.\n\nLenny (01:10:26):\nOh, boy. I'll pre-order as soon as that's up. Another concept I wanted to touch on that another PM suggested, which is he called it the P in the pants analogy. Does that ring a bell? And is that interesting to talk about?\n\nGustav Söderström (01:10:40):\nI don't know exactly which occasion this person is referring to, but I know I've used that analogy a few times.\n\nLenny (01:10:49):\nOkay. Promising.\n\nGustav Söderström (01:10:50):\nI don't know if it's like a Swedish analogy because I thought it was more widely known. But the idea is that you do something ... So the saying is that's like peeing in your pants in cold weather. It feels really warm and nice to begin with. And then after a while, you start to regret it. It's about being short term, basically. So now I just say that's like peeing in the pants inside because people know what I mean. It's a short-term thing.\n\nLenny (01:11:21):\nThat's a hilarious way of communicating that idea. Must be a Swedish thing.\n\nGustav Söderström (01:11:25):\nYes, I think Swedish people do it for some reason, apparently others don't.\n\nLenny (01:11:30):\nMaybe because it's cold a lot of times of the year.\n\nGustav Söderström (01:11:33):\nYes. That's probably it. This is a saying in cold climate. In the warm, it doesn't help. No one understands what you mean.\n\nLenny (01:11:39):\nSpeaking of Sweden, do you watch Succession?\n\nGustav Söderström (01:11:42):\nYes, I do.\n\nLenny (01:11:43):\nOkay. So Sweden's become a big part of the show, specifically the company trying to ... I guess I don't want to spoil, but there's a character that's really important. Yes, exactly. That is Swedish. And so I'm curious just what do you think of the way they portray the Swedish culture and Swedish business dealings?\n\nGustav Söderström (01:11:59):\nIt's super fun to see this as a Sweden. And I guess, first and foremost, like anyone or any person or any country that gets represented by super tall, well-built, great looking Alexander Skarsgård should probably be pretty happy. So that's good. Then I think there's this episode where they are in Norway, without giving away too much.\n\nLenny (01:12:25):\nYep.\n\nGustav Söderström (01:12:26):\nThere are elements that are authentic. There's a lot of, I think, paid brand positioning from a Swedish brand named Fjällräven, which I think means arctic fox, which is actually a very popular outdoor brand in Sweden. So that's authentic. The sauna things and so forth are authentic. So it's real, but it's exaggerated. Actually, the thing that isn't very authentic is his negotiation style. Swedish people tend to be serious, cautious, and this guy's more of a player. So he's not the typical Swedish businessman from a negotiation tactic point of view, I think.\n\nLenny (01:13:11):\nYeah, it doesn't make me think of the way you described it where in Sweden, people sit in a circle and no one's in the center.\n\nGustav Söderström (01:13:15):\nNo, exactly. He's very much in the center.\n\nLenny (01:13:19):\nAnd then when people go saunas, there are just like a chant, sauna, sauna [inaudible 01:13:23].\n\nGustav Söderström (01:13:23):\nExactly.\n\nLenny (01:13:24):\nThe last episode.\n\nGustav Söderström (01:13:25):\nIt's a great show. I love it.\n\nLenny (01:13:26):\nI love it. This season is insane. I'm so curious where it all goes. Maybe just the last question before very exciting lightning round. Spotify is, at this point, the biggest podcasting platform for me specifically and I think globally, and I love using it. It works great. I'm curious just what's next for Spotify and specifically Spotify podcasting.\n\nGustav Söderström (01:13:48):\nThere are two sides to it. It's for Spotify creators and for Spotify listeners. For Spotify creators, there are two things. One is, and this is what we talked about at Stream On, we talked about it also for music discovery, but it's the same problem and even harder for podcast. So we're still focused very heavily on helping podcast creators find more audience. This is ... Like I said, it's even a bigger problem to break out of your habits and your bubbles in podcasting. Such a big investment to find a new podcast. And so that is something, I think, we could and should do really well. So we keep investing a lot there. And as I said, you'll see more as we roll up more features now.\n\nGustav Söderström (01:14:37):\nThe other big need for creators is monetization and you can monetize today in many ways with DEI and Spotify SEI and so forth. But we're working hard to expand that and make it better because the industry is starting to mature and I think this is one of the biggest needs and the biggest things we could do for creators to help them monetize better, actually both free and paid. We also have paid podcast. So that's on the creator side.\n\nGustav Söderström (01:15:07):\nOn the consumer side, I don't want to share too much. We've shown that we're investing a lot in discovery. I want to keep some secrets for when they roll out, but we are investing a lot in the user expense itself. I think it's far from optimal yet what it could be. One thing that I can share that we're investing a lot in is just the ubiquity and playback across different devices and in cars and all these things that we've done well for music. But I think the listening experience can get a lot more seamless. I think search can get better. The data about podcasts and ... Well, I don't want to say too much, but looking at AI and generative technology, there is a lot that can be done.\n\nLenny (01:15:52):\nAll right. Well, I'll take what I can get. With that, we've reached our very exciting lightning round. I've got six questions for you, Gustav. Are you ready?\n\nGustav Söderström (01:16:01):\nI think I am. Let's do it.\n\nLenny (01:16:03):\nOkay, we'll find out. What are two or three books that you've recommended most to other people?\n\nGustav Söderström (01:16:08):\nOkay. This is why I try to squeeze in seven into two and three. So if we start on product, I think it's well known, but one that I would recommend product people to read is 7 Powers by Hamilton Helmer, and Netflix has used a lot. We use a lot. It's just if you're starting out, it's great to have a strategy framework. No strategy framework is right, but having one is better than none.\n\nGustav Söderström (01:16:31):\nAnother in the space of mental models and frameworks, I think, is The Complete Investor by Charlie Munger. So, yes, it's about investment, but really it's a bunch of mental models that he uses. And I think the key takeaway is you have a problem, you should always apply three different models to it because what models do is they simplify and reduce dimensionality. The world has probably infinite dimensions and they reduces to maybe three or four. And the risk with that is you happen to get rid of a really important dimension, maybe pandemic diseases or something. But if you use three models that have different dimensions and was reduced in different ways, statistically, and it comes to the same conclusion, even the second model you apply vastly increases your chances that you're right. So that was a good book to read.\n\nGustav Söderström (01:17:24):\nThen I think if we go outside of product, I'm very interested in just science and mathematics. So a few quick ones. The Mystery of the Aleph, an amazing book. Something Deeply Hidden by Sean Carroll on the interpretation of quantum mechanics. Helgoland by Carlo Rovelli on the relational interpretation of quantum mechanics. The Beginning of Infinity and The Fabric of Reality by David Deutch. The Case Against Reality by Donald Hoffman on the evolution versus truth and that evolution doesn't optimize for seeing the truth, just for fitness. Gödel's Proof, I think, is an amazing book on his incompleteness theorem, that in any axiomatic systems, there will be true statements that can never be proven, which is a weird thing to think about. And then maybe one of my favorites is The Demon in the Machine by Paul Davies that, I think, is lesser known on how information is really just entropy and this concept of information engines, that you can power something by just information and exhaust is also information. That was not a quick list.\n\nLenny (01:18:39):\nNo, I was just going to say you've set the record for the most number of books, but it also shows how you've become so insightful and wise just reading books like these. And so I think if people are looking to get to a place that you're at now, I think there's the lesson.\n\nGustav Söderström (01:18:55):\nI'll keep the artist much shorter, I promise.\n\nLenny (01:18:57):\nIt's all good. We got time. Okay, next question. What's a favorite recent movie or TV show?\n\nGustav Söderström (01:19:03):\nSo we talked about Succession and it is a recent favorite. So I'll just frivolously take something that isn't recent but is an absolute favorite, which is Halt and Catch Fire, which I think is on FX. Amazing show. If you ever worked in technology, kind of starts out in the Silicon Prairie in the '80s and follows up to present day. Amazing show.\n\nLenny (01:19:24):\nHalt and Catch Fire. Yeah, I watched some of it. I actually fell off of it, but it's a good reminder to go check it out.\n\nGustav Söderström (01:19:29):\nGot to go back.\n\nLenny (01:19:30):\nI'm going to go back. What's a favorite recent interview question you like to ask?\n\nGustav Söderström (01:19:34):\nI don't ask it, but my favorite question is Lex Fridman's small ending question that is usually something like, so what's the meaning of it all? I like that. It's a tough question to get.\n\nLenny (01:19:46):\nI'm so tempted to ask you, but-\n\nGustav Söderström (01:19:48):\nNo, don't.\n\nLenny (01:19:50):\nOkay. Let's move on. That'll be another ... That'll be our second take at this.\n\nGustav Söderström (01:19:53):\nYes.\n\nLenny (01:19:55):\nWhat are some favorite products you've recently discovered that you love?\n\nGustav Söderström (01:19:58):\nThe obvious one is ChatGPT GPT-4 and just playing around with that, trying to create bots for yourself that do different things for you and so forth. But I don't think that's probably true for everyone. The other really favorite is something you've written about and talked about, which is Duolingo, which I think is both very impressive from a product point of view, the execution and what they've done. It is also insanely used in my family. We have a family account and everyone is using it and competing every day. So I'm both impressed by the product and I also use the product quite a lot.\n\nLenny (01:20:35):\nWhat languages are folks learning within your family?\n\nGustav Söderström (01:20:38):\nIn my family, it's Spanish right now.\n\nLenny (01:20:41):\nHow's it going?\n\nGustav Söderström (01:20:41):\nBien.\n\nLenny (01:20:44):\nYou get a gold star.\n\nGustav Söderström (01:20:47):\nI only have a few thousand XP. I'm not that good yet.\n\nLenny (01:20:51):\nNo, I don't know if that's good. That sounds pretty good. Next question, what's something relatively minor you've changed in your product development process that's had a tremendous impact on your team's ability to execute?\n\nGustav Söderström (01:21:01):\nI'm not sure I've done anything minor that had a tremendous impact. Usually, it takes something bigger to get a big impact. I think maybe one thing that I've tried to do back to clarity and so forth is this thing I mentioned about I'm trying to push a lot for what I call Socratic debate, where the idea is obviously that the best idea wins, not the most senior idea and so forth. And trying to push for this notion of having people explain themselves, not saying I think there's something there or have a feeling or something like that. And apparently, as you said, that has had some impact because people apparently say that about me. So that's probably the biggest thing.\n\nLenny (01:21:53):\nFinal question, what is one fun ritual of the Spotify product team, and is it saunas?\n\nGustav Söderström (01:21:59):\nSo Spotify is so big now that it's quite local actually, different parts of Spotify, different product rituals. I accidentally created one ritual many years ago, maybe 12 years ago, when we talked about which phase a product is in. And it was ... We needed some definition. So I think off the cuff, I said, \"Well, it's four phases.\" It's think it, build it, ship it, tweak it.\" And then the think it phase, it should be cheap, not a lot of money spent. In the build it phase, you're going to start spending a lot of money. So then you must have reduced the risk in the think it phase that you're right. And then you have the ship it phase and then you go over and tweak it. And it was something that wasn't that thought through, but it's funny because I still hear it sometimes even from other companies like, \"Oh, we're in the think it phase,\" or \"We're in the tweak it phase.\" So it stuck. I don't know if it's very good, but it's stuck.\n\nLenny (01:22:57):\nIt is catchy. I think anything getting stuck in people's head is a success. Gustav, thank you so much for being here. We are two for two for Swedish people. Gustaf, with an F, Alströmer was on the podcast.\n\nGustav Söderström (01:23:10):\nWho is also an amazing person.\n\nLenny (01:23:12):\nAlso an amazing person. I feel very jealous of people that get to work with you and for you. Thank you again for being here. Two final questions, where can folks find you online if they want to learn more, maybe reach out, ask some questions.\n\nGustav Söderström (01:23:23):\n[inaudible 01:23:23] @GustavS.\n\nLenny (01:23:24):\nOkay. Say it again\n\nGustav Söderström (01:23:28):\n@GustavS.\n\nLenny (01:23:29):\nAwesome. And then final question is just how can listeners be useful to you?\n\nGustav Söderström (01:23:33):\nJust reach out. I do read feedback and I try to remove the angry comments and understand what they're actually thinking and why they're upset or what's not working.\n\nLenny (01:23:44):\nAnd then the reaching out, would you recommend an angry tweet at you or more of a email to that email address you shared?\n\nGustav Söderström (01:23:50):\nWell, the @GustavS is the Twitter handle, so just tweet at me.\n\nLenny (01:23:54):\nOkay.\n\nGustav Söderström (01:23:56):\nYou can be nice as well.\n\nLenny (01:23:57):\nOkay.\n\nGustav Söderström (01:23:57):\nIt's okay.\n\nLenny (01:23:58):\nAmazing. Gustav, thank you so much for being here.\n\nGustav Söderström (01:24:01):\nThank you for having me, Lenny. It's been a pleasure.\n\nLenny (01:24:03):\nBye, everyone.\n\nLenny (01:24:05):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcast, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "Gustav Söderström (00:00:00):\n互联网始于策展（curation），通常是用户策展。所以你会把一些好的东西，比如人物、书籍或音乐，进行数字化，然后放到网上，再让用户去策展。这就像是你的Facebook、Spotify等等。之后，世界从策展转向了推荐（recommendation），不再由人来完成这项工作，而是由算法来做。这是一个巨大的转变，要求我们和其他公司重新思考整个用户体验，有时甚至包括商业模式。我认为我们现在正在进入的阶段是，我们正从策展、推荐走向生成（generation）。我怀疑这将是一个同样巨大的转变，最终你将不得不重新思考你的产品。我们必须重新思考在推荐优先时代的用户界面和体验。那么，在生成时代（generative era）这意味着什么呢？目前没有人真正知道。\n\nLenny (00:00:47):\n欢迎收听Lenny的播客，在这里我采访世界级的产品负责人和增长专家，学习他们构建和发展当今最成功产品的宝贵经验。今天，我的嘉宾是Gustav Söderström。Gustav是一位产品传奇人物，他现在是Spotify的联席总裁（co-president）、首席产品官（chief product officer）和首席技术官（chief technology officer），负责Spotify的全球产品和技术战略，并管理公司的产品设计、数据和工程团队。自从我开播这个播客以来，Gustav就一直在我的梦想嘉宾名单上，我很高兴我们能请到他。\n\nLenny (00:01:19):\n在我们的对话中，我们将深入探讨Gustav在进行重大押注（big bets）方面的经验以及当这些押注未能成功时该如何应对，Spotify是如何从“小队”（squads）模式转向现在的团队结构的，人工智能（AI）如何已经影响了他们的产品，以及人工智能生成音乐的未来。此外，我们还会探讨为什么所有优秀的产品都需要耍一些“魔术”，《继承之战》（Succession）在多大程度上准确地反映了瑞典商业文化，以及他关于“尿裤子”的搞笑类比。在听完赞助商的简短介绍后，请尽情收听这期Gustav Söderström的节目。\n\nLenny (00:01:51):\n本期节目由Microsoft Clarity赞助，这是一个免费易用的工具，可以捕捉真实用户如何使用你的网站。你可以观看实时会话回放（live session replays），了解用户在哪里能顺利通过你的流程，又在哪里遇到了困难。你可以查看即时热力图（instant heat maps），了解用户与你页面哪些部分互动，哪些内容被忽略。你还可以通过诸如愤怒点击（rage clicks）和无效点击（dead clicks）等非常酷的“挫败感指标”（frustration metrics）来精确找出困扰用户的问题。如果你收听这个播客，你就会知道我们经常谈论了解用户的重要性，通过观察用户如何真实地体验你的产品，你可以发现产品机会、实现转化胜利，并找出你想象中用户使用产品方式与实际使用方式之间的巨大差距。\n\nLenny (00:02:33):\nMicrosoft Clarity通过一套简单却功能极其强大的功能使这一切成为可能。你会惊讶于Clarity的易用性，而且它将永远完全免费。你永远不会遇到流量限制，也不会被迫升级到付费版本。它也适用于应用程序（apps）和网站。停止猜测，获取Clarity。请访问clarity.microsoft.com了解Clarity。\n\nLenny (00:02:59):\n本期节目由Eppo赞助。Eppo是一个由Airbnb校友为现代增长团队（modern growth teams）打造的下一代A/B测试平台。像DraftKings、Zapier、ClickUp、Twitch和Cameo这样的公司都依赖Eppo来支持他们的实验。无论你在哪里工作，运行实验都变得越来越重要，但目前还没有能与现代增长团队技术栈（modern grow team stack）集成的商业工具。这导致浪费时间构建内部工具，或者试图通过笨重的营销工具来运行自己的实验。当我在Airbnb时，我最喜欢在那里工作的一点是我们的实验平台，我可以在那里按设备类型、国家、用户阶段（user stage）对数据进行切片和分析（slice and dice data）。Eppo能做到这一切甚至更多，它能快速提供结果，避免冗长的分析周期，并帮助你轻松找到你发现的任何问题的根本原因。\n\nLenny (00:03:44):\nEppo让你超越基本的点击率指标（click-through metrics），转而使用你的“北极星指标”（north star metrics），例如激活（activation）、留存（retention）、订阅（subscription）和支付（payments）。Eppo支持前端（front end）、后端（backend）、电子邮件营销（email marketing），甚至机器学习（machine learning）主张的测试。请访问getE-P-P-O.com了解Eppo。那就是geteppo.com。并将你的实验速度提高10倍。\n\nLenny (00:04:08):\nGustav，欢迎来到播客。\n\nGustav Söderström (00:04:11):\n谢谢你邀请我，Lenny。很高兴来到这里。\n\nLenny (00:04:13):\n很高兴能邀请你来。截至目前，你已经在Spotify工作了超过14年，这在科技界是难得的壮举，而且你在Spotify期间担任过许多不同的职位。你能先简单介绍一下你在Spotify多年来的各种职位和所做的工作吗？然后，你现在在忙些什么？你现在负责什么？\n\nGustav Söderström (00:04:33):\n我是在2009年初、2008年末加入Spotify的。当时我的工作，我之前是一名创业者，在那个时期——非常非常早期的功能手机（feature phone）和智能手机（smartphone）领域——创办了一些自己的公司。所以我在手机这方面有很多知识。我曾把公司卖给了雅虎（Yahoo），那是在移动领域。我在那里工作了一段时间。我回到瑞典后，通过一位共同的朋友认识了Daniel Ek，他是Spotify的首席执行官（CEO）和联合创始人。他们当时已经开发出了桌面产品，免费流媒体桌面产品，它非常棒，我可以试用，但他们需要有人来弄清楚移动端该怎么做。因为我曾是那个领域的创业者，所以我得到了那份工作。\n\nGustav Söderström (00:05:20):\n所以我的工作是负责Spotify的移动业务，并弄清楚移动产品会是什么样子，这是一个挑战，因为很明显，Spotify桌面版是一个免费的点播流媒体应用程序（on-demand streaming application），而在当时，特别是在边缘网络（edge networks）下，你根本无法实时流媒体播放。性能达不到要求，而且你也不能通过广告模式（ads model）来支持它。所以这是一项产品和商业模式的创新，非常有趣。我就是这样开始的。几年后，我负责了Spotify所有的产品开发。又过了几年，我实际上也承担了Spotify的技术责任，也就是首席技术官（CTO）的角色。最近，我的正式头衔是Spotify的联席总裁（co-president），与Alex Nordstrom共同担任。我们每人管理公司的一半。我负责产品和技术方面，他负责业务和内容方面。这就是超快速的版本介绍。\n\nGustav Söderström (00:06:20):\n除了承担更多责任，接手技术部门之外，我的工作头衔一直没变。我一直向Daniel汇报，但因为Spotify发展得太快，每六到十二个月，就感觉像是在一家新公司开始工作一样。首先，它是一个瑞典北欧的挑战，然后是欧洲的挑战，接着是进入美国市场，再后来我们成为了一家上市公司。所以，尽管我的头衔和角色大致相同，但实际上就像是换了很多份工作一样。\n\nLenny (00:06:55):\n你的故事让我想起了那句经典的告诫：小心你擅长什么，因为你最终会承担越来越多的责任。显然，这些年来你被赋予了越来越多的责任，所以很明显事情进展顺利，你也做得很好。\n\nLenny (00:07:08):\n稍微换个话题。所以你现在在我的播客上。你实际上有自己的播客，是一个关于Spotify产品故事的限定系列，我听了并且很喜欢，实时听到你的声音感觉很超现实（surreal），因为我最近一直在听那个播客为这次对话做准备。两个问题：是什么让你决定推出自己的播客，要知道你有一份全职工作，而且事情很多，据我所知你的播客制作水准非常高？第二，从那次经历中，就你最终构建的产品以及对播客创作者的同理心（empathizing）而言，你学到了什么？\n\nGustav Söderström (00:07:41):\n我做这件事有很多不同的原因。其中一个，我认为不小的一个原因是，像你一样，我热爱写作，我内心深处有一个秘密的创作者梦想。很久以前我常写博客文章，我在内部也写了很多东西。在像这样的公司工作时，你不能在外部写太多东西。\n\nLenny (00:08:01):\n是的。\n\nGustav Söderström (00:08:02):\n但我喜欢写作、演讲和演示。所以肯定有这方面的原因。然后，从产品的角度来看，很大一部分原因是为了与我们主要的用户群体之一，即播客创作者（podcast creator）产生同理心。我很遗憾不是一个优秀的音乐家。我尝试演奏乐器等等，但我没有任何唱片。我唱歌不太好。但我决定制作一个播客，这让我学到了很多关于作为创作者的感受，以及如何制作不同风格的播客。\n\nGustav Söderström (00:08:33):\n例如，我们想制作一个带有音乐的、制作成本更高的播客，然后你立刻就会遇到一堆问题，尽管Spotify实际上很有能力解决这些问题，但从版权（rights perspective）的角度来看，在播客中加入音乐仍然非常困难。所以你了解了播客制作者们遇到的所有这些问题，你也能更好地解决它们。但最大的好处和做这个公开播客的真正原因是，我实际上通过一个“技巧”（hack）制作了一个内部播客，我们可以让这个播客只对员工开放。我试图在内部弄清楚如何围绕Spotify建立更多的文化，并帮助新员工和现有员工明确我们是谁，我们犯过的错误，我们取得的成功，以及我们如何思考战略，特别是产品战略，因为我们在外部以技术、小队（squads）以及所有这些东西而闻名，而不是产品战略。\n\nGustav Söderström (00:09:36):\n因为我更喜欢讲故事而不是Google Docs，所以我决定制作一个内部播客，我去采访了Daniel的直接下属（direct reports）。比如首席营销官（CMO）、首席人力资源官（CHRO）和首席财务官（CFO）。只是问了他们很多事情。这样做的目的是让他们对员工来说更容易接近，因为我觉得听播客，即使是那些完全不认识我的人，因为我从未见过他们，我也会感觉我认识他们，我感觉我了解他们的想法，我就是更喜欢他们。所以我秘密的想法是，如果你能比通过偶尔的会议或某些全体会议（town hall）更好地了解你的领导者，那会怎么样？所以我在内部做了这件事，因为我是一个产品人，我们最终聊了很多关于产品和产品战略的话题。内部员工非常喜欢。\n\nGustav Söderström (00:10:26):\n那么下一次的问题是，如果那些甚至还没有在Spotify工作的人也能感觉像是认识Spotify的人，那会怎么样？那会很棒，因为大多数公司的大多数领导者都非常不透明，当你他们在商业报纸或其他地方看到他们时，他们看起来就像是一些不真实的超凡生物。那么如果你已经听他们说了一个小时左右的话呢？这就是大致的想法。所以，它结合了招聘工具（recruitment tool）、分享我们如何思考产品战略，以及仅仅因为我觉得这很有趣。我有机会采访了许多聪明有趣的外部和内部人士。\n\nLenny (00:11:09):\n回顾过去，它达到了你期望的效果吗？\n\nGustav Söderström (00:11:12):\n我觉得有。那个播客做得很好，不，我们没有为其进行自己的推广。我不得不像其他人一样竞争，这也让你对以下问题有了很多共情：好吧，现在你有了产品，那么用户获取（user acquisition，指如何让用户知道并使用产品）呢？你如何真正让人们去听它？所以它确实达到了我想要的效果，因为我们有一个叫做“内部活动日”（intradays，Spotify内部的一种新员工入职活动）的东西，尤其是在过去几年，我们招聘了很多人，我们会安排大家飞到斯德哥尔摩参加一个入职培训（onboarding session），了解Spotify。领导层会在台上，谈论他们的工作、部门、战略等等。人们经常会过来告诉我，“哦，我听了这期或那期播客，这是我加入公司的至少一个主要原因，有时甚至是唯一原因。”所以，这只是轶事，但至少有几十人说过这样的话。所以这似乎是有效的。\n\nLenny (00:12:12):\n那真有意思。再说一遍，这在播客中已经出现过几次了，那就是内容在招聘、文化建设（culture building）等各种方面所发挥的力量。听起来最初的目标仅仅是在内部建立这种“诊所文化”（clinic culture）和策略。\n\nGustav Söderström (00:12:24):\n那确实是最初的目标，让高级领导层（senior leadership）更平易近人（approachable），缩短距离，然后以一种有趣的方式分享更多思考，而不是仅仅通过人们最终不读的文档（docs）。\n\nLenny (00:12:38):\n我喜欢这一点。所以正如我所说，我一直在听它，真正有趣的是，我记得第四集实际上全是关于人工智能（AI）的，我想那是你们第一次尝试在Spotify内部利用机器学习（machine learning）和人工智能。我认为这促成了Discover Weekly（Spotify的个性化推荐歌单功能）和其他一些工具的诞生。那是多年前的事了。现在再听起来很有趣，因为人工智能又一次成为了一个大话题。所以我很好奇，从产品团队的角度来看，你具体会建议产品经理（product managers）和产品团队如何在其产品思维以及日常工作中思考人工智能？\n\nGustav Söderström (00:13:12):\n我可以在这里举几个例子，我不知道我们是否比其他人更精深（sophisticated），但我们至少进行传统机器学习（traditional machine learning）已经很长时间了。我想在播客中，我谈到了互联网的发展阶段。思考互联网的一种方式是，它始于用户精选（curation）。所以你获取一些好的东西，比如人物、书籍或音乐，你将其数字化（digitize）并放到网上，然后你让用户去精选它。那就是你的Facebook、Spotify等等。过了一段时间后，世界从精选转向了推荐（recommendation），不再是人们来做这项工作，而是有了算法（algorithms）。这是一个巨大的变化，它要求我们和其他人彻底重新思考整个用户体验（user experience），有时甚至包括商业模式（business model）。\n\nGustav Söderström (00:14:04):\n我认为我们现在正在进入的阶段，是从精选、推荐走向生成（generation）。我怀疑这将是一个同样巨大的转变，最终你将不得不重新思考你的产品。这是一个视角（lens）。所以我倾向于告诉我的团队，即使这都是机器学习，我也会让他们把它看作是完全不同的东西。推荐时代（recommendation era，口误，应为“时代”而非“错误”）是一种机器学习。生成时代（generation era，口误，应为“时代”而非“错误”）是另一种类型，所以不要把它仅仅看作是更多相同的东西，而要把它看作是完全新的东西。我们学到了……嗯，几件事。如果你看看大语言模型（large language models）和融合模型（fusion models）等新时代，它们有两种类型的应用。正如我所说，在推荐时代，我们必须重新思考用户界面（user interface）和以推荐为先的体验。\n\nGustav Söderström (00:14:57):\n那么，这在生成领域（generative area）意味着什么呢？目前还没有人真正知道。像往常一样，有很多迭代改进（iterative improvements）。所以我们使用这些大语言模型来改进我们的推荐。你可以拥有更大的向量（vectors），它们可以包含更多的文化知识。你可以用它来对还没有人听过的播客进行安全分类（safety classification），等等。所以有很多明显的改进，我们正在做这些。但到目前为止，我们只真正做了一个严格定义上的生成式产品（generative product），也就是没有生成式人工智能（generative AI）就不可能存在的产品，那就是AI DJ（人工智能DJ）。这是一个我们思考了很久的概念。AI DJ就是你按下一个按钮，一个数字化人物（digitized person），有一个真实的人叫X，现在X被数字化了。所以他现在是一个AI，他会上来和你谈论你喜欢的音乐并推荐音乐，你可以听。如果你不喜欢，你可以再次呼叫他，他会说：“好的，现在，让我们听一些也许是几年前的歌曲吧，”或者“这里有一些昨天在《最后生还者》（The Last of Us）剧集里流行的新歌，或者类似的东西。”\n\nGustav Söderström (00:16:10):\n这个产品如果没有生成式人工智能就不可能存在，无论是生成声音还是生成声音所说内容的文本。因此，你可以以五亿人的规模拥有个性化的声音。所以我们有一个我们已经看到了很多年的使用场景（use case）。有时人们称之为“电台使用场景”（radio use case）。我们在内部称之为“零意图使用场景”（zero intent use case），即当你根本不知道自己想听什么的时候。\n\nGustav Söderström (00:16:40):\nSpotify以前在这方面做得不好。Spotify在至少大致知道你想做什么的使用场景时表现不错，比如是健身（workout）还是晚餐。我们有很多选择来应对所有这些情况。但如果你真的完全不知道，打开Spotify然后盯着它看就会很难。人们过去常常充满向往地说，这是电台唯一擅长的事情。老实说，电台其实很糟糕。我的意思是，它根本不为你个性化。它不是按需（on demand）的。你会在中间插入，实际上在很多方面都很糟糕。但人们仍然常常说它有一些好的地方。我认为那个好的地方在于你有一个旋钮（knob），你可以随意切换情境（contexts）。就像，“不，无聊，无聊，无聊，无聊，好吧，这个不错。”\n\nGustav Söderström (00:17:23):\nSpotify从未有过这种模式，即“我不知道我想要什么，但我想循环浏览（cycle through things）直到找到我喜欢的东西”。我认为有了AI DJ，我们实际上解决了这个使用场景。所以X会出现说：“我将为你推荐一些你可以听的东西。”如果你喜欢，你可以继续听，但如果你不喜欢，你再把他叫回来，然后换一个频道。由于某种原因，我们尝试了很长时间来解决这个问题，但只是随机播放一首歌曲，没有任何上下文说明你为什么要听这首歌，这种方式从未奏效。所以这是我们首次涉足（foray）一个以前不可能存在的产品。我认为对于你关于原则（principles）的问题，我们学到了一些非常独特的原则。\n\nGustav Söderström (00:18:09):\n我非常喜欢的一个原则，它根本不是我的原则，我认为它直接来自克里斯·迪克森（Chris Dixon），那就是容错用户界面（fault-tolerant user interfaces，指即使系统或模型不完美，用户界面也能处理错误并提供好的体验）的原则。在早期机器学习时代，当我们说要从精选转向推荐时，我看到了无数次设计草图（design sketch），上面只有一个大大的播放按钮（play button），因为显然那是你能做的最简单的用户界面。但如果你不了解你的机器学习的表现，你就无法为其设计。如果你要有一个单一的播放按钮，你的机器学习的质量需要达到字面上的100%或零预测误差（prediction error），而这从来都不是事实。所以假设你有五分之一的命中率，四分之五的东西是做不好的，那么你需要一个UI（用户界面），可能至少同时在屏幕上显示五样东西。这样你就有五分之一的相关（relevant）内容在屏幕上。\n\nGustav Söderström (00:19:03):\n所以你需要了解你的机器学习的表现来为其进行设计。它需要容错，而且通常你需要为用户提供一个备用方案（escape hatch）。所以你做出了一个预测。但如果你错了，用户需要能够非常容易地说：“不，你错了，我想去我的音乐库或这个或那个。”所以我们有这样一个原则：拥有容错用户界面，以及与你的算法当前表现相符的用户界面。我认为这对于生成式机器学习（generative machine learning）也同样适用。我认为一个非常清晰的例子实际上是Midjourney（一个AI图像生成工具）。如果你想想早期Discord频道（Discord channel）内的Midjourney用户界面，实际上生成一张图片非常非常慢。\n\nGustav Söderström (00:19:48):\n生成高质量图像需要很长时间，他们本可以构建一个“银色按钮”之类的东西，你输入一个提示词（prompt），等待几分钟，然后得到一张图片，但我认为四次中会有一次是糟糕的。所以你可能会四次中有三次感到失望，每次一分钟，所以四分钟后，你会觉得“这真是一个垃圾产品”。他们所做的是，他们非常迅速地同时生成了四张低分辨率图像（low-res images），你可以说：“所以很明显，他们的表现可能是一次能出四张，这就是为什么他们显示四张而不是六张。”所以四张中有一张通常是相当不错的。你点击那一张，然后要么继续迭代（iterate），要么将其放大（scale it up）。所以这也是一个例子，我认为人们在构建UI时理解了生成式人工智能的表现。所以这是我会被启发的地方。\n\nGustav Söderström (00:20:37):\n对于AI DJ来说，另一个原则是尽量避免这种仅仅想炫耀技术（show off the technology）的冲动（urge），然后让这个声音喋喋不休。你必须记住，人们是为了音乐才来到这里的。所以AI DJ团队的原则，顺便说一句，这实际上是一个自下而上（bottoms-up product，指产品创意和开发主要来自基层团队，而非高层指令）的产品，它需要很多支持。我们实际上收购（acquired big companies）了一些大公司才能构建它。但这个想法是由基层团队自下而上构建的。所以那里的原则实际上是尽可能少做，然后让开。我认为这非常有帮助。它不会告诉你天气怎么样，新闻发生了什么，也不会滔滔不绝地谈论某个乐队。它只是试图让你听到音乐，我认为这就是它奏效的原因，因为它对我们来说非常有效。\n\nLenny (00:21:24):\n我喜欢推荐和生成之间的这种区别（distinction）。这引出了一个问题：我猜你一定看到了一个趋势，就是人们使用艺术家作品目录（artists catalog）自动生成音乐（autogenerating music）。大约一两周前，Drake和The Weeknd事件（指利用AI生成模仿他们风格音乐的事件）就发生了。你认为这最终会走向何方？你认为艺术家们将如何适应这个音乐可以被自动生成的世界？这个播放按钮所生成的一切都是AI生成的，而不仅仅是歌曲之间的DJ。\n\nGustav Söderström (00:21:53):\n首先，一个重要提醒，这都还处于非常早期的阶段。没有人知道这一切将如何演变、法律环境如何等等，但我认为它会产生很大的影响。我认为我们可以讨论两件事：一是它能为音乐带来什么；二是合适的版权情况，以及版权所有者是否得到补偿等等。所以我们先孤立地讨论第一件事。我想一个有趣的例子是，在我成长的时候，Avicii 横空出世。这很有意思，因为Avicii 在现有音乐产业中并不被认为是一个真正的艺术家，因为他不会真正演奏乐器，也不会唱歌，他只是坐在电脑前，用一个 DAW（数字音频工作站）工作。所以它不被认为是真正的音乐。而现在，我想我们所有人都认为那是非常真实的音乐，他拥有巨大的真实音乐才能。\n\nGustav Söderström (00:22:51):\n所以我想，现在我们可能正处于一个阶段，人们会说这不是真正的音乐，它有点虚假。我认为思考这些扩散模型（diffusion models）的方式，如果它们有朝一日足够擅长生成音乐的话，可能就像一种乐器。它只是一种更强大的乐器，我们可能会看到一种新型的创作者，他们以前不擅长任何乐器，无法组建一支完整的管弦乐队来做他们脑海中的事情，而现在他们可以生成非常新颖的东西。顺便说一句，我也认为，AI音乐和真实音乐之间这种区分并不存在。毫无疑问，非常有才华的真实音乐家正在使用AI来提升自己，并帮助创造新想法。所以这种区分实际上并不存在。一切都将是AI。问题是所占的比例是多少，这使得问题变得更加复杂，因为你不能讨论它是否应该存在。\n\nGustav Söderström (00:23:50):\n你必须讨论应该允许多少比例，以及谁可以使用它。但我认为，看待它的方式可能就是把它当作一种乐器，它可以帮助创造大量的艺术作品。这对于你们——可能经常使用这些东西的人——来说，应该不是什么新闻，但我想，如果你不使用这些生成模型（generative models），可能会有一种观念，认为你只要告诉它创作一首热门歌曲，你就能得到它。但它不是这样运作的。实际上，这些模型所做的，是因为它们听过大量音乐，所以它们非常擅长做一些听起来与现有音乐非常相似的事情。真正做到原创是非常困难的。从一个角度来看，现在创作更多通用的音乐变得更容易了，但真正独特将比以往任何时候都更加困难。\n\nGustav Söderström (00:24:39):\n所以我仍然认为，创造真正独特的东西需要巨大的技巧。我希望的是，DAW和那次技术飞跃所带来的结果是，出现了一个全新的流派，比如EDM（电子舞曲），你无法真正用管弦乐队或现场表演来制作它。也许我们将看到这些技术带来全新的音乐风格。我认为那会非常令人兴奋。所以这是积极的一面，但接着你还有版权问题，对此我深表理解。Spotify之前也遇到过这种情况。我们经历过类似的另一次技术变革，那就是向音乐在线下载、盗版和点对点（P2P）技术的转变。所以，首先，点对点技术带来了巨大的技术变革，这让消费者感到兴奋。越来越多的消费者开始听更多的音乐。我想现在我们正处于生成式AI（generative AI）的这个阶段。\n\nGustav Söderström (00:25:31):\n这是一项新技术，但它也需要一个新的商业模式，才能让创作者和整个行业真正参与并从中受益。当然，这样说可能有点自私，因为我们是创新这种商业模式的重要参与者。但我仍然认为这是必要的，我希望我和我们能成为其中一部分。所以我想我们已经看到了第一部分，即技术变革，这里可能会有很多讨论和混乱，对此我深表理解，但我认为我们还没有看到第二部分。什么模型能让它成为一种优势？实际上，在盗版之后发生的是，音乐产业变得比以往任何时候都更加庞大，不仅仅是和以前一样大，而是比以往任何时候都大。我认为这项技术也可能带来同样的结果。但我们才刚刚开始。\n\nLenny (00:26:20):\n同样地，您还教授了一个理念，即所有真正伟大的产品都必须变出一些魔术。这在您的播客中经常出现，我想您在其他地方也提到过，想到您在这里谈论的所有内容，感觉上，一切都将像魔术一样，因为AI融入其中。\n\nGustav Söderström (00:26:38):\n我想当我们做AI DJ时，我们做了它的小型版本。当人们第一次听到它时，我们可以在用户测试中看到他们的反应，他们会想……所以那里的魔术是，他们怎么能录下这个人说这么多不同的话，因为它在谈论我的音乐。所以魔术是，显然，它不是录音，而是生成的，然后这个魔术就失效了。你现在总是听到它等等，但它就是那些魔术之一。所以我仍然认为这个概念很重要，它似乎与产品病毒式传播并迅速流行起来相关。\n\nGustav Söderström (00:27:15):\n我想第一次使用DALL-E、Stable Diffusion 或 Midjourney 这样的工具时也是如此。它完全像一个魔术。当然，没有什么魔术，它只是数据和统计。但我认为，达到这一点，并迭代产品，使其达到第一次使用时感觉像魔术的程度，是非常有帮助的。这通常只是一个将性能提升到一定水平，缩小范围，删除一些东西的问题。我认为有很多微调（fine-tuning）工作，能让你跨越那条界限，从“很酷很厉害但不是魔术”变成“感觉像魔术，我不明白这怎么能做到”。\n\nLenny (00:28:00):\n是的，这让我想起了GBT（可能指GPT，即Generative Pre-trained Transformer）的推出，它最终成为历史上规模最大、增长最快的产品，它简直就是魔术的缩影。它感觉就像真正的魔法。\n\nGustav Söderström (00:28:09):\n绝对是，绝对是。对大多数人来说，它仍然非常……实际上，在很大程度上，即使对研究人员来说，它也有些魔幻。没有人能完全理解。所以我想，也许世界上还剩下一些魔术。\n\nLenny (00:28:23):\n绝对如此。我想很多人都担心不理解那里正在发生什么。转向你们Spotify构建产品的方式。Spotify以普及小队（squads）和部落（tribes）这个理念而闻名。如果我没记错的话，你们已经放弃了那种方法。\n\nGustav Söderström (00:28:39):\n是的，没错。\n\nLenny (00:28:41):\n好的。所以我很想了解一下你们为什么会转变，以及你们从那种产品构建方法中学到了什么，然后，你们现在是如何组织团队的？你们现在做些什么？\n\nGustav Söderström (00:28:51):\n这是我们早期非常关注的一点，事实证明，我们将这些东西命名为小队（squads）和章节（chapters）等等是明智之举。它并非真的……嗯，也许是刻意的品牌化，但我们创造它并非为了品牌化目的。我们创造它是因为我们认为这是一种很好的组织结构，我们需要为事物命名，而那是在早期互联网时代，你可以随意创造新词。所以它非常适合我们当时所处的阶段，而且确实帮助了我们招聘。它现在对我们来说有点像是一种负担，因为人们仍然认为我们是那样组织的，而在这种规模下，它并不是一种非常高效的组织方式，甚至如果你现在重新开始，可能也不是，因为我们学到了更多。\n\nGustav Söderström (00:29:35):\n但我认为最大的不同在于，小队（squad）这个理念最初有两层含义。它们应该小而全栈（full stack）。所以每个小队应该有大约七个人，包括前端和后端、移动开发、质量保证 (QA)、敏捷教练等等，而且理念是它们应该非常自治。这正是我们转变的地方。所以，首先，随着公司发展，以七名工程师为增量进行扩展会产生大量的管理成本（overhead）。因此，很明显，我们现在的团队往往要大得多，每个经理手下可能至少是原来的两到三倍，可能有14个人左右，而不是7个人，而且管理性职位（overhead roles）也更少。这是其一。随着你学习得更多，它看起来就更传统，并且在你规模化时也更合理。我认为我们遇到的第二个大问题是，在我加入的时候，Spotify的平均年龄是……我是最老的，那是在14年前。所以我想平均年龄可能在30岁以下，这在大多数科技公司中并不常见。\n\nGustav Söderström (00:30:46):\n我们来自瑞典，那里的文化与美国不同，我喜欢瑞典文化的很多方面，我认为我们设法保留了最好的部分，但瑞典是一种非常自下而上的自治文化。有一幅著名的图画描绘了瑞典人如何做决定。在美国，我认为它只是一个层级结构。在瑞典，它是一个圆形。在一个圆形里，没有人是中心，没有领导者等等。\n\nLenny (00:31:13):\n有意思。\n\nGustav Söderström (00:31:14):\n所以我想，从文化上讲，我们深受这种超级自治理念的启发。而且我认为自治的理念非常合理且正确，那就是我们工作，我们招聘我们能找到的最聪明的人，并且为此支付高薪。所以，如果你正在招聘聪明的人，一种思考方式是你在租用脑力（brain power）。\n\nGustav Söderström (00:31:39):\n所以，如果你租用所有这些昂贵的脑力，却不给他们独立思考的空间，那听起来就不太明智，那你就应该招聘不那么聪明的人，并降低成本什么的。所以我认为你必须给予大量的自治权，才能真正最大化你投资的价值。所以，给予人们足够的空间来尽可能发挥他们的才能和能力，这是非常合理的。但问题在于，如果你将自治权下放到组织的末端（leaves of the organization），并且如果你将其与一个非常年轻的组织结合起来，就像我们当时那样，你很有可能只会产生大量无用的努力（produce heat）。你将会有一百个小队，一百种策略，朝着一百个不同的方向前进。Spotify就曾经处于这种境地。\n\nGustav Söderström (00:32:29):\n我的意思是，尽管如此，我们确实取得了一些成就，但很难说我们在这样做时是高效的。所以我们做了几件事。团队结构更传统，团队更大，管理成本更少。我们一直在具体研究，在组织中，我们将自治权放在哪里，因为极端情况是在末端，我们曾经就是这样。另一个极端可能是在高层，比如说可能像Twitter，只有一个人做决定。两者都有问题。如果把它放在末端，你会产生大量的无用努力。如果把它放在高层，你需要一个能力很强的人，埃隆确实能力很强，但你必然会成为瓶颈。所有决定都必须经过那里。而丹尼尔（Daniel）的个性也并非是想做所有决定。\n\nGustav Söderström (00:33:19):\n他想要最大化 **throughput**（吞吐量），而不是阻碍吞吐量。所以问题是，如果它既不在最顶层也不在最底层，那你把它放在哪里？我们发现，这在我看来一点也不**contrarian**（反主流），我认为大多数公司都是如此，它位于 **VP level**（副总裁级别）左右。所以如果你有 Daniel，然后是像我这样的 **C level**（高管级别）和其他人，再往下就是 VP level。这是一个很好的组合，它不像公司里只有一个人在思考，只有 Daniel 在思考，而其他人只是执行。在公司的 VP level，有几十甚至上百人拥有很大的 **autonomy**（自主权）去思考。所以你获得了大量的思想自由，人们可以朝着不同的方向思考，但又不像有 8000 人那么多。而且这些 VP level 的人数量相当多，但他们通常也相当资深。他们拥有大量的 **pattern recognition**（模式识别能力）。\n\nGustav Söderström (00:34:16):\n所以我想这解决了，这是一个很好的……如果你把它看作一个 **optimization problem**（优化问题），这是一个很好的 **optimization space**（优化空间）。所以 Spotify 现在 VP level 的自主权水平往往很高，而在这些级别之下则较低。\n\nLenny (00:34:33):\n当你提到自主权时，那到底意味着什么？比如，播客产品的 **VP**（副总裁）对发生的事情有很多话语权，而上面的人并没有太多……我不知道上面的人参与程度有多高？我知道 Maya 是播客产品的产品 **VP**（副总裁），我相信是这样。\n\nGustav Söderström (00:34:48):\n没错。\n\nLenny (00:34:49):\n我认为她有一天会来上播客。这对她的 **autonomy**（自主权）意味着什么，实际上是怎样的？\n\nGustav Söderström (00:34:54):\n所以这意味着我会要求 Maya 定义我们在播客方面应该做什么的 **strategy**（战略），我们如何与众不同，为什么播客创作者会愿意来这里？而在另一家公司，我来制定这个战略，或者在另一家公司，Daniel 会制定这个战略。同样的……例如，**AI DJ**（人工智能 DJ）来自我们的 **personalization team**（个性化团队）。所以这是他们做出的一个大胆尝试。因此，他们拥有自主权来做出这类尝试并制定战略。**user interface**（用户界面）也是一样，我们有一个体验团队，稍后可以谈谈 **org structure**（组织结构），但我赋予了体验 **VP** 很大的自主权来定义和建议我们想做的事情。而在其他公司，例如，我可能会自己定义所有这些。\n\nLenny (00:35:45):\n再深入一点，我知道你对团队组织方式以及组织如何帮助你为特定事物进行 **optimize**（优化）有着非常强烈的看法。你对这方面有什么想法？你对组织的影响以及你正在优化的目标学到了什么？\n\nGustav Söderström (00:36:03):\n是的。所以我谈论的是一个理想化的 **spectrum**（范围），或者也许不是理想化而是夸大的 spectrum。没有任何事情是完全真实的，但你会创造极端来表达观点。所以，在一个 spectrum 上，你有像亚马逊这样的公司，它以 **two-pizza teams**（两人披萨团队，指团队规模小到两张披萨够吃）而闻名，没有 **dependencies**（依赖）。你试图最小化依赖，这样就可以并行运行。团队之间甚至在同一个项目上也会相互竞争等等。但他们可以直接接触用户。\n\nGustav Söderström (00:36:37):\n所以这里的好处是，如果你有一个想法，将其推向用户所需的时间非常短，而且这对他们很奏效。它生产了 Kindle、Alexa，它生产了许多非常新颖的东西。这里有一些有趣的缺点。其中一个让我对 Jeff Bezos 的远见卓识印象深刻的缺点是，如果团队之间相互竞争，那么 **incentives**（激励）就是隐藏你的结果，隐藏你的代码。这应该会导致一个没有 **platform leverage**（平台杠杆效应）的组织，因为没有人合作。我想他要么有这种洞察力，要么因为他看到了这一点，他必须这样做，但他以极力推行 **hard APIs**（硬性 API，指接口定义严格、不易改变）而闻名。如果你不为你的技术创建 hard APIs，你就出局了。如果你仔细想想，它必须是那样，否则没有人会这样做。\n\nLenny (00:37:32):\n而一个 **hard API**（硬性 API）本质上就是每个人都知道如何使用这个 API 并连接到这个团队进行 **interface**（接口）。\n\nGustav Söderström (00:37:38):\n没错。你必须将你的技术暴露给其他人。你必须维护这些 API，而且它们必须非常有条理，否则整个事情就会崩溃，因为每个人都应该竞争，因为没有激励。你必须在中心强制执行这一点。有趣的是，尽管理论上他们处于拥有结构化平台的最差位置，但我认为，正因为他们强制执行得如此严格，他们才创建了 **Amazon Web Services**（亚马逊网络服务，AWS），因为他们有如此严格定义的 API，由于这条规则，他们更容易将其从内部转向外部，并暴露给世界其他地方。而如果你看看像谷歌这样的公司，我认为他们在 **externalizing their APIs**（API 外部化）方面遇到了更多困难，也许是因为他们的 API 如此友好和“软”。所以他们在内部不需要那么多的 hard APIs，因为没有竞争。人们可以直接进入彼此的代码。\n\nGustav Söderström (00:38:18):\n所以这是一个有趣的 **anecdote**（趣闻轶事），但重点是你在那里会更快，但要合作会很困难。所以你会看到一些可能有点夸张的东西。有时你会看到同一页面上有来自不同团队的多个搜索框。顺便说一句，这在 Spotify 也曾发生过。你曾在“正在播放”视图中看到来自不同团队的多个 **toasters**（Toast 通知，一种短暂显示的消息提示）弹出，因为它们正在运行。当我们处于 **autonomous mode**（自主模式）时，每个人都在各自运行。然后……所以你获得了速度上的优势，但你也会带来交付你的 **org chart**（组织结构图）以及将复杂性传递给最终用户的缺点。但显然，这对亚马逊来说是正确的选择，因为他们是一家万亿美元公司。但另一方面，你也有像苹果这样的公司，他们也是一家万亿美元公司。所以显然两种模式都有效，你在 iPhone 上绝不会看到来自同一个团队的两个搜索框弹出。那是由一个接近于独立个体的事物集中组织起来的。\n\nGustav Söderström (00:39:20):\n所以他们反而处于可能是世界上最大的 **functional org**（职能型组织）中，他们做了很多。如果你想想苹果内部有什么，我的意思是，他们当然做了我们所做的一切。他们有音乐服务、播客服务、**audiobooks**（有声读物），还有无数其他服务。所以他们的问题并没有更简单。然而他们构建出来的东西感觉更像是单一开发者为单一用户构建的。所以他们是中心化的，他们有这个 **bottlenecking function**（瓶颈功能），所有事情都必须经过这个功能，并决定它如何与其他一切配合。这带来了用户体验更简单的好处，而不是将组织结构图和日益增加的复杂性暴露给用户。但它的缺点是牺牲了速度，而且没有事实依据。我听说在苹果工作的人说过：“是的，那个东西花了七年才 **to market**（投放市场）。”因为你必须在 **in the pipeline**（在筹备中，在流程中）等待。\n\nGustav Söderström (00:40:17):\n所以你有这些极端情况。我认为最有趣的例子，值得思考的是，当你双击 iPhone 的电源按钮时，**Apple Pay**（苹果支付）会弹出来。那个决定是怎么发生的？你可以想象，所有服务团队都希望在双击那个按钮时弹出。所以必须有人决定，是音乐应该弹出，还是支付应该弹出，还是其他什么应该弹出？所以他们那里有不同的结构。在这个 **centralized versus decentralized**（中心化与去中心化）的 spectrum 上，由于我们的 **strategy**（战略），我们是一个单一应用程序，试图添加或者说我们已经添加了多种类型的内容，这些内容在 **backend**（后端）实际上具有非常不同的 **business models**（商业模式），包括 **rev shares**（收入分成）和 **royalties**（版税）以及图书交易等，都融入到单一的用户体验中。这就是我们的战略。我们认为保持用户体验的简单性是最重要的。\n\nGustav Söderström (00:41:12):\n所以我们选择了更中心化的模式，在这种模式下，这些不同的 **vertical businesses**（垂直业务），如果你想想，音乐业务、播客业务、有声读物业务，它们都必须通过一个单一的 **recommendation organization**（推荐组织），因为那又是另一个问题。你应该向哪个用户推荐哪一个？应该是书、播客还是音乐？你如何权衡它们之间的关系？而且，如果每个人都构建自己的 **UI**（用户界面），用户界面很容易变得极其复杂。音乐团队构建了他们的 UI，然后有人在此基础上添加了功能。所以这就是我们选择的优化方式。但它基于我们的战略，而且我认为这两种模式都有效。\n\nLenny (00:41:50):\n本期节目由 Eco 赞助。上个月，Eco 用户平均获得了 84 美元的 **cashback rewards**（现金返利奖励）。怎么做到的？通过 Eco，这是个人理财的未来。Eco 是对错位的 **financial system**（金融系统）的一次更新。它提供了一个像你的银行一样运作的应用程序，但几乎消除了所有 **middleman**（中间商），帮助即使是最好的理财优化者也能自动地在更短的时间内进行优化。如果你通过支付租金获得奖励，或者通过在线订餐和购物获得奖励，甚至每个月通过储蓄获得奖励会怎么样？然后想象一下，你仅仅因为获得奖励而再次获得奖励。使用 Eco，你可以在一些你喜欢的商家消费，并自动获得 5% 的现金返利，此外，Eco 的 **APY rewards**（年收益率奖励）看起来更像是 80 美元，而不是 80 美分。然后还有 **Eco points**（生态积分），这是世界上第一个 **open reward system**（开放奖励系统）。只要你在 Eco 应用程序中做任何事情，几乎都能赚取它们。\n\nLenny (00:42:40):\nEco 正在努力让这些积分成为有史以来最有价值的积分。所以早点参与是有好处的。听起来好得不像真的？请访问 eco.com/lenny，注册一个 **onboarding**（注册流程引导），了解为什么它不是。Lenny's Podcast 的听众如果参加 Eco 欢迎会话（welcome session），将获得超过 1000 美元存款的独家 4% **APY**（年收益率）。欲了解更多信息，请访问 eco.com/lenny，也就是 E-C-O.com/lenny。\n\nLenny (00:43:05):\n你举的这两个例子很有趣，苹果和亚马逊，它们是世界上最大的两家公司，它们处于这个 **spectrum**（范围）的两个极端。有趣的是，大多数公司都处于中间。我不知道处于极端位置是否有好处，而这最终会变得非常重要。\n\nGustav Söderström (00:43:21):\n我认为是这样。在几乎所有行业中，都有这种 **smiling curve**（微笑曲线）概念，你希望处于微笑曲线的极端，那是巨大的 **business opportunities**（商业机会）所在，而不是中间。所以这在 **organizational models**（组织模式）方面可能也是如此。\n\nLenny (00:43:34):\n说到极端，我想谈谈下 **big bets**（重大押注）。你们最近举办了一次大型发布会，基本上重新设计了 Spotify 的整个 **primary feed**（主信息流），使其感觉更像是应用程序发展的方向，就像 **TikTok reels**（抖音短视频）的流式体验，你开始听到视频和音乐播放，有些人喜欢，有些人不喜欢。作为一名 **product leader**（产品负责人），我很想知道你如何考虑长期发展，以及如何处理那些说“搞什么鬼……我讨厌改变，别再改了”的人。你对此有何看法？你听谁的？你忽视谁的？你如何知道要坚持下去？你如何处理这个问题？\n\nGustav Söderström (00:44:10):\n是的，你太客气了。**Twitter** 上对此有很多负面反馈。所以，让我深入探讨一些细节，因为我认为对于正在听节目的产品人来说，这是一个有趣的教训，我想很少有公司会谈论这些，因为你只愿意谈论那些完全如你所愿的事情，而不愿谈论那些没有完全如你所愿的事情。\n\nGustav Söderström (00:44:39):\n所以，我将阐述我们正在努力实现的目标以及我们所学到的。Spotify 主要是一个后台应用程序（background application），长期以来，我们在背景音乐和播客推荐方面一直被认为做得非常好。当手机放在你口袋里，你在听 EDM（电子舞曲）播放列表或流行音乐播放列表之类的东西时，我们非常擅长在后台插入另一首 EDM（电子舞曲）曲目或另一首流行音乐曲目之类的。\n\nGustav Söderström (00:45:09):\n然而，我们一次又一次从用户那里听到的是，他们说自己陷入了“品味泡沫”（taste bubble）。所以，我喜欢我的 Spotify，我喜欢这些，但我现在对 EDM（电子舞曲）有点厌倦了，而 Spotify 没有推荐一些全新的东西。如果你考虑这个问题，它可能听起来与推荐问题（recommendation problem）相似，只是另一个推荐问题，但实际上它有根本的区别，因为当你在 EDM（电子舞曲）播放列表里推荐另一首 EDM（电子舞曲）曲目时，你有很多来自该用户的信号表明他们喜欢 EDM（电子舞曲）。但如果你要推荐一个全新的音乐类型/流派（genre），根据定义，你一无所知。因为如果你有想法，那对他们来说就不是新的。所以你什么都不知道。回到命中率（hit rate）的问题，当你向用户推荐全新的东西时，你的命中率（hit rate）会非常低。\n\nGustav Söderström (00:46:03):\n所以，帮助人们摆脱“品味泡沫”（taste bubble）的这个问题，并不像听起来那么容易。我们也不能随意选取一些不那么典型的音乐类型/流派（genre）。例如，我是雷鬼动（Reggaeton）的忠实粉丝。它通常不……在瑞典不是很常见。如果你看我个人资料的其他部分，会发现我是重度 EDM（电子舞曲）爱好者，你可能不会猜到这一点。Spotify 也不会猜到。所以如果我在后台听我最喜欢的 EDM（电子舞曲）播放列表，或者我的金属乐（metal）播放列表（金属乐在瑞典非常流行），我们很难在其中插入一首雷鬼动（Reggaeton）曲目。大多数人会认为 Spotify 出错了（Spotify's broken）。\n\nLenny (00:46:41):\n是的。\n\nGustav Söderström (00:46:41):\n他们到底在想什么？所以那行不通。为了帮助人们打破他们的“品味泡沫”（taste bubbles），你需要一些不同的东西。你需要一种命中率（hit ratio）可以很低，并且人们也期望它很低的东西。\n\nGustav Söderström (00:47:00):\n所以当我们在后台推荐内容时，我们的命中率（hit ratio）至少需要达到十分之九，也许一个失败品（dud）还可以接受，但如果你收到五个失败品（duds），你会觉得我们搞砸了你的播放列表和你的会话。我们需要一种十分之一就能成功（gem）的模式。如果你在尝试十次中发现一个珍宝（gem），你会非常高兴。所以你需要一个完全不同的范式（paradigm）。而且，由于命中率（hit rate）很低，你还需要能够快速浏览许多候选内容（candidates）。你不能为每个项目花三分钟。就像，“好吧，我不喜欢这个”，然后还得等两分钟下一个才出现。你需要快速地说“不，不，不。”所以，最明显的候选方案是这种信息流式体验（feed-type experience），你可以浏览大量内容，并且期望命中率（hit ratio）要低得多。如果你不喜欢，成本也很低，你只需滑动（swipe）一下。\n\nGustav Söderström (00:47:50):\n这就是为什么人们一直以来……当他们想打破自己的“品味泡沫”（taste bubbles），或者当他们来到 Spotify 听一些全新的东西时，通常是因为他们在 TikTok 或 YouTube 之类的服务上发现了它，在那里他们接触到了大量新内容。所以人们一直在向我们寻求这些工具，这就是我们想解决的问题。因此，我们构建了一系列功能，这些功能具有信息流式结构（feed-like structures），你可以浏览包含许多曲目的新音乐类型/流派（genre），或者包含许多剧集的播客频道，甚至是完整的播放列表。我们实施了这些功能，并将它们放入了名为“子信息流”（subfeeds）的东西中。所以，在当前的体验中（这已经在全球推广（roll out worldwide）），如果你点击播客子信息流（podcast subfeed），你会得到一个播客剧集的信息流。点击音乐子信息流（music subfeeds），你会得到一个播放列表信息流，你可以在其中浏览许多播放列表。如果你不理解名称，你可以快速听听它们的声音，试听几首曲目，了解这是否适合你。如果你通过搜索和浏览页面（search and browse page），你可以找到全新的音乐类型/流派（genres），并快速浏览它们。\n\nGustav Söderström (00:48:59):\n所以这些都按我们预期的方式运作。人们在想找新音乐的时候会去使用它们。他们浏览并保存新歌曲。所以它们按我们预期的方式运作。没有按预期运作的是，当用户一次又一次地要求我们提供这些功能时，我们把这些东西的总和放到了主页（Home）上，因为人们对发现（discovery）的需求非常大，而且我们能清楚地看到发现（discovery）与 Spotify 的用户留存（retention）等之间存在很强的关联。但我们误判或失败，或者更确切地说，从我们自己的主页（homepage）中学到的是，它现在的工作方式，这就是你在推特评论（Twitter comment）中可以看到的，如果你抛开那些愤怒的声音，试着看看他们真正在说什么，他们说的是以下内容，这在定量数据（quantitative data）中也相当清晰：如果你看人们在 Spotify 当前主页上所做的事情，几乎 90% 是我们所说的“回忆/回溯”（recall）。\n\nGustav Söderström (00:49:59):\n所以，这要么是进入你已经在进行的一个会话（session），要么是进入一个你明确知道想听的特定播放列表（playlist），或者至少是一个特定的使用场景。所以你带着高意图（high intent）而来，你实际上知道自己想要什么，而可能只有 10% 的时间才是真正的“发现”（discovery），比如我不知道自己想要什么。所以如果你想一下，这就是 90% 的“回忆/回溯”（recall）和 10% 的“发现”（discovery）。当我们测试这个设计时……所以“子信息流”（subfeeds）有时工作，有时不工作，但当我们在主页（Home）上测试其中一些时，我们把它从 90/10 切换到了 10/90。所以是 10% 的“回忆/回溯”（recall），90% 的“发现”（discovery）。虽然人们想要“发现”（discovery），但他们可能不想要 90% 的“发现”（discovery），而不是 90% 的“回忆/回溯”（recall）。所以如果你再看看推特上的评论，他们会说：“嘿，我找不到我的播放列表了。这些东西去哪了？”\n\nGustav Söderström (00:50:47):\n他们并不是真正在抱怨“发现”（discovery），他们抱怨的是他们再也找不到那些东西了。我们也能在定量数据（quant data）中看到这一点。你可以看到流量从主页转移（traffic shifting）到搜索和资料库（library），这清楚地表明人们正试图找到他们再也找不到的东西。你甚至可以看到人们试图使用那些为快速理解新事物而优化的“发现工具”（discovery tools）来做“回忆/回溯”（recall）。我想要的那张健身播放列表（workout playlist）在哪里？而这实际上对“回忆/回溯”（recall）来说是非常糟糕的用户界面（UI），它就像一台老虎机（slot machine），对吧？你是否能找到那张健身播放列表（workout playlist）是极其不可预测的。它是为发现新事物而优化的，而不是为“回忆/回溯”（recall）现有事物而优化的。当你进行“回忆/回溯”（recall）时，你想要一个屏幕上有很多项目的密集用户界面（dense UI），因为你知道你在找什么。所以当你在发现新事物时，你不需要大量的屏幕空间（real estate）。你想要大量的像素（pixels），而且你可能想要声音，因为你不知道那是什么。\n\nGustav Söderström (00:51:40):\n所以我们从我们的用户界面（UI）中学到的是，我认为这里可能有一点“产品嫉妒”（product jealousy），你总是会看其他的体验。如果你环顾四周，可能会觉得大多数其他产品，比如 YouTube，他们的主页（homepage）就是这样的。它是一个巨大的、单项目的“发现信息流”（discovery feed），只有新内容。人们似乎并没有愤怒地发推（tweet angrily）说他们有多么生气，而是说他们喜欢 YouTube，而且它是一个大产品。我想我们发现的是，我们实际上在主页（homepage）上做了一件非常好的事情，那就是支持你在同一时间处于多个会话（multiple sessions）中。所以你可能正在听两个播客（podcast）和一个有声书（audiobook），同时还想找到那个健身播放列表（workout playlist）。我不记得它的名字了，但我知道它是关于健身的。\n\nGustav Söderström (00:52:31):\n我们实际上那部分做得非常好。我敢说，比其他体验好得多，在那些体验中，你实际上必须去某个标签页（tab），进入资料库（library），然后开始浏览才能回到你原来的地方。所以也许这是“路径依赖”（path dependent）的。因为我们把“回忆/回溯”（recall）做得相当好，所以当人们不能再进行“回忆/回溯”（recall）时，他们理所当然地感到沮丧。我们不想失去这一点，因为这是我们做得好但却低估了的事情之一。我的体会是，我们确实比其他体验做得更好。所以我们当然想保留它。所以我们所做的就是现在我们只是更新他们的假设（hypothesis）以达到相同的目标，那就是这些东西正在运作，当人们想要“发现”（discover）时，他们会使用它们，而且它们似乎有效，它们也可以变得更好。\n\nGustav Söderström (00:53:20):\n从机器学习（machine learning）的角度来看，你正在进行一场“爬山算法之旅”（hill-climbing journey），但问题是，如何确保每当人们觉得自己陷入了“品味泡沫”（taste bubble）时，他们都能明白这些东西就在那里并且易于使用？所以现在我们有一个主页（Home）版本也在测试中，很明显，这些功能非常容易获得，但却是自愿使用的，你仍然可以进行所有的“回忆/回溯”（recall）。所以从我的角度来看，这就是我们进行 A/B 测试（A/B test）的原因，因为你希望科学地对待它，你希望尽可能多地了解自己的产品和用户。现在我正在分享很多经验教训。也许我们应该保守这些秘密，但我的直觉（hunch）是，这将使它成为一个更好的产品。\n\nGustav Söderström (00:54:09):\n但当我开始着手这件事时，我告诉我的团队们，因为我已经做过几次了，我同意说，我认为产品开发（product development）有两种根本不同的类型。一种是设计一个新功能（new feature）。这很难，但用户是自愿（voluntary）使用的。所以你做了 AI DJ（人工智能DJ）。有些人喜欢它，那很好。如果你不喜欢它，它并没有让你感觉更糟。但当你重新设计（redesign）时，情况就棘手得多，因为参与重新设计（redesign）不是自愿的。所以即使对于不喜欢它的人来说，也有代价。然后你这里有一个非常棘手的问题（tricky problem），那就是会有两种类型的反馈（feedback）。一种是你做了一些事情，而且做得对，但人们因为你改变了东西而感到沮丧。另一种是你做了一些事情，但做得不对，人们也感到沮丧，但原因充分。\n\nGustav Söderström (00:55:08):\n那么你如何区分这两种情况呢？因为我想我向我的团队们解释过这个问题……当我们和我的团队讨论这个问题时，我认为可以考虑的类比（analogy）是，你有一个桌面，你的实体桌面（physical desktop），你的电脑放在一个地方，你的铅笔放在这边，你的笔记本放在那边，然后我进来，把所有东西都重新布置（rearrange）了。而你们，在我们的案例中，可能已经用这种设置（setup）度过了 12 年。即便我有很多定量数据（quantitative data）表明我的新设置（setup）更好，也无关紧要，你会感到沮丧，因为你在这旧的设置（setup）中很高效。很难区分这两者。最经典的用例（classic use case）是 Facebook 的动态消息（Facebook newsfeed），当它变成一个单一的动态消息时，人们非常沮丧。但事实证明，它解决了很多用户问题，你不再需要跑遍 Facebook 自己去收集事件（collecting events）。\n\nGustav Söderström (00:55:58):\n所以有一些方法可以判断你是否做得更好，但人们的习惯被打破了，或者它并没有更好。例如，一种方法是观察那些没有这种行为的新用户群体（new user cohorts），与所有用户群体（user cohorts）进行对比等等。所以我们和团队一起经历了这一切。在做之前，我说：“这会很痛苦。”可能会有很多推文，因为我们能做得完全正确的可能性非常低。因此，对于团队来说，这并不是很难。很难……你想要回应人们，但正确的方法是倾听、理解，尝试新的假设（hypothesis），以真正弄清楚发生了什么。所以我想我现在已经做过三四次了。也许是三次。一次不成功，两次成功。所以大概知道自己要面对什么。\n\nGustav Söderström (00:56:45):\n所以这几乎就像是自我惩罚，非常痛苦，但同时也是最令人兴奋的事情。我想任何产品经理都知道，最简单、最直接的做法就是围绕你现有的基础进行迭代（iterate）。这没有风险。你不会被解雇，没有用户会生气。但每个人也都知道，如果最终你不适应新技术、新范式（paradigms）等，你就会被淘汰。你必须找到尝试新事物的平衡点。当你在软件领域工作时，你拥有 A/B 测试（A/B testing）这个工具，并且可以科学地进行。当你开发硬件时，情况会更糟。如果你错了，那就是错了，你无法更新。\n\nLenny (00:57:26):\n我喜欢这个故事。非常感谢你的分享。我也觉得像这样的大规模发布，你实际上无法提前进行 A/B 测试（A/B test），因为那是媒体宣传季（press season）。他们会说：“天哪，看看 Spotify 在做什么！”所以你在那方面是受限的。想象一下，对吧？你无法真正提前测试这个。\n\nGustav Söderström (00:57:40):\n这其中最困难的是，如果你尝试一些全新的东西，你的最小可行产品（MVP, Minimum Viable Product）需要非常庞大，这样你才能构建一个新的用户界面（UI）。但如果你没有为单项信息流（single item feed）做算法（algorithms），你就无法判断这是否是正确的想法，但机器学习（machine learning）却表现不佳，对吧？是 UI 不好还是机器学习不好。或者你必须投入大量开发，那会变得相当昂贵。实际上……最痛苦的原因并非来自外部的反馈。而是你必须承担的内部成本。当你真的希望自己是对的时候，你会承担巨大的成本。\n\nGustav Söderström (01:00:56):\n所以，我认为这是任何人最大的风险。你必须保持客观（unemotional），只看证据和数据。如果你这样做，你就会继续前进，达到你想要的目标，解决相同的问题，但你会做出调整。\n\nLenny (01:01:14):\n我真的很喜欢这个理念（philosophy）。本质上，这就是“强烈观点，宽松持有”（strong opinions loosely held）的想法。是这样吗——\n\nGustav Söderström (01:01:19):\n没错。就是这样。听起来很简单，但做起来很难。\n\nLenny (01:01:23):\n对吧？因为就像你说的，人们不尊重那些改变主意的人。他们会想：“哦，我明白了，他们一直都是错的，而且还对自己的错误那么自信。”\n\nGustav Söderström (01:01:31):\n是啊，没错。而且不清楚为什么我们应该想要这样，但我认为这与人类心理学（psychology）有关。我们实际上倾向于喜欢预言家（prophets）和那些观点非常强烈但数据很少的人。这些人是我们喜欢的。而那些会看大量数据的人，我们却不喜欢。不确定为什么。\n\nLenny (01:01:57):\n我们是有缺陷的生物（flawed creatures）。\n\nGustav Söderström (01:01:59):\n当然。\n\nLenny (01:02:00):\n有没有最近你在这方面改变了想法，让你觉得“哦，对了”的事情？\n\nGustav Söderström (01:02:06):\n没有，我认为关于科学系统和主页的这些经验教训做得非常好，也许比其他方面更好，我们不想“连同洗澡水把婴儿一起倒掉”（wash out with a bath water）或者其他 [听不清 01:02:20] 的表达。我认为这是我目前非常满意，也是最大的收获。\n\nLenny (01:02:26):\n是的，我喜欢这种发现我们有些事情做得非常好的学习过程，是我们之前不一定意识到的，也许我们应该在这方面投入更多。\n\nGustav Söderström (01:02:34):\n没错。\n\nLenny (01:02:35):\n换个方向。Shishir Mehrotra 建议我问你一些事。他好像在你的董事会（board）里。\n\nGustav Söderström (01:02:41):\n是的。\n\nLenny (01:02:41):\n他建议我问你关于你那 10% 的规划时间（10% planning time）。那是什么意思？\n\nGustav Söderström (01:02:46):\n这是一个概念（concept），我想 Shishir 从他在 YouTube 工作时起就一直在使用。这个想法大致是，你不应该将超过 10% 的时间用于规划，而其余时间用于执行（executing）或构建。这意味着如果你按季度（quarterly）工作 10 周，你应该花一周时间规划；由于我们是按六个月的增量周期（six-month increment）工作，所以我们尝试花两周时间规划，并且大致成功了。这……实际上，当我们谈到组织模型（org models）时，我想向 Airbnb 的 Brian Chesky 致敬，他实际上是首批拥有这些更具逆向思维（contrarian）的旧模型的人之一。他比硅谷的大多数人更具苹果式风格（applesque）。他也以六个月为增量周期工作。他在这方面也有很多经验。所以这就是 10% 规划时间。我认为如果你发现自己规划的时间远超过这个比例，那要么是你规划得太多，要么是你的执行周期（execution period）对于那个规划量来说太短了。这只是一个经验法则（rule of thumb），但我发现它很有效。\n\nLenny (01:03:53):\n我问了一些产品经理（PMs），我应该问你什么，实际上是 Spotify 的产品经理，我没告诉过你。有人指出你总是能给会议室带来很多精力（energy）和思路清晰（clarity）。他们认为这是你非常擅长的地方。作为一名领导者，你对此的重要性或者如何做得好有什么心得体会？\n\nGustav Söderström (01:04:11):\n嗯，很高兴听到这个。我不知道，所以我在努力思考如何回答。我认为这种精力，我不知道。我想我只是对我所做的事情感到兴奋。我一直对技术充满热情。我喜欢看到新事物。我的核心动力（core drive）仍然是这种理念，就是你看到一些我认为你会感同身受（empathize）但尚未存在的东西。你会想：“哇，我不知道那是否能存在。那会非常酷。”然后为了让人们去实现它，你就会努力分享这种兴奋。所以我想，对于我不兴奋的事情，我无法带来太多精力。所以我必须去做我真正相信并为此感到兴奋的事情。所以也许这样精力就会更自然地产生。对我来说，幸运的是，到目前为止，Spotify 一直处于这样一个阶段：允许大量的创新（innovation），甚至要求我尝试做一些很酷的新事物。\n\nGustav Söderström (01:05:09):\n也许对于纯粹的优化阶段（optimization phase），我会有更少的精力。关于清晰度，我一直喜欢尝试解释事情。众所周知，理解某事最好的方法是尝试向别人解释。所以我会到处向那些没有问我的人解释事情，不是为了显得聪明，而是为了看看我是否真的理解了。所以也许这就是练习。在这一点上，我确实要求我的下属领导，并且我要求他们也要求他们的下属领导，永远要解释清楚。我认为当……我们谈论自主权（autonomy）等等，我们不向每个人承诺他们必须同意，但我认为我们应该向所有员工承诺的是，即使他们不同意，他们也有权（entitled）理解你做出这个决定的原因。\n\nGustav Söderström (01:06:06):\n我认为不可接受的是说：“不，我们就这么做，因为我资历更深（senior）。我见过很多次了。你不够聪明。”所有这些。我认为你必须解释清楚，所以你欠一个解释。我发现这一点很有价值，回到理解某事唯一的方法就是解释它，因为通常情况下，如果你自己无法解释，你可能自己也并不真正理解。有时我认为你可能拥有很好的产品直觉（product instincts），但你无法表达出来。但大多数时候，当人们说有些东西存在但他们无法解释时，他们实际上自己并不理解。而且很多时候，那里根本没有任何东西。而且如果你能作为产品经理解释清楚，那么这些知识就会被分享。所以对组织（organization）来说，效率就会高得多。所以有时我也会故意激（provoke）一下人们，问他们艺术和科学（art versus science）的比重是多少，我说：“0% 艺术，0% 魔力，100% 科学。”这是因为我想强迫人们去尝试解释。我认为我们使用“艺术”和“魔力”这两个词。我们历史上（historically）一直用“艺术”和“魔力”来指代任何我们尚未能解释的事物。\n\nGustav Söderström (01:07:33):\n基因学在成为科学之前是魔法和艺术。量子物理学在成为科学之前也是魔法。而最近，实际上，智能和创造力在成为大型语言模型 (LLM) 中的统计数据之前，也是艺术和魔法。所以我认为我尝试推动人们去问：“你确定你能解释清楚吗？”因为这会迫使人们进行深入思考。所以也许我喜欢这种方式，并且我试图把它强加给别人。所以也许这就是为什么人们认为我有时能带来清晰。\n\nLenny (01:08:07):\n我喜欢这个说法。沿着这个思路问一个问题，你有没有推荐的解释事物的系统或方法？是仅仅写成文档吗？是采用某种特定的风格来解释，还是顺其自然，以个人最自然的方式来解释？\n\nGustav Söderström (01:08:20):\n我过去常常把所有东西都写下来，然后反复修改，让它变得越来越精炼。这种方法对我有效。我现在写得没那么多了。现在，我更倾向于在脑子里自己边走边思考。我实际上做的是……我发现这因人而异，很多人喜欢和别人一起碰一下想法，那是他们思考的方式。你一遍又一遍地重复同样的事情，然后得到一些反馈。所以我过去写了很多。如果我有一个想更好地理解的想法，我有时还是会写。在我人生的某个阶段，我希望能写一些真正的东西，比如一本书。但现在我越来越多地做的是，和我的同事或下属进行一对一会议 (one-on-ones)，然后我戴上 AirPods，进行一场分布式边走边谈 (distributed walk and talk)。\n\nGustav Söderström (01:09:12):\n两个人都在走路，但身处不同地点，你们花一个小时讨论一些事情。这实际上被证明非常非常有成效。这样你就有了“你不是一个人”的力量，你得到的智力会超过你自己的。我也不认为这有强有力的进化证据 (evolutionary proof)，但肯定有迹象表明，走路时你的思维会更好，无论是因为它给你的大脑供氧 (oxygenating your brain)，还是因为其他一些进化原因，我不确定。但我发现，边走边说边思考，即使不是面对面，只是通过 AirPods，也非常有效。是疫情迫使我们这样做。我原以为疫情期间我们的创造力会下降，战略制定 (strategizing) 会受到影响，但我发现恰恰相反。我们这种方式比以往任何时候都多，我开始思考为什么，我认为这都归功于我们进行的这些边走边谈。\n\nLenny (01:10:07):\n你刚才提到将来想写一本书。你觉得你的书会是关于什么的？\n\nGustav Söderström (01:10:11):\n我不知道。我真的不知道。从统计学角度看 (Statistically)，它可能是我做过很多事情的某个领域，所以它一定与技术或产品之类的东西有关。但我很想写一些虚构的东西 (fictional)。那会很有趣。\n\nLenny (01:10:26):\n哇哦。一旦出版我就立即预订。我想提的另一个概念是，另一位产品经理 (PM) 提出的，他称之为“裤子里撒尿的类比 (P in the pants analogy)”。你听起来耳熟吗？这个话题有趣吗？\n\nGustav Söderström (01:10:40):\n我不太确定这个人指的是哪个场合，但我知道我用过那个类比好几次。\n\nLenny (01:10:49):\n好的。有戏。\n\nGustav Söderström (01:10:50):\n我不知道这是否是一个瑞典的类比，因为我以为它更广为人知。但其思想是，你做某事……所以这句俗语是，就像在寒冷的天气里尿在裤子里。一开始感觉非常温暖和舒适。然后过了一会儿，你就会开始后悔。基本上，它是关于短期行为 (short term) 的。所以现在我只会说那就像在裤子里撒尿一样，因为人们知道我的意思。那是一种短期行为。\n\nLenny (01:11:21):\n这真是表达这个想法的一种滑稽 (hilarious) 方式。那肯定是个瑞典特有的东西。\n\nGustav Söderström (01:11:25):\n是的，我想瑞典人出于某种原因会这样做，显然其他人不会。\n\nLenny (01:11:30):\n也许是因为一年中大部分时间都很冷。\n\nGustav Söderström (01:11:33):\n是的。很可能就是这样。这句俗语适用于寒冷气候 (cold climate)。在温暖的地方，它没用。没人会明白你的意思。\n\nLenny (01:11:39):\n说到瑞典，你有没有看《继承之战》 (Succession)？\n\nGustav Söderström (01:11:42):\n是的，我看了。\n\nLenny (01:11:43):\n好的。瑞典已经成为这部剧的重要组成部分，特别是那家试图……我想我不想剧透，但里面有一个非常重要的角色。是的，没错。他是瑞典人。所以我很好奇你对他们描绘瑞典文化和瑞典商业往来 (business dealings) 的方式有什么看法？\n\nGustav Söderström (01:11:59):\n作为一个瑞典人，看到这个真的很有趣。我想，首先，任何一个人、任何国家，如果由又高大、身材又好、长相出众的亚历山大·斯卡斯加德 (Alexander Skarsgård) 来代表，都应该会很开心。所以这很好。然后我想有一集他们是在挪威，我就不多剧透了。\n\nLenny (01:12:25):\n嗯。\n\nGustav Söderström (01:12:26):\n有一些元素是真实的。我认为有很多瑞典品牌 Fjällräven (我认为意思是北极狐，这实际上是瑞典一个非常受欢迎的户外品牌) 进行了付费品牌定位 (paid brand positioning)。所以那是真实的。桑拿浴之类的东西也是真实的。所以它是真实的，但被夸大了。实际上，不太真实的是他的谈判风格。瑞典人往往严肃、谨慎，而这个人更像一个精明的玩家 (player)。所以从谈判策略 (negotiation tactic) 的角度来看，他不是典型的瑞典商人，我认为。\n\nLenny (01:13:11):\n是的，这并没有让我想起你之前描述的瑞典那种“人们围成一圈坐着，没有人是中心”的场景。\n\nGustav Söderström (01:13:15):\n不，没错。他非常以自我为中心。\n\nLenny (01:13:19):\n然后当人们去桑拿时，就会有那种吟唱，桑拿，桑拿 [听不清 01:13:23]。\n\nGustav Söderström (01:13:23):\n没错。\n\nLenny (01:13:24):\n最后一集。\n\nGustav Söderström (01:13:25):\n那是一部很棒的剧。我爱它。\n\nLenny (01:13:26):\n我爱它。这季太疯狂了。我很好奇它会走向何方。也许这是进入激动人心的闪电问答 (lightning round) 之前的最后一个问题。Spotify 目前对我个人而言，我认为也是全球范围内，是最大的播客平台 (podcasting platform)，我喜欢使用它。它运行得很好。我很好奇 Spotify 接下来会做什么，特别是 Spotify 播客业务。\n\nGustav Söderström (01:13:48):\n这有两个方面。一个是针对 Spotify 创作者的，另一个是针对 Spotify 听众的。对于 Spotify 创作者来说，有两件事。第一件事是，这也是我们在 Stream On 活动上谈论过的，我们也在音乐发现 (music discovery) 方面谈过这个问题，但对于播客来说，这是同样的问题，甚至更难。所以我们仍然非常关注帮助播客创作者找到更多的受众。就像我说的，在播客领域打破你的习惯和你的信息茧房 (break out of your habits and your bubbles) 是一个更大的问题。要找到一个新播客需要投入很多。所以，我认为这是我们能够也应该做得很好的事情。因此，我们继续在这方面投入大量资金。正如我所说，随着我们现在推出更多功能 (roll up more features)，你们会看到更多。\n\nGustav Söderström (01:14:37):\n创作者的另一个大需求是变现 (monetization)，现在你可以通过 DEI 和 Spotify SEI 等多种方式进行变现。但我们正在努力拓展并改进这一点，因为这个行业正在走向成熟，我认为这是创作者最大的需求之一，也是我们能为创作者做的最大事情，帮助他们更好地变现，无论是免费内容还是付费内容。我们也有付费播客 (paid podcast)。所以这是创作者方面。\n\nGustav Söderström (01:15:07):\n在用户端 (consumer side)，我不想分享太多。我们已经表明我们投入了大量资金在发现 (discovery) 上。我想保留一些秘密，等它们推出时再公布，但我们正在大量投资于用户体验本身。我认为它远未达到最佳状态 (optimal)，还有很大的提升空间。我可以分享的一点是，我们正在大量投入的，是跨设备和在汽车中播放的普遍性 (ubiquity) 和播放体验，所有这些我们在音乐方面做得很好的事情。但我认为收听体验可以变得更加无缝 (seamless)。我认为搜索可以做得更好。关于播客的数据以及……嗯，我不想说太多，但考虑到人工智能 (AI) 和生成式技术 (generative technology)，还有很多事情可以做。\n\nLenny (01:15:52):\n好的。那我能得到多少就拿多少吧。话虽如此，我们已经进入了激动人心的闪电问答 (lightning round) 环节。古斯塔夫，我给你准备了六个问题。你准备好了吗？\n\nGustav Söderström (01:16:01):\n我想我准备好了。开始吧。\n\nLenny (01:16:03):\n好的，我们拭目以待。你最常推荐给别人的两三本书是什么？\n\nGustav Söderström (01:16:08):\n好的。这就是为什么我试图把七本书塞进两三本书的推荐里。所以如果我们从产品开始，我认为它广为人知，但我会推荐产品人员阅读的一本书是汉密尔顿·赫尔默 (Hamilton Helmer) 的《七种权力》 (7 Powers)，Netflix 广泛使用它。我们也广泛使用它。如果你刚开始从事产品工作，有一个战略框架 (strategy framework) 是非常好的。没有哪个战略框架是绝对正确的，但有一个总比没有好。\n\nGustav Söderström (01:16:31):\n我认为在思维模型 (mental models) 和框架 (frameworks) 领域，另一本是查理·芒格 (Charlie Munger) 的《完整的投资者》 (The Complete Investor)。所以，是的，它是关于投资的，但实际上它包含了查理·芒格使用的许多思维模型。我认为关键收获 (key takeaway) 是，如果你有一个问题，你应该始终应用三种不同的模型来解决它，因为模型的作用是它们简化并降维 (reduce dimensionality)。世界可能有无限的维度，而模型将其简化为三四个。这样做的风险是你可能会不小心剔除一个非常重要的维度，也许是大流行病 (pandemic diseases) 之类的。但如果你使用三种具有不同维度并以不同方式简化的模型，从统计学上讲，如果它们得出相同的结论，那么即使是你应用的第二个模型，也能大大增加你判断正确的几率。所以那是一本值得一读的好书。\n\nGustav Söderström (01:17:24):\n然后我认为，如果我们跳出产品领域，我个人对科学和数学非常感兴趣。所以快速列举几本。一本是《阿莱夫之谜》 (The Mystery of the Aleph)，一本很棒的书。肖恩·卡罗尔 (Sean Carroll) 的《深藏的秘密》 (Something Deeply Hidden)，关于量子力学诠释 (interpretation of quantum mechanics) 的。卡洛·罗韦利 (Carlo Rovelli) 的《赫尔戈兰》 (Helgoland)，关于量子力学的关系诠释 (relational interpretation of quantum mechanics) 的。戴维·多伊奇 (David Deutch) 的《无限的开始》 (The Beginning of Infinity) 和《现实的结构》 (The Fabric of Reality)。唐纳德·霍夫曼 (Donald Hoffman) 的《反现实论》 (The Case Against Reality)，讨论进化与真相 (evolution versus truth)，以及进化并非为了优化真相的认知 (optimize for seeing the truth)，而只是为了适应性 (fitness)。《哥德尔的证明》 (Gödel's Proof) 也是一本很棒的书，关于他的不完备定理 (incompleteness theorem)，即在任何公理系统 (axiomatic systems) 中，都会存在无法被证明的真命题，这是一个值得思考的奇怪概念。然后，我最喜欢的书之一可能是保罗·戴维斯 (Paul Davies) 的《机器中的恶魔》 (The Demon in the Machine)，这本书知名度较低，它探讨了信息如何仅仅是熵 (entropy)，以及信息引擎 (information engines) 的概念，即你仅仅通过信息就可以驱动某些东西，而排放物 (exhaust) 也是信息。这可不是一个简短的清单。\n\nLenny (01:18:39):\n不，我正要说你创下了推荐书目数量最多的记录，但这也表明了你正是通过阅读这些书变得如此深刻而睿智 (insightful and wise)。所以我认为，如果人们想达到你现在的境界，我认为这就是一个启示 (lesson)。\n\nGustav Söderström (01:18:55):\n我保证，艺术家的部分我会说得简短得多。\n\nLenny (01:18:57):\n没关系。我们有时间。好的，下一个问题。最近最喜欢的一部电影或电视剧是什么？\n\nGustav Söderström (01:19:03):\n我们刚才聊过《继承之战》 (Succession)，它确实是我最近的最爱。所以我就随意 (frivolously) 提一部不是最近的，但绝对是我最喜欢的作品，那就是《奔腾年代》 (Halt and Catch Fire)，我认为它在 FX 电视台播出。一部很棒的剧。如果你曾在科技行业工作过，它讲述的是上世纪80年代硅草原 (Silicon Prairie，指美国中西部科技公司聚集的地区，类似于硅谷) 的故事，并一直追溯到今天。一部很棒的剧。\n\nLenny (01:19:24):\n《硅谷传奇》（Halt and Catch Fire）。是的，我看了点。后来没继续看，但这真是个好提醒，得去看看了。\n\nGustav Söderström (01:19:29):\n得回去看了。\n\nLenny (01:19:30):\n我会回去看的。你最近喜欢问的面试问题是什么？\n\nGustav Söderström (01:19:34):\n我不问这个问题，但我最喜欢的问题是 Lex Fridman 那个简短的收尾问题，通常是这样的：“那么，这一切的意义是什么？”（so what's the meaning of it all?）我喜欢那个。那是一个很难得到答案的问题。\n\nLenny (01:19:46):\n我真想问你，但是——\n\nGustav Söderström (01:19:48):\n不，别问。\n\nLenny (01:19:50):\n好的。我们继续。那会是另一个……那会是我们第二次尝试这个。\n\nGustav Söderström (01:19:53):\n是的。\n\nLenny (01:19:55):\n你最近发现了哪些你喜欢的优质产品？\n\nGustav Söderström (01:19:58):\n显而易见的一个是 ChatGPT GPT-4（一个大型语言模型，能够生成文本、回答问题等），我只是在玩它，试着为自己创建一些能做不同事情的 bots（机器人程序，指能够自动执行任务的软件）等等。但我不认为这可能适用于所有人。另一个我真正喜欢的是你曾经写过和谈论过的 Duolingo（一款语言学习应用程序），我认为它从产品角度、执行力以及他们所做的一切来看都非常令人印象深刻。它在我家里也被疯狂地使用。我们有一个家庭账户，每个人都在使用它，每天都在竞争。所以，我既对这个产品印象深刻，我自己也用得很多。\n\nLenny (01:20:35):\n你家里的人都在学什么语言？\n\nGustav Söderström (01:20:38):\n在我的家里，现在是西班牙语。\n\nLenny (01:20:41):\n学得怎么样？\n\nGustav Söderström (01:20:41):\nBien。（好）\n\nLenny (01:20:44):\n你得到了一颗金星（表示做得好）。\n\nGustav Söderström (01:20:47):\n我只有几千 XP（经验值，通常用于游戏或学习应用中衡量用户进度和熟练度的积分系统）。我还没那么好。\n\nLenny (01:20:51):\n不，我不知道那是不是算好。听起来已经很不错了。下一个问题，你在产品开发流程（product development process）中做过哪些相对微小的改变，但对你的团队的执行能力（ability to execute）产生了巨大影响？\n\nGustav Söderström (01:21:01):\n我不确定我做过任何微小的改变能产生巨大影响。通常，需要更大的事情才能产生大的影响。我想，也许我尝试做的一件事，回到清晰度等方面，就是我提到过的我正在大力推行的“苏格拉底式辩论”（Socratic debate），其理念显然是最好的想法获胜，而不是资历最老的人的想法获胜，等等。并且努力推行这种让人解释清楚自己的想法的理念，而不是说“我觉得有点什么”或者“我有种感觉”之类的。而且显然，就像你说的，这确实产生了一些影响，因为人们显然是这样评价我的。所以这可能就是最大的事情了。\n\nLenny (01:21:53):\n最后一个问题，Spotify 产品团队有什么有趣的习惯，是桑拿吗？\n\nGustav Söderström (01:21:59):\nSpotify 现在规模太大了，所以实际上它很本地化，Spotify 的不同部门有不同的产品习惯（product rituals）。我多年前，大概 12 年前，无意中创建了一个习惯，那时我们讨论产品处于哪个阶段。当时……我们需要一些定义。所以我记得我脱口而出地说：“嗯，它有四个阶段：‘思考阶段’（think it）、‘构建阶段’（build it）、‘发布阶段’（ship it）、‘调整优化阶段’（tweak it）。”在‘思考阶段’，成本应该很低，不会花很多钱。在‘构建阶段’，你将开始花很多钱。所以你必须在‘思考阶段’降低你判断正确的风险。然后是‘发布阶段’，之后你再进行调整优化。这其实并没有经过深思熟虑，但很有趣，因为我至今有时还会听到，甚至来自其他公司的人说：“哦，我们正处于‘思考阶段’。”或者“我们正处于‘调整优化阶段’。”所以它流传开来了。我不知道它是不是很好，但它流传下来了。\n\nLenny (01:22:57):\n它确实上口。我认为任何能让人记住的东西都是成功。Gustav，非常感谢你的到来。我们已经邀请了两位瑞典嘉宾，都非常棒。Gustaf（用 F 拼写），Alströmer 曾来过播客。\n\nGustav Söderström (01:23:10):\n他也是一个很棒的人。\n\nLenny (01:23:12):\n也是一个很棒的人。我非常羡慕那些能与你共事并为你工作的人。再次感谢你的到来。最后两个问题，如果大家想了解更多，或者想联系你，问一些问题，他们可以在哪里找到你？\n\nGustav Söderström (01:23:23):\n[听不清 01:23:23] @GustavS。\n\nLenny (01:23:24):\n好的。再说一遍。\n\nGustav Söderström (01:23:28):\n@GustavS。\n\nLenny (01:23:29):\n太棒了。那么最后一个问题是，听众们如何能对你有所帮助？\n\nGustav Söderström (01:23:33):\n尽管联系我。我确实会阅读反馈，我试着去除那些愤怒的评论，然后理解他们实际在想什么，为什么他们会生气，或者有什么地方出了问题。\n\nLenny (01:23:44):\n那么联系方式，你推荐直接在推特上发一条愤怒的推文给你，还是发邮件到你分享的那个邮箱地址？\n\nGustav Söderström (01:23:50):\n嗯，@GustavS 是我的 Twitter handle（推特用户名），所以直接在推特上发推文给我（tweet at me）就行。\n\nLenny (01:23:54):\n好的。\n\nGustav Söderström (01:23:56):\n你也可以友善一点。\n\nLenny (01:23:57):\n好的。\n\nGustav Söderström (01:23:58):\n没关系。\n\nLenny (01:23:58):\n太棒了。Gustav，非常感谢你的到来。\n\nGustav Söderström (01:24:01):\n谢谢你邀请我，Lenny。很高兴。\n\nLenny (01:24:03):\n再见，各位。\n\nLenny (01:24:05):\n非常感谢您的收听。如果您觉得本期节目有价值，可以在 Apple Podcast（苹果播客）、Spotify（声田）或您喜欢的播客应用上订阅我们的节目。另外，请考虑给我们评分或留下评论，因为这真的有助于其他听众找到我们的播客。您可以在 lennyspodcast.com 找到所有过往节目或了解更多关于本节目的信息。下期节目再见。",
  "chunks_count": 9
}