{
  "guest": "Gustaf Alstromer",
  "en": "Gustaf Alströmer (00:00:00):\nIf I drill down what makes companies fail, it's quite simple. It's just like they don't talk to users, which means they don't find product market fit. And if they don't find product market fit, nothing else really matters. What mistakes do people make is like it is all about that. It's all about talking to customers and learning that you're building something that's actually useful. YC Slack headline is make things people want, and it's still true and it's always going to be true.\n\nLenny (00:00:30):\nWelcome to Lenny's Podcast where I interview world-class product leaders and growth experts to learn from their hard one experiences building and growing today's most successful products. Today my guest is Gustaf Alstromer. Gustaf is a group partner at Y Combinator where he's been for almost six years. Prior to that, Gustaf was at Airbnb for over four years where he started the original Airbnb growth team and where I was very lucky to get to work alongside him for a number of years. Gustaf is also at the heart of YC's increased focus on climate tech, and in my opinion is one of a handful of people who've had an incredible impact on the increasing amount of investment and people flowing into climate tech.\n\n(00:01:10):\nWe chat in depth about what's happening in climate tech, why things have shifted so much recently, what's new and exciting, and how to think about the space if you're hoping to make the jump. We also get deep into Gustaf's experience working with over 600 startups over his time at YC. We talk about what are the most common mistakes that early stage startups and founders make, what advice YC partners give founders most often, the most common attributes of successful founders, the importance of having a technical co-founder and why that's the case, so much more. I guarantee you will leave this episode smarter and more inspired and I can't wait for you to hear it. With that, I bring you Gustaf Alstromer after a short word from our wonderful sponsors.\n\n(00:01:53):\nThis episode is brought to you by Linear. Let's be honest, the issue tracker that you're using today isn't very helpful. Why is it that always seems to be working against you instead of working for you? What does it feel like such a chore to use? Well, Linear is different. It's incredibly fast, beautifully designed, and it comes with powerful workflows that streamline your entire product development process from issue tracking all the way to managing product roadmaps. Linear is designed for the way modern software teams work. What users love about Linear are the powerful keyboard shortcuts, efficient GitHub integrations, cycles that actually create progress, and built-in project updates that keep everyone in sync. In short, it just works. Linear is the default tool of choice among startups and it powers a wide range of large established companies such as Vercel, Retool and Cash App. See for yourself why product teams describe using Linear as magical visit linear.app/lenny to try Linear for free with your team and get 25% off when you upgrade. That's linear.app/lenny.\n\n(00:03:02):\nThis episode is brought to you by Eppo. Eppo is a next generation A/B testing platform built by Airbnb alums for modern growth teams. Companies like Netlify, Contentful, and Cameo rely on Eppo to power their experiments. Wherever you work, running experiments is increasingly essential, but there are no commercial tools that integrate with a modern grow team stack. This leads to wasted time building internal tools while trying to run your experiments through a clunky marketing tool. When I was at Airbnb, one of the things that I loved about our experimentation platform was being able to easily slice results by device, by country, and by user stage. Eppo does all that and more, delivering results quickly, avoiding annoying prolonged analytics cycles, and helping you easily get to the root cause of any issue you discover. Eppo lets you go beyond basic clickthrough metrics and instead you turn north star metrics like activation, retention, subscriptions, and payments. Eppo supports test on the front end, the back end, email marketing and even machine learning clients. Check out Eppo at getepo.com. Get, E-P-P-O.com, and 10X your experiment velocity.\n\n(00:04:15):\nGustaf, welcome to the podcast.\n\nGustaf Alströmer (00:04:17):\nThank you, Lenny. Honestly, it's so great to see you. I'm excited to be talking to you.\n\nLenny (00:04:22):\nI've been looking forward to this conversation for a while ever since we booked this. We worked together at Airbnb for many years. I was really lucky to get to work with you before you moved on to bigger and better things at YC. Speaking of Airbnb, you once tweeted about how special an experience that was for you, and I think even more interestingly, how many of the people that have left Airbnb can't find another place that's as special that just like that bar has been set too high. And so my first question is just like, what do you think it was that made Airbnb so special? Why was it such an important experience for you and other people? And even more importantly, just what is it that you take from that experience that you bring to startups that you work with now?\n\nGustaf Alströmer (00:05:02):\nYeah, it's funny. I think this year in a couple of months it'll be 10 years ago since you and me started Airbnb.\n\nLenny (00:05:07):\nWow.\n\nGustaf Alströmer (00:05:08):\nIt was 2012. The reason I treated that was I asked everyone that I'd met after Airbnb, because I had this experience of like, this was the highlight of my career up until then, at least being in the team like that and I asked everyone, \"Have you found anything better?\" Besides maybe one or two people, I haven't heard anybody say that they found something better. And they all missed that dearly. I thought a lot about why that was the case, but I would say Airbnb did not feel like a normal job. It felt like more like a group of friends trying to just do something together and we were friends. At least in the beginning it did not feel like this was a job. It was sort of like an ongoing project and an assembly of amazing people. I think in the end we managed to build two things, like a really successful company, thanks to Joe and Nate and Brian just for starting this. Without them there would be nothing to build.\n\n(00:06:04):\nI think people don't like to use the word family, but I feel like that way because when I go and meet with Airbnb alumnis from that team. We have a very special bond that reminds me of close social connections more than anything else. It does not remind me of coworkers. I asked myself why this was the case. The best answer I have is probably we brought in a special type of people. We had very diverse backgrounds. A lot of us was former founders. Not many of us were career people from the technology industry of the early days, not many of us.\n\n(00:06:37):\nI think that bar that we set, the first, I believe when I joined there was probably five or seven PMs and there was 30 engineers or something and you joined a little bit before me, those people set the bar or set the standard of what we were looking for afterwards. I think it took a long time to change that narrative. I mean, eventually you have to hire people that only had big corporation careers, but I don't remember we did that for a long time. When I actually read my goodbye note recently, my words there still means a lot to me and it means sort of like you're trying to reflect on exactly these things on like, building a great company that became successful and being part of this sort of family of really close friends.\n\nLenny (00:07:21):\nSo it sounds like if you had to boil down what Airbnb did, it sounds like hiring was the main piece that impacted the way it turned out just like the founders being very specific about the type of people they were hiring.\n\nGustaf Alströmer (00:07:32):\nAbsolutely.\n\nLenny (00:07:32):\nIs there anything that's like, I don't know, a take away there of just what you recommend to founders, like hiring. People know, be very careful who you hire. The first, I don't know, 10 people will impact the culture long term. But I don't know. Is there anything just abstracting away there of just what to look for in that first batch of hires?\n\nGustaf Alströmer (00:07:50):\nIt's a tricky one because I would like to say that all the things that we did were the cost of the outcome of this, but that's not really how the world works. Some of the things we did work, some of the things that we did did not work. It's hard for us to actually disentangle what those things are, but I think we can talk about the things that we did. First of all, we made sure we hired people that were really excited to be there, right? They wanted to build Airbnb and they were really excited to work on Airbnb. That was the most important thing. Of course people had other offers, but I think you can figure out from those offers are you excited to be here or not. So that was probably the first thing.\n\n(00:08:30):\nThe second thing I think is trying to understand the true motivations of the people that were there, like lower, \"Why are you here?\" We did something we call culture interviews that I think the founders have written about or there's probably content online about this. We did a lot of culture interviews early on to try to figure out we got the people that were there that mapped our core values and were really excited to work on Airbnb. I think finally, I don't know how this happened, we did pick people from diverse backgrounds. Most startups don't have most of the PMs being former founders, but I believe that was the case for the first 10 or 12 or 15 PMs at Airbnb. A lot of us were former founders. I think that that made a big difference for how you make decisions and how you get started on things.\n\n(00:09:21):\nI think I actually see this a lot in the Airbnb founders. They really care about the time at YC and they tried to recreate YC inside Airbnb a couple of times with demo day and with so new products completely isolated from the rest, starting with doing things that don't scale and talking to customers. So I think that that experience had made a big impact on them, but it's hard to say just these two things go and apply these things. It's actually kind of hard to say, \"Well that will work at it as Airbnb.\" I think that's a really tricky question to answer.\n\n(00:09:51):\nThe last thing I would say is Airbnb had an incredible business model, an incredible business from early on and it was hard to fail. What I mean by that is it's hard to fail with a company. You can fail with individual things inside the company, but a company was still going to succeed. I think we all felt that. A lot of companies don't have the ability to take risks like Airbnb did early on because they don't have something that's so obviously great.\n\nLenny (00:10:18):\nThat's a really interesting point on the last piece that you may have the most amazing culture and hire incredibly well, but if the company doesn't work out, it's not going to be looked back as like, \"Wow, that was an amazing experience, but we failed.\"\n\nGustaf Alströmer (00:10:18):\nYeah.\n\nLenny (00:10:30):\nYeah, that's interesting. So you mentioned YC and this kind of is a good segue to where I want to focus most of our time. You mentioned that you've worked with over 600 companies at this point, which is absurd. It feels like it's you get some statistical significance on takeaways at this point of what works and doesn't work. So I have just a bunch of questions about your experience working at YC and with all these companies. The first is I think about this quote that Elad Gill tweeted once and he wrote, I think, a post about it. Elad Gill is a legendary angel investor. He said that starting a company is an act of desperation. You're either desperate to change the trajectory of your career or you're desperate to make a bunch of money, you're desperate to achieve some kind of mission or build a specific product that you're just like, \"I need this to exist.\" I'm curious if you agree with that sentiment and then I have a follow-up question around that.\n\nGustaf Alströmer (00:11:20):\nYeah, actually I haven't heard it before, but you know me, I'm an optimistic person. I think it probably reflects on my view of this question, but I would say desperation sounds like a negative place that you're starting at. I actually think that most people to start companies start from a positive place. But the motivations, I agree with what he said, can be very diverse for successful founders, right?\n\n(00:11:41):\nSo we actually asked this in one of the early Group Office Hours sessions. We asked them, \"Why are you doing this?\" And we don't want to hear an answer like, \"I found this niche of the market.' That's not the why. The why is like, \"Why will you come in and work late after four years when you have no money left and everything's going to shit?\", right? Then the niche market is not the answer. There's something deeper than that. We've learned that it varies a lot for people's motivations to start companies. Some of them just want to solve some technical problem that they feel are passionate about solving. Some of them want to prove themselves in front of others or prove themselves towards themselves. Some have grand really important motivations to change the world and they will say things like, \"I want to give everyone water or I want to solve climate change or I want to democratize publishing.\" You can imagine any number of large ideas. Some people just want to start a big company and just want to be successful.\n\n(00:12:44):\nIt doesn't matter, in my experience, what your motivation is. I don't think either of these motivations. It sounds like some of them will be better than others. In my experience, it's not the case. The motivation will change over time to just running this thing, right? Like once something becomes big, it's hard to think every day about exactly why you got started because the motivation is just like it can be fun and work on boring things because it's fun to build something big. Everything doesn't have to be shiny and big and grandiose because there are many ideas that are \"boring,\" but just the idea of running the company becomes the motivation eventually.\n\nLenny (00:13:17):\nThat is really interesting that one of the main things you look for, it sounds like when you're interviewing, is how strong and durable is that drive to build this company. Is that what you're saying?\n\nGustaf Alströmer (00:13:26):\nIt's actually kind of hard for screen for motivation, I would say, in interviews because the purpose of this kind of Office Hour question is to highlight why someone is there and highlight the diversity of reasons people are there and sometimes even highlight from one founder to another co-founder why they are doing this. They might have never talked about this. Actually, surprisingly, often founders have not talked about why they're doing this. And just knowing why someone is here really helps with conflict resolution for example, really helps with understanding why someone is there on a certain day or something like that. So it's not something we screen for as much as I think we try to help founders discover this among themself and really know this about themself. I've just accepted that the motivations to start companies is widely diverse.\n\nLenny (00:14:13):\nDo you ever discourage founders from starting a company when you see that maybe it won't be a durable kind of lasting motivation or whatever other reasons just knowing how hard starting a company ends up being?\n\nGustaf Alströmer (00:14:23):\nIt's a good question. I would say sometimes if someone doesn't have a motivation or don't know why they're doing this, they're doing this because they read that it would be a natural career step. So a good reason to not start a company is if you think of starting a company as a career step. Well, it is not. Because if it's successful, it'll be your entire career. It'll be 10 years most likely. And if it's not successful, then it's not something that people generally aspire to start. So non-successful startups. So I think people will start companies because this is sort of something they want to put on their resume. They have not understood what startups are or why you should do them.\n\n(00:14:58):\nSometimes you can screen and kind of figure this out, but sometimes people don't even know why they're starting a company when they get started and it kind of gets figured out along the way. And that's okay. I don't want to discourage people who don't know exactly why they're starting this company just to start a company. They might figure out along the way and find the true motivation after doing this for a little bit or finding that it's really fun.\n\n(00:15:21):\nI think I discourage people to start startups if they have so many other things that are important than their life that are more important than the startup. So if there are financial constraints or family constraints or relationship constraints and they are going to trump this, then yeah, you should think a second time perhaps because startups are hard. They're much harder than a normal job. Equally hard if they're successful or failure, right? There's no middle way, we're like, \"Oh, my company is doing great so I can chill.\" That doesn't work that way either. So I don't really discourage or encourage people, I just want them to have all the information.\n\nLenny (00:16:03):\nYou mentioned YC Office Hours and I had a question around this. I'm working on this piece where I'm interviewing a bunch of B2B founders of companies that are doing super well and I asked them a few questions like, \"How'd you come up with the idea? How'd you find your first few customers?\" it's shocking how many of them bring up a conversation in YC Office Hours as the most pivotal point that set them on the trajectory that they're on now. I'm curious what happens in these Office Hours? What are the most common pieces of advice that you give or maybe most surprising pieces of advice that you give in these Office Hours so that people can get maybe a glimpse into these conversations you have?\n\nGustaf Alströmer (00:16:43):\nSo at YC we have two type of Office Hours, two of the common ones. We have regular Office Hours, which is usually a one-on-one or basically the founders talking to me, or me plus another partner. They happen every week or every other week throughout the entire program. And they happen years after the program on the regular basis. Then we have Group Office Hours, which is you and six or seven other startups talking to us. They have [inaudible 00:17:07] a little bit different purpose. So the goal of the regular Office Hour, I always ask the question, \"What's holding you back from moving faster? We don't want to hear updates, we don't want to hear strategy questions. We want to understand what's slowing you down or what's holding you back from moving even faster. You generally have a specific goal.\"\n\n(00:17:27):\nAnd I think that question of what's slowing you down or were holding you back crystallizes the priorities. There are only so many things you can do as a startup and there are only so many things that matters at that stage. And by asking that question, we can start digging into, \"Okay, what's the goal? What are the things that drives towards that goal? What are the things that's slowing you down towards that goal?\" Usually, the founders don't know what's slowing it down, so the conversation and us probing questions actually leads to us or them discovering what it is just slowing them down.\n\n(00:17:59):\nIn the Group Office Hour, it's a little bit different. The Group Office Hour holds a couple of different purposes. One of them is if I think back on Paul and Jessica's motivation to start YC, this is a surprise to them, but starting a company is incredibly lonely. You can't really lean on your employees and say, \"Hey, I'm feeling really shitty as a founder today. Everything is going to shit.\" Employees isn't going to take that well. So you lean on perhaps your investors, but they're not really available. But what you can lean on is other founders because they're all in the same situation. It's sort of like when you ask a founder the question, \"How are things going?\", it's so emotional for them to answer that question because it's never going well, right? It's never like, \"Oh, everything is going fantastic.\" They might say that, but everybody knows all founders, when they look each other's eyes, then no, that's not the answer.\n\n(00:18:48):\nSo founders have infinite number of problems that they're thinking about all the time, which is why they're allergic to the question, \"How are things going?\" But when YC started, we put all the founders in a group together in a room and they started learning that all founders, all companies are broken in some way, right? They're all having these massive problems and they're all feeling that anxiety when they hear the question, \"How are things going?\" And just hearing other founders explain their problems, perhaps solving their problems, is a really good way for yourself to both feel motivated to do it yourself and see how problems get solved when other companies are having similar problems. Nowadays because of the scale at YC, we group companies together that have the same problems or the same area that they're operating in.\n\n(00:19:30):\nThe second thing that Group Office Hours do well is accountability, right? We ask you, \"What were your goals? What were your goals for the last two weeks? Did you hit them?\" And then that gives founders accountability because founders are competitive. They don't want to look bad. They don't want to come back after two weeks and say \"Nothing worked,\" or at least like, \"We didn't learn anything.\" They want to learn something and make progress whether it's positive or negative.\n\n(00:19:54):\nGroup Office Hours to me is the most magical moment because it really creates this very intense three or four month period. Founders often come back to us afterwards and say, \"Hey, we want to do that again. We don't have this really intense, really productive period. We don't have a program exactly. We have other programs, but we don't have anything exactly that mimics that experience.\" But we do encourage founders to continue with Group Office Hours after YC. Many of them do and many of them, ad hoc, continue to meet for years in this group setting where they ask the same kind of questions to each other, to hold themselves accountable, to learn from each other, and to just have someone else to lean on. I think this was unknown and somehow the world didn't know before that starting company is super lonely and you have all these anxiety. By just talking to other people who have the same problems, it's just one of the best thing you can do.\n\nLenny (00:20:45):\nThere's so many things that come up when you talk about this. One is I had a startup at one point and we worked in the coworking space. We joined the coworking space because we're like, \"Oh, we'll meet other founders. It'll be social, we won't be alone.\" But it turns out everyone's just heads down, headphones on, \"I don't have time for anything. I just need to work.\" It's like a microcosm of that experience that even if you're surrounded by founders, no one has time to do anything. They're just working.\n\nGustaf Alströmer (00:21:09):\nYou got to schedule it and force it and put the laptops on the floor and the phones on the floor and you just sit there with pen and paper. That's how you have to do it. We tried to mimic that as much as we could over Zoom. But honestly the best experience of this was in person, in a ring, in mountain view with no computers and everyone just paying attention to everyone. That was the best experience. Yeah, that's what I remember is one of the most meaningful parts of YC. I didn't have it myself when I did YC, but now everyone has it.\n\nLenny (00:21:36):\nThe other thing that's made me think about is someone tweeted once, \"Don't ever ask a founder how they're doing or how it's going. It just creates all this anxiety because nothing's ever going great.\"\n\nGustaf Alströmer (00:21:44):\nDon't do it. Everybody looks at each other's eyes and they know that they're allergic to that question.\n\nLenny (00:21:50):\nThat's hilarious. So just to summarize the questions you said you asked, the one is in the individual Office Hours, is what's holding you back. And then in the group setting, what was the question again that you asked?\n\nGustaf Alströmer (00:22:01):\nWhat are your goals for next two weeks and what were your goals for the last two weeks and did you hit the goals? And if you didn't hit them, what came in the way of hitting the goals? It's very simple. That can uncover lots of problems that other founders are having exactly in the same way. Just by talking about the things that held you back or the things that allowed you to hit your goals, uncover something material for the other seven companies doing that in the ring.\n\nLenny (00:22:26):\nIf you kind of zoomed out a little bit and thought about the startups you've worked with, what would you say are the most common mistakes that early stage startups make broadly?\n\nGustaf Alströmer (00:22:36):\nThere's so many. I mean, this is how I initially learned about startups, by searching for that on Google and landing on Paul Graham's articles because he kept-\n\nLenny (00:22:45):\nWow.\n\nGustaf Alströmer (00:22:45):\nI think I've written many articles about this topic because it is so common. So this topic can go on forever. But if I take the most recent experience I've had in YC, I would say startups fail, one, because they don't talk to customers. And if you don't talk to customers or users, you don't actually know what's important. If you don't know what's important, it doesn't matter what you build, it doesn't matter kind of what ideas you have in your head if you don't actually know what it is that you need to build and you don't validate with customers. That's where a lot of the failure stems from. A lot of early YC for us or early part of the program is us pushing and probing founders to be like, \"Tell us about the conversations you've had with the customers. What did you learn? Can you show us the organizations?\" Or like all these questions, like, \"What are the software they're using? What are they paying for? What problems do they have? How are they describing the intensity of that problem?\" So that's what we spent a lot of time early at YC.\n\n(00:23:43):\nAfter that, I would say one of the commons mistakes in... I'm not talking about generally startups here, I'm talking inside YC. The second most common thing I see in YC is people are just afraid to talk to customers. They're just not trying hard enough to get in front of customers. I think this comes from, technical people tend to think that software is just sort of solution to everything. But really what you should need to do is to talk to someone over Zoom or over phone or in person, even better. People are just afraid of doing that and they're afraid of being rejected. These are common, people that want to build good products are just really afraid of people saying no.\n\n(00:24:25):\nThe problem is, which anyone who hasn't done sales before that joined YC, they realize this, is that if you take the average customer group in the world, 90% are not early adopters. It doesn't matter if you have something new and cool, they're just not interested. They are not incentivized to take risks in their job to try something new. They're just incentivized to not take risks and just continue what they're doing. Those 10 percents are the early adopters. They're The ones that you actually want to reach. But that means you have to reach 10 to find one. And then you convince that one person to get on the phone or a video call with you. And that takes work and it takes a lot of work. I think people don't really think of this. This is common knowledge, basic stuff for salespeople, but founders should never done sales before just get surprised by the percentages and the sort of what it means to do this.\n\n(00:25:12):\nIf I think of more generally outside of YC, so these are two kind of things I experience within YC, but I think generally outside of YC, I would say the two most common problems the same one is not talking to customers, the other one is not being technical and not knowing what it takes to build successful technology company. It means having technical founders and it means being able to build the first prototype. This is something we screen for when we interview people in YC and we aren't accepting a whole lot of team that don't know how to build or get their first prototype built themselves because we know it is a super common value pattern.\n\n(00:25:50):\nI can go on and on and on and on for this one, but honestly if I drill down what makes companies fail, it's quite simple. It's just like they don't talk to users, which means they don't find product market fit. And if they don't find product market fit, nothing else really matters. What mistakes do people make is it is all about that. It's all about talking to customers and learning that you're building something that's actually useful. YC Slack headline is make things people want, and it's still true and it's always going to be true.\n\nLenny (00:26:23):\nThis is really interesting and good advice. It's interesting that... Like, \"Talk to customers,\" people hear that all the time. They're like, \"Of course we're going to talk to customers. We're going to do that of course.\" And your experience is they know this but they just don't do it probably because they're afraid. Maybe also because they think they already know what they need to build and it's like, \"Yeah, we're good.\"\n\nGustaf Alströmer (00:26:41):\nAnd you have all these validators, right? So the people are validating that even if you don't talk to customers, why has he accepted you? This investor invested in you. This investor said you were great, like blah blah blah. All these different validations that you confuse with product market fit, right? We have to remind everyone on the first day in YC, \"None of you have product market fit because you probably don't,\" right? Almost nobody has. Because people confuse this external validation with the thing that matters the most, which is talking to customers and learning what matters. It's just like a thing that just keeps coming back. Some get really good at it. And that is the source of successful startups, is when you really get good at this.\n\nLenny (00:27:21):\nIt reminds me coming back to Airbnb, one of the most important moments in Airbnb history was Paul Graham telling the founders of Airbnb, \"Where are your customers?\" And they're like, \"Oh, they're in New York\" and he's like, \"Why are you talking to me and not in New York right now talking to them?\" And they talk about that all the time.\n\nGustaf Alströmer (00:27:35):\nYeah, it's absolutely true. I think he wrote the article Do Things That Don't Scale as a learning.... The learning there was the Airbnb founders doing the trips to New York and learning about how to build Airbnb, which is a very counterintuitive idea, which is when you have to spend the most amount of time with your customers. I think Airbnb is sort of one of the best stories inside YC of doing this well.\n\nLenny (00:27:57):\nThis also reminds me, I've been talking to a bunch of founders recently. I asked them, \"How many customers have you talked to help figure out this idea?\" So just the other day it was 150 financial CROs that they talked to before they actually started raising this round. Another company, actually two Airbnb guys that started, they actually ran ads I think on LinkedIn to find specific people to talk to and that specific role. And they talked to probably at least 100, maybe 200. So there's a strong correlation there.\n\nGustaf Alströmer (00:28:26):\nYeah, I think that's the volumes that people don't expect. They think they might have to talk to five, but I think you have to talk to 25 to 50. That means you have to reach out to a lot more to be able to get to people that are potentially early adopters. Those ones you talk to are also the ones that become your customers. So you are already doing most of the sales by just doing this work anyway.\n\nLenny (00:28:45):\nDo you have maybe one tactical tip you could share of just either getting over your fear of talking to customers or just holding yourself accountable to actually doing it?\n\nGustaf Alströmer (00:28:55):\nYeah, I tell this story, I actually told this story yesterday. So remember when you sign up first service that's a cool service and you hear about in TechCrunch or something like that and then you realize you already signed up a year ago, right? And then from the founder's perspective, you sign up to something you never used it. So the founders who build those services, their inclination to think is that \"Everybody hates me because they sign up and they never use me.\" They never use the service. The fear of that is that basically the fear of rejection. So if I put my thing out there and most people won't use it and they will tell all their friends how shitty this thing is, you should never even sign up for it, that's the fear people have, but the truth is that people sign up for it and be like, \"Oh, I'm busy. I got something else to do.\" And they actually don't remember or care.\n\n(00:29:43):\nSo whenever you sign for something that you signed up a year ago, think of yourself that that is the common customer experience, which is that you just sign up for a lot of stuff you don't even remember you. You never have this, \"I hate this thing' reaction. You always have this like, \"I'm indifferent to this thing. I don't actually care to even complete the sign up flow or try it out,\" right? I think that's the thing that people need to remember, is that the worst thing that can happen to startup is not that people hate what you're doing, it's that they're completely indifferent to what you're doing. It's not the worst thing, but the most common thing that happens is people just is indifferent. But it doesn't give you a second chance. Let's say, it always gives you a second chance and you really need to internalize that people have busy lives and if people don't actually use what you're building, that's fine. You can reach out to them a year from now or six months from now or two weeks from now and they probably will if you make some improvements.\n\n(00:30:37):\nI think people just have this fear that, \"If I get a lot of rejection, that means everything is bad.\" But the rejection should be put in context to the early adopter idea and that most people who don't care are not early adopters, who don't want to dig into new things. And that the more narrow of a solution you have to a specific problem, the fewer people actually want to dig in. But that's where you have to start because you cannot build the whole thing right up front and make everybody loves you. That doesn't really work that way.\n\n(00:31:07):\nEven Airbnb was like air mattresses or staying in someone's homes when they're home. That was not the complete solution of Airbnb. But there were early adopters who dug in and be like, \"Yep, I like that. I like those two things. I want to have people stay in my living room in my mattress.\" But that's not what Airbnb is about today, and a lot of those things were unknown at the time. But I think people are just afraid of rejection and you just need to overcome that fear and just learn that there's nothing that's really that bad that can happen when people don't use the service or sign up and don't care. It's not really that bad.\n\nLenny (00:31:42):\nIt reminds me of a quote that I always love for Mark Andreessen, that everyone's time is already allocated. They don't have space for your product right now. They already have plans for their day.\n\nGustaf Alströmer (00:31:42):\nTotally.\n\nLenny (00:31:51):\nAnd it takes a lot to convince someone to pay attention to anything. I guess that just comes back to why it's so important that your product is solving a real pain and not just a nice little toy that is better than what's out there, but not so much better that you're like, \"I need this right now.\" So maybe just along those lines, do you have any thoughts on just the importance of that pain and just how critical that is?\n\nGustaf Alströmer (00:32:15):\nI actually recorded... I'm happy of these videos, but I've recorded two videos on YouTube as part of YC Startup School last fall. You can go watch them on YouTube right now. One of them is how to talk to users and the other one is how you sell or how you use sales. The one about talking to users, I think there's a difference in asking someone, \"Do you have a problem with X, Y, Z? Is this podcasting setup working for you?\" And people say, \"Yeah, it's kind of working.\" But if you are a podcasting setup experts and you watch people use some other thing that's really shitty, they might also think that it's pretty good. But you have to watch them do it. And the best way for you to figure out what is the intensity of the problem is not to ask them but to watch them or to watch them solve the thing that they do.\n\n(00:33:06):\nYou know how a lot of non-technical people don't know how to automate things? So they will do the same thing in Excel like a million times by just tapping because that's the only thing that they know and they're not technical enough to write some kind of script to do it, and you just have to watch those people to just feel the pain. You can't actually ask them how difficult is it to do X, y, z because they won't even know that it's that difficult to them. So the best thing I've learned about how to discover the pain is to watch people, have them screen share, have them walk you through their daily workflow about the area where you're doing some discovery. That is the best thing.\n\n(00:33:43):\nI'll give you another example. So there's a bunch of waste companies that are doing EV charging for electric cars and they're like, \"What are the problems in EV charging?\" And I was like, \"Just rent an EV and go and charge at all the non Tesla chargers and see what they say, see what you experience.\" And the truth is that it's just like garbage. A lot of EV charting systems are just so shitty and the apps are terrible. You just have to just use them yourself to know how bad it is.\n\nLenny (00:34:13):\nIt's cool how often it just comes back to, \"Just go do the thing. Do things that don't scale.\" Classic YC advice. I want to come back to something you mentioned that I want to pull a thread on as the technical co-founder, being technical early on, just to cover that. So I know YC looks to... Having a technical founder is an important variable in you're deciding to accept a company. Say someone doesn't have a technical co-founder, do you have any advice for what they could do, like what often can work?\n\nGustaf Alströmer (00:34:41):\nYeah, I think the first thing is to understand the value of technical co-founder. So some people who are in this situation where they have an idea of something they want to build and they don't have anyone to help build them in building it, I had a friend Paul who gave this incredible quote, he said, \"I have an idea for a song, I just need a musician to help me make it,\" right? That's kind of similar to how it is with engineering. If you view output of engineering as like, \"I just have an idea for a song, I just need someone to actually make it for me\" and then you're not valuing software engineering or mechanical engineering or any engineering skill set deep enough, right?\n\n(00:35:17):\nThe truth is that the engineering part is the really hard part. The first thing I would say is you need to learn how to value the engineering piece. Let me give you an example of how you don't do that. You applied to YC and you have 90% for yourself and 10% for the engineer. You're basically saying that like, \"Oh, the engineering part of this company is only worth 1/10th of me. I'm the non-technical person.\" So that to me is a signal that you're not really valuing engineering.\n\n(00:35:44):\nOkay, so how do you go out about and find someone? Well, the truth is that there are a lot of technical co-founders. The technical people, they also want to find business co-founders. They don't want to do other part. They don't want to do sales and they actually don't really care that much about fundraising. They just want to solve the problem. And that's fine. We built something called co-founder matching where those funders can meet, but if you don't participate in that, you can just start by asking the best technical people that you know. \"Are you interested in starting a company with me?\" Same thing with rejection. Many of them will just say, \"No, I have a great job, I'm really happy.\" But some of them will have thought about starting a company for a while and was hoping that someone would come and ask them to do that. So you have to remove your fears and go and ask the best people.\n\n(00:36:29):\nThe reason you want to have a technical co-founder and not a hired engineer or not a hired contracting team is because so many of the decisions you're going to make are technical and so many of the iterations you're going to make relies on engineering. And if you don't understand that, you won't actually make the right decisions anyway. It's not like service. You have an idea for a product, you build a product and you're done. There's infinite number of iterations in that process.\n\n(00:36:54):\nAnd then finally, I would say a lot of people learn how to code themselves, right? So there are a lot of places online that you can learn the skillset that takes to build a prototype. You might not be the best engineers. So there are many successful startup founders who are not the best engineers because they stop coding when they hire three or four engineers, that's fine. But you need to be sufficiently good that you understand the value of engineering and that you understand that the best way to solve most of the problem is with software. There are a lot of founders who just, for whatever reason, study something else that doesn't have to be a conscious or very precise reason that you had when you were 18 or 19 and then you're 25, you're like, \"Oh, I wish I know how to code\" and then just learn to code and they learn how to code. It's not that more difficult than that.\n\nLenny (00:37:42):\nHave you ever seen a startup work out if they had a contracting firm, like engineering firm build a product? Does that ever work or were you just like, \"No, do not ever do this\"?\n\nGustaf Alströmer (00:37:53):\nBasically, I can't recall any specific ones where people have a contracting firm but I've recalled founders where let's say you had two non-technical founders, but they valued engineering and they had an ability to build a team of great people that were not co-founders and they gave them equity and they become successful. There are many examples of that I would say, but I don't remember any specific examples where you had a contracting team building the whole thing. I think the reason for that is it takes more than just sort of riding a spec to build a product. You can't actually spec yourself to a great product. You have to just be part of the iterations yourself. That's why I think someone being the engineer, having the idea of what iteration looks like and just doing it is how you do things.\n\n(00:38:38):\nI think that the cases where I've seen non-technical founders make this work is that they have really good engineering teams who feel like they're founding team. It might not be co-founders per YC-7 definition of having 10%, but they feel like they're the bonding team.\n\nLenny (00:38:52):\nThis reminds me of a story of just the recent podcast interview I did with the CPO of Calendly. She talked about how when Calendly started, they actually had a Ukrainian dev team built the first product. Not only did they help them build the first product, they actually ended up driving all the growth initially because they saw Calendly and started using it within their firm.\n\nGustaf Alströmer (00:39:14):\nWow.\n\nLenny (00:39:14):\nAnd then everyone that they knew started using it and spread within Ukraine and they actually continue to work with that firm. They're still the [inaudible 00:39:20] team for Calendly or some part of it.\n\nGustaf Alströmer (00:39:22):\nWow.\n\nLenny (00:39:24):\nYeah\n\nGustaf Alströmer (00:39:24):\nWow, that's cool.\n\nLenny (00:39:24):\nThere's a success story.\n\nGustaf Alströmer (00:39:26):\nI mean, I would say it's certainly the case that in some countries people have other jobs while they start the startups, so like the engineers. In Ukraine for example or in Eastern Europe, it's very common that if they start their own startup, they actually have a full-time job as a contractor while they're starting the startup because that's how you pay the bill because often you can't raise money. And that's fine too.\n\nLenny (00:39:46):\nAmazing. That's some hustle.\n\n(00:39:49):\nThis episode is brought to you by Pando, the always on employee performance platform. How much do you love the performance review process? Yeah, it's time-consuming, subjective, biased, and there's rarely any transparency. With the rapid shift to distributed work, it's a struggle to create the structure and transparency that you want to help your employees have the highest impact and growth in their careers. Pando is disrupting the old paradigm of performance management, including a continuous employee-centric approach so employees stay engaged, see their progression in real time, and know exactly when and how they can level up. With Pando, managers can leverage competency-based frameworks to effectively coach and develop their teams and align on consistent growth standards resulting in higher quality feedback and higher performing teams. Visit pando.com/lenny for more info and get a special discount when you sign up and reference this podcast. That's pando.com/lenny.\n\n(00:40:47):\nI want to zoom out a little bit and ask another big question and see what answer you have for this. If you just think about the most successful startups in YC or even just the companies you worked with, if you had to pick just one or two attributes of what's most common across successful companies, what would that be?\n\nGustaf Alströmer (00:41:04):\nI would say the most common reason that I've seen founders succeed or companies succeed, it comes down to the founders and characteristics of those individuals. The most important characteristics of those individuals are they're really determined to win and they don't give up when things are hard and they have an internal motivation that's just really infectious to people around them, which is how they end up building really good teams around them. People are actually going to want to go and work for them. I have numerous examples of people like this where the CEO or one of the founders are just really inspirational people.\n\n(00:41:42):\nThe second thing I would say is they are technical. So that's kind of like they're technical enough. If I would grade companies on a scale of technical to less technical, more technical founders are more likely to succeed, I would say. And then I would say they figure out how to talk to users and move fast early on so they don't wait for permission from their investors or from YC or from someone else to make progress. They're like, every day or every week there's continuous progress. They're not doing this for someone else, they're doing this for the customers. They're not doing this for the investors, that's for sure. The investors are sort of in the way more or less. And they're just naturally focusing on the customers.\n\n(00:42:29):\nFinally, what I would say is the skill that's really attributed to great founders is excellent communication skills. So the ability to communicate really complicated ideas clearly, to enjoy the communication part, right? Enjoying communication is often kind of correlated with enjoying doing fundraising, which is an important part of some companies' success. Not all of them, but for some of them. I would say communication or storytelling is part of the same arc, right? And those are part of the same thing that actually motivates people around you. If you can communicate why you're building, what you're building and why it's important to the world, tell a story about that, that can motivate people around you to just want to follow you. I think it's rare that I've seen founders succeed where the founder isn't in some way an inspirational person or someone that is a good communicator. Most of the time, you at least have respect or you somewhere know that they're going to succeed, right? And that is what inspires you to be around them or be on their team.\n\nLenny (00:43:33):\nThat is a really cool list. So just to summarize, one, they have the strong will to win, and with that they're inspirational. They kind of pull people along and get people really excited. Two is they're more likely to succeed if they're technical and can build a thing. Three, they figure out how to talk to customers, don't wait, just start doing it. And they're just obsessed with that versus what investors want them to do and they don't want to talk to the investors to make time for the customers. And then excellent communication skills, which comes back to the first. They're able to story tell and get people excited. Is that right?\n\nGustaf Alströmer (00:44:06):\nYeah, I would say those are the attributes of successful things. To be a super successful company, there's something else that have to happen. Those things are not things you can put on a list because they are the outliers, right? If you look at startups on a typical YC batch, there'd be a couple billion companies. Those are the outliers. They'll almost certainly have all the things that we've talked about. Many other companies in the batch will have that too, but then what makes someone a true outlier is something that is unknown. That's why so many investors said no to Airbnb when they were not trying to raise money because that was an outlier idea. It was an idea that was not logical and did not make sense to most people. Those kind of ideas, the ones that end up succeeding often don't make sense to people. There's some reason that no one has done this before because they're just not natural next step of the world.\n\nLenny (00:44:57):\nThat's a great segue to a question I've been meaning to ask, which is, how good are you at predicting in a batch which startups are going to be the monster hits? So maybe like you and then just generally YC, how good are you all at knowing what's going to work out, is going to be the next Airbnb or Dropbox?\n\nGustaf Alströmer (00:45:14):\nI think the truth is that we're not very good at knowing what's going to succeed. Certainly we cannot figure out who's going to be the really successful company in the batch. That's not possible. What we're good at is knowing what failure looks like. What we sometimes like to tell founders at the beginning of the batch is like, \"If you fail, please do it in some new exciting way. Not one that we've seen 100 times.\" Because we have seen people fail for a large number of reasons. The best way for us to sort of not predict, but the best way for us to make more companies succeed is to tell them how they might fail, right? Be very direct and honest with them and say, \"You doing these three things, these things are likely going to lead that you won't succeed.\" And if we do our job well, most people get that feedback and they're on the track for succeeding.\n\n(00:46:06):\nNow, which of those companies end up becoming the best? There are so many things that are uncorrelated to being the best, and it's the things that people don't like. I'm in a hot industry, I was writing up on TechCrunch like, this investor started talking to me. You'd be surprised how many of the things I just mentioned are uncorrelated to outlier success, right? That's why it's so hard to actually do this. I think people really want these questions to be answered. People really want to believe that you can pick really great companies at the seed stage, but everything I've learned from the plus 600 companies that I've worked with is that it's just not that easy and it's maybe not even possible and certainly not possible when you talk about finding the outlier companies. I don't think it's that easy. And if it was easy, then we would accept a lot fewer companies. We just accept those ones, but it's just not that easy.\n\nLenny (00:46:59):\nDo you have a sense of which ones are likely to work out better than others? Or is it just like, \"We have 150 really unclear, but one of these, hopefully.\"\n\nGustaf Alströmer (00:47:09):\nOne good indicator is if each new Office Hour there is really exciting new stuff, right? We're not talking about the same thing we talked about two weeks ago or four weeks ago. They've already done that stuff, right? Like, \"Oh, I was trying to sell to these three customers. Well, they already bought it. I'm not actually talking to seven others.\" And now we are talking about a different price and different product because they're like, they want more of what we're doing. If I'm experiencing that, and that's like a consistent trend, then when people draw this revenue graph of this 10% weekly growth rate kind of situation, those are the companies that we attribute that to. It's like if you're able to make that progress on that short amount of timescale, you are on track to do something well.\n\n(00:47:51):\nNow, a lot of other things have to go well for you to ultimately be able to succeed, but progress on this weekly or biweekly timescale is a really good indicator of someone who'll succeed. To me, much better indicator than I am in this market or I'm talking to this investor or something like that. But those are much worse indicators of someone succeeding than I'm making progress and it's pretty fast clip.\n\nLenny (00:48:17):\nInteresting. And so what I'm hearing is at the beginning of a batch, we're just in a bet on a bunch of companies that have a lot of potential founders, technical maybe, they have the strong will to win and all these things. Through the batch, you're looking at the companies that are exceeding your expectations week to week in terms of progress that they're making.\n\nGustaf Alströmer (00:48:34):\nI mean, sometimes it could be different reasons that people are not making progress. But if you are making continuous progress, and I think Paul and Jessica said this, this was true early days in YC, if you are hitting your goals and you're making progress continuously, if that continues, that's a really strong correlation to some success. But again, going back to the question, can we predict who's going to be the best ones? No. And that's why we really focus on trying to meet people not to fail. Especially good teams can't fail. If you have a really talented team who's really technical in how to build a product but they make some other basic mistakes, like not talking to customers or something like that or trying to build everything all at once, I feel like it's our responsibility to make sure they don't make the basics mistakes that we've seen many times. We need to help them at least make some spectacular mistake that we haven't seen before. Then that's a high potential team. If someone's on a good track for a decent idea but they're still early, that's a really good potential.\n\nLenny (00:49:30):\nI have kind of a fun question that I wanted to try, which is kind of connected to this idea around attributes of successful founders and companies. So I had this founder friend named Flow, and he was asking me recently, \"If you had to think about the most successful founders, which attributes do they have?\" And he kind of gave me this list and it's kind of like two ends of a spectrum. So I thought it'd be fun to just go through this list and see, in your experience, which end of the spectrum, if any, are associated and correlated with the most successful founders. Does that sound good?\n\nGustaf Alströmer (00:50:01):\nSure. Sure. Let's do it.\n\nLenny (00:50:03):\nOkay. So the first is speed versus quality. Is there end of the spectrum where you find that most successful founders are either speed-focused or quality-focused?\n\nGustaf Alströmer (00:50:10):\nSometimes founders ask us this question, \"What should I focus on? Growth or retention?\" And the answer is, they're asking us for permission to not do one or the other. The truth is, to succeed, you have to do both. I would argue that speed versus quality, there's different level of speed and different level of quality at different stage of the company. But the truth is that you always have to move fast and you have to understand what the meaning of quality is, right?\n\n(00:50:35):\nSo I think I actually don't see that as a spectrum, but I would say if you move fast with talking to customers, you'll build something that have potential having quality because you know a lot about the problem. I think when people think about quality, they often think about, \"What is my personal definition of quality?\" I have a bar of quality, but quality to me of a good product idea, a good startup idea, has more to do with the customer think is valuable. And if you move fast by talking to customers and having customer learnings and know the problems, then you will actually come up with something that's high quality. So they're not at a spectrum to me.\n\nLenny (00:51:11):\nAll right. Let's try another one. Confidence versus humility as a founder?\n\nGustaf Alströmer (00:51:16):\nI don't think that they're on a spectrum. I think that learning to predict confidence as a founder is critical going back to this communication piece of motivating people around you, right? I wouldn't want to join a company where the founder's completely not confident in their own idea, right? Because that is going to shine through. An investor isn't going to want to invest in someone who's completely not confident in that idea. So learning to first build your own confidence for what you're working on and then predicting that confidence to the people around you I think is critical. A lot of people will have doubt around you. And if you're not predicting that confidence, it's not clear that anybody else will if you're the founder. You're the one who's have to do it.\n\n(00:51:58):\nI think that you can predict that confidence while having a strong sense of humility towards the people around you. But I think when it comes to startups, learning to have that confidence is an important piece of the early days, right? And especially if you're building something that's very difficult, that takes a lot of work and a lot of money, protecting the confidence that you will succeed is critical for everybody that's doubting you. And those doubting you is a lot of people around you, right? And you just need to have an unnatural amount of confidence to prove them wrong. I think, again, this is not on the spectrum with humility. In fact, the most successful founders are often the most... You cannot inspire people around you if you don't have a strong sense of humility. People don't actually want to spend time with you, which means they don't want to work for you or invest in you. Again, you need both, but they serve different purposes when you get started.\n\nLenny (00:52:48):\nTough gig this founder life. You got to got to be everything. Let's see if there's a big difference in this next one. Execution and tactics versus focusing on strategy and kind of higher level stuff. How deep do founders go that you find that are most successful?\n\nGustaf Alströmer (00:53:02):\nSo this one actually I have a strong opinion about. I think that the reason that we talk about strategy a lot is because it goes back to business school. The origin of business school was to teach people to join the corporate world. And in the corporate world, strategy matters, right? So when you join a big company, you're employee number 2,010 or something, then you probably might have a business school job where thinking about corporate strategy is an important thing. When you are a small startup, strategy does not matter because there's not that much a strategy as about. Maybe later on you might be fruitful to think about strategy, but strategy kind of assumes that you can do multiple things at the same time, which small startups cannot. They can just do one thing at the same time. So execution is the thing that matters for companies.\n\n(00:53:51):\nWhenever someone wants to have a strategy conversation, it assumes that they don't understand their priorities. The priorities is always a list from top to bottom where there's one thing that's more important than the others. You can't really have a strategy session about the other things because there's only one thing to work on. So to me, a clear answer here is the good founders are execution-oriented and they just continually have one priority of what they're trying to go for. And then they're just hitting that priority all the time and then new priorities will come up and you don't really have time to have a discussion about company strategy. Company strategy also assumes that you have product market fit because you already have something that's working. If you don't have that, then getting to people wanting your product, that is your strategy. You don't have any other strategy.\n\nLenny (00:54:36):\nAwesome. Okay. We found one that's quite different one on the spectrum or the other. How about autocratic and kind of like, I don't know, I think of Steve Jobs-like versus kind of consensus, collaborative driven, if this is a spectrum at all. And then where do you find founders might fit that are most successful?\n\nGustaf Alströmer (00:54:53):\nI don't know if I have an answer to that question because I think when you work at early stage, you might look different than when you work at late stage. I don't spend a lot of time with founders that have thousands of employees and hearing how they are in the... When I talk to those founders, I talk to them one-one-one and I only hear from their perspective. So I don't actually know how they're peering in a large corporate setting. But when you're a small company, you're three people or five people or 10 people, you cannot be an autocratic decision maker. The founding team have a founding team decision making dynamic that could look different. Sometimes it's like everybody decides together on everything and sometimes you say, \"I have my area of expertise and you have yours. We split it up, the decision making.\" Either of those things are fine. I think you just have to have a process so you don't rehash every decision after you made them a million times.\n\n(00:55:42):\nI would say the thing that matters the most at that point is to be willing to adhere to the process that you and your founding team have come up with. Your individual nature could be different in a different role in a different company. But for a startup to work out, you have to have a specific process on how you make decisions. Those are on a very short sprints, like weekly or biweekly. And everyone needs to feel good about decisions after the fact. At least they feel good about the process. I don't think that you can just decide... You can't also be fully collaborative, everyone gets decided about everything. So small startups agree on how they decide together. So after that, everyone just follow the process. That's usually how things work out.\n\nLenny (00:56:27):\nOkay, I got one more. Cares more about the product or cares more about the distribution and growth strategy?\n\nGustaf Alströmer (00:56:33):\nWell, there's a lot of assumptions built into that, I would say, because caring about the product to me is caring about the customers. Sometimes if I would say something like, \"Oh, great founders care about the product,\" a lot of founders misinterpret that as in my personal perception of the product or my ideas of what the product is. And that's wrong. The right perception there is the expectations or the use of the product from the customers. So if you are meaning focus on the product or cares about the product in that sense that your customers care about, then absolutely, I think that's a really, really critical, important thing to have early on, like talking to users, doing things you don't scale. Once you get big, if you don't figure out a scalable distribution strategy, you won't succeed. And those are different for different companies, but they're not doing anything that don't scale.\n\n(00:57:27):\nDoing things that don't scale is not a scalable strategy. Eventually, something specific will be the things that work for you. If you're lucky, people will talk about your product and you'll have organic growth. But in many cases, that sales, that is some kind of consumer distribution strategy. You can't start with that. I've seen a lot, and this is when I had to reset my thinking coming from a growth team joining YC, is you can't start a startup ethic with a growth team mindset because that is just scalable things all the time. And really what you need to go back to is doing things that don't scale and unscale your way of thinking about customers. But it's really useful to have the growth mindset once something is working, right? Once you have thousands of people signing up everything every day, well how do you get to 2,000? Well, that's probably something that looks more like this thing that the growth team would do or distribution team would do.\n\n(00:58:21):\nI would say everyone has different experiences of this based on their prior experience, right? So if you work for a company that was infinitely successful, then you won't care so much about this. If you work for Google, you'll never even think about this because distribution is just the website. But if you work for a really small shitty product, then you think a lot about distribution because that's natural to you on how you succeed. So I think at the end of the day, talking to customers matters the most. That is what it means to care about a product to me. And then distribution is something that you will definitely invest a lot in once something is working.\n\nLenny (00:58:53):\nAwesome. All right. I have probably a hundred other questions I want to ask along these lines, but I want to make sure we get to another topic which I know is near and dear to your heart, which is climate tech. So my understanding is you're instrumental in pushing YC to focus on climate tech as a focus area. I believe you led the charge on their initial request for startups I think is the term where you all put out like, \"Here's who we want to fund.\" I think you've mentioned you funded a couple dozen climate tech companies and the last few batches, is that all generally correct?\n\nGustaf Alströmer (00:59:24):\nFirst, request for startup was actually Sam Altman and a few other folks that was kind of that one who drove that. The second one that we wrote into our actual request for startup, I wrote that one, was carbon removal specifically focused on. And then naturally the people that apply with climate tech ideas get in my reading queue of applications and I read them and I interview them. Not all of them, but many of them. I think today we funded over 130 plus companies that are focused on climate tech in some way or another.\n\nLenny (00:59:53):\nWow.\n\nGustaf Alströmer (00:59:54):\nThe trend line is that really ambitious people who want to start companies in this area. Some of them want to start the companies because the climate tech is the number one problem, but they don't view this as a nonprofit. Now I want to really make this as a distinction. People somehow think that starting a climate tech company is doing good for the world, but it probably doesn't have a lot more than that. The truth is that the world have decided. Because climate is one of the biggest problems that we're facing, if not the biggest, we've decided that we are going to stop doing the things that we're doing and we're going to change our entire energy system and change all the things that we do that emits carbon. And we have just decided, governments have decided this. The question is how it's going to happen, but this decision has been made.\n\n(01:00:42):\nIn that transition, we're talking about trillions of dollars of money moving from things that cause climate change to things that don't. The scale of this transition is not something we've seen recently. Like software is not that big in comparison. It actually is much smaller than this transition. So I think if you look at something like Tesla, which now has, I don't know, $600, $700 billion market cap, that's just one company that currently provides a couple percent of all the cars in the United States, new cars sold. And that is already one of the biggest companies in the world and has now the biggest, richest person in the world. We've only seen the beginning of this. The economical motivation be behind the decisions that people are making are just as strong as I want to fix climate change because this is just a really good business. This change have attracted a large set of software founders that you and me know that listen to this podcast that said, \"My skills is relevant here. There are a lot of things that I can do. And if not, I can learn those things.\"\n\n(01:01:43):\nBut most importantly, the skills of working for startups is really, really critical to join this transition. A lot of them have started companies or joining companies. I still get an email every week from some accomplished software engineer who asked me \"Which software companies should I work for to fix climate change?\" And I've gotten those emails for two or three years now. This thing just attracts really, really ambitious people. It's not stopping. It's accelerating. I feel lucky to work with so many of these great founders because they are uniquely interesting people.\n\nLenny (01:02:16):\nI've noticed exactly the same thing of just how many smart, driven, amazing people are like, \"I just want to move to a climate tech company. That's all I'm looking for now.\" Just to give you credit, I feel like you are ahead of the curve on the shift that's started to happen and pushed YC to focus on this really early. I always think like, \"Man, I know Gustaf and I feel like Gustaf has made such a massive impact on the investment and focus in startups on climate.\" And so I just want to give you huge props for doing that and being so at the forefront of a lot of this.\n\nGustaf Alströmer (01:02:50):\nThank you. I mean, sometimes I'd say that it matters to someone who has the credibility of YC to start accepting these companies. It does matter. I remember when I spoke to Diego from Pachama in 2018 when he was starting Pachama, we were whiteboarding in YC. He was a YC alumni starting a different company. The word climate tech did not exist. People were unsure if investors would fund companies like these. Pachama's raised $60 million to have, I don't know, lots of big customers, lots of employees and it's clearly doing really well. But I think at the time of 2018 it was kind of unknown. One of the reasons it was unknown is we had this previous bubble, clean tech bubble, in 2008, 2009, 2010 that didn't work out because of a number of specific reasons and investors were just afraid of funding things because they had some scar tissue or scars from this previous thing that happened.\n\n(01:03:46):\nNow that turned out upside down. The number of new investors that are investing in climate tech is as big of a trend as any other trend we've seen in the last decade or two decades. There's just an enormous focus on the investing side. Most recently, me and another guy, David Rusenko, wrote this request for startup, a new updated, very detailed list of... I hope we can post it in the show notes, a very detailed list of ideas or areas where we think it might be worth looking If you want to start a company.\n\n(01:04:18):\nNow, we don't know what good ideas look like. We don't know. But we can tell you where all the areas of opportunity exist. We should go and look for good ideas. We wrote this because in response to all these people that come to us and say, \"I want to work on climate tech. I don't have a good idea because I don't have any specific experience in this stuff.\" And then we're just like, \"Don't work on these three things but go and work on any of these 25 directions.\" It already has generate a good response. I think it'll generate more response. But I think it's important for YC to tell the world that we look and fund these things. And that's always been the reasons we had requests for startups, is to let people know that these are things that we actually want to fund.\n\nLenny (01:04:58):\nI actually moderated a panel a couple weeks ago. This organization called the Climate Draft put together PMs that are in climate tech. A lot of the questions were just like, \"What kind of background do I need to move into climate tech startup to start a climate tech company?\" It's interesting, every single one again and again just said like, \"Your actual regular PM skills is all we need.\" There's a lot of people already at the company that are experts in the science and that's okay if you have no experience. They just need the business experience, how to operate, how to execute, standard stuff that PMs learn. And so would you agree with that that you don't need to have this deep background in science and climate to move into the space?\n\nGustaf Alströmer (01:05:41):\nYeah, I would say if you were working on a software company and even some of the hardware companies, that's probably generally true. Absolutely. It's much more valuable to have that background than to have this specific domain expertise background. Those are complimentary. But as a PM, having the solid PM background is the more valuable piece I would say. Being a competitive PM, coming from a really good culture of product management, knowing what good looks like, that's invaluable to some of these companies because in the past they weren't able to hire these people. So I agree with that 100%.\n\n(01:06:14):\nIn terms of founders, I've seen everything, right? I've seen people having some domain expertise starting a company and really succeeding. I've seen people who had no domain expertise and learned everything they need to know. Maybe they partnered up with someone who had a domain expertise and then succeeded. I've seen all of it and I actually think that you can succeed in either of these categories. You don't need the deep expertise. It depends really on all the area you're in. But someone like Pachama, Diego and Tomas did not have expertise in forests besides the personal experience. They just had a willingness to solve the problem and it really worked out for them.\n\nLenny (01:06:51):\nYou mentioned you have this list of areas you're excited about. I know we'll share in the show notes, but is there any you want to highlight, just like here's areas you're most excited about and want to fund and/or are there companies you want to mention that are super interesting and super cool in the space that people should know about?\n\nGustaf Alströmer (01:07:04):\nWe wrote the list and we are highlighting companies in each of the categories. I don't know if I want to highlight any specific categories, but I can talk about some of the things that we've funded in the past that has real legs. So here's how I generally think about climate tech. So we have to decarbonize all the things we do that emits emissions. That means we have to change a bunch of things in the world, change transportation, change energy, change homes, all of these things, or change how we heat homes for example.\n\n(01:07:35):\nAnd then there is carbon removal. Carbon removal is sort of like, well even if we do all of this stuff really well, it's probably not going to be enough. And because there's an opportunity and there's some evidence to suggests that we can actually remove carbon from atmosphere in some way or another, a lot of companies are also working on this at the same time. I would say we need to do both and they're not in conflict. We probably are going to need to do both. Well, we certainly need to do the first one.\n\n(01:08:02):\nOn the decarbonization side, there's infinite number of categories of our society where we met a lot of carbon, right? So I'll give you an example. Shipping is a really big deal. A lot of carbon emissions come from freight ships around the world. That's not obvious solution how you would solve that because the kind of oil that they run on is really cheap and it's a very low margin business and they don't have a whole lot of incentives to change besides what is coming down regulatory. So it's not a national solution where someone to be a cool, someone will build a test off ships and it just work out. But the two companies to be funded in that area, one of them is Seabound who is building carbon capture and removal for ships.\n\n(01:08:41):\nThe other one is Fleetzero who build electrical ships. Electrification is on and again and again and again and again and whenever it's being applied, turn out to be a more efficient way of doing whatever thing that you were previous doing with the combustion industry. It is almost no maintenance. It's cheaper to build. The batteries are more expensive, it's cleaner and it fits the carbon coal you have. There's just a bunch of benefits there, but there has limitations. Usually the limitations on electrification has to do with batteries. It's like how far can you go? Now that category is what I call the... Which is a very important kind of critical one, which is the carbon accounting and sort of the recommendation systems that help big company account for the carbon that they have and they are giving some recommendations of what you do.\n\n(01:09:25):\nSo I'll give you three examples. We funded Unravel Carbon, which is carbon counting software in Singapore, focusing on Asia, probably the leading one there. There's company called Carbon Chain, which is focused specifically on supply chain and shipping and raw materials, stuff like that out of UK. And then there's ANAI here in the Bay area. Who knows how this market is going to play out, but this market has carbon accounting customer demand right now, right? So all the large companies of the world have other either promised the government, promised their shareholders or promised the public, or maybe even the employees, they go into decarbonize. They don't always have an idea how to do it. These software platforms is like the plug and play \"This is how you do it.\"\n\n(01:10:07):\nAnd then I'll give you two examples of things you can go into if you don't have any specific domain expertise and just a good software engineer. There's a company called Enode. They are basically building Plaid for EV chargers and Plaid for home energy system. So if we imagine that the future of all homes or future of all charging of EVs is going to be a bunch of energy appliances that are run by small computers, they're all wifi connected, you can connect to them and do things, tell them to turn on, turn off, turn on when it's cheap, turn off when it's whatever, all these different things that are valuable for the energy grid. Then you need a software platform to connect with all of them. And that's what Enode has been building.\n\n(01:10:48):\nAnother related company is called Static. Static is the Airbnb for EV charging in India. The reason that you need something like that is you don't have Tesla charging. You don't really have public charting in general. People don't have outlets in their garage and they don't have garages. So you need to build a new bottom up EV charging system or platform, and that's what Static has been doing. They're actually building out public charging infrastructure as well, but they have their own app. So if you use a Static app, they'll direct you to all the Static chargers. I believe that they're the biggest or the fastest growing EV charging network in India, which is the second-biggest country, if not the biggest country in the world right now.\n\n(01:11:25):\nSo the potential of these ideas, even that they're doing well now is just infinite, such an enormous market. If you succeed in one of these things, I don't think we are going to have as many gas stations as we have today and different networks. We're not going to have the same in EV charging. It's going to be a lot more consolidated around the use experience of the end user and the app they open to do this stuff. So I'm pretty convinced that there's real big opportunities for software entrepreneurs to figure this out. There's some companies in the current batch that are focused on this too.\n\n(01:11:59):\nThe final one I would mention is Heart Aerospace. We have a Heart Aerospace and the Right Electric and a few others focused on aviation. Aviation is another big difficult to decarbonize. Heart and Right are focusing on battery electric planes. So they're basically making commercial airplanes that fly on batteries and flying electric motors and it's incredible to see.\n\nLenny (01:12:22):\nWhat a killer list. We're definitely going to include links to all these companies in the show notes. Something I was thinking about is, so one narrative violation you mentioned is that there's actually money to be made in climate tech. It's not impact-oriented market anymore. It might be worth chatting about why that happened, but the question I want to get to is also things are going well. A lot of progress is being made. People see climate change and it's like we're dead, it's game over. But it feels like battery prices are coming down, solar's coming down, wind powers ramping up, all these startups are investing. So it'd be fun to just hear what's going well and maybe what is there to be optimistic about, but then also, \"Okay, yeah, things are going well, but there's still things that are not going so great and where we need to double down.\"\n\nGustaf Alströmer (01:13:10):\nTwo specific things that went well in the last say 12 or 24 months. First one was politics. So in the United States we got the IRA, which is like it's called the Inflation Reduction Act. It makes sense because shift into greener energy is going to actually reduce inflation because it reduces energy costs. But it's really a climate bill, right? It really is a bill that is focusing on onshoring, a lot of supply chain for the green economy and incentivizing a lot of this change that we just talked about. Whether it's carbon removal or home energy or home heating, whatever it might be, this bill addresses all of it and is massive. So that's one really good news. Politics didn't have a lot of good news in the US for a long time on this. Maybe not ever actually.\n\n(01:13:52):\nThe second good news, and it's such a good news that Europe is now trying to conquer. They're not trying to counter the IRA with their bill because they're seeing some of the battery companies saying, \"Well, I'll actually going to build the next factor in US, not Europe anymore. I changed my mind.\"\n\nLenny (01:14:05):\nOh, wow.\n\nGustaf Alströmer (01:14:05):\nSo Europe now has to counter with their incentives as well. The second good news is corporations are now customers. So maybe three or four years ago you went to a Fortune 100 company and you're like, \"Hey, do you want to buy my XYZ decarbonation solution?\" What it's like? The software platform or EVs or whatever it might be. They're like, \"Well, talk to this person on this floor. Maybe they can help you.\" And this person was not really empowered to make decisions. That has changed. Now they're like, \"Actually, we promised our shareholders to reduce emissions by 2% every year and we also promised the government and we promised whatever publicly to do that. So we got to do that.\" They're like, \"Where do we start? What's the first 2% that we got to decarbonize? Maybe that starts with energy. Oh, we'll change our energy providers.\" But they are now showing up as customers, not just with LOIs but paying actual for contracts, right? Doing investments in these companies because they've all see the future and they don't want to be behind.\n\n(01:15:02):\nThere's financials motivations for this. They want to get access to capital that has some strings attached to some of these things, but they don't want to fall behind. And then they don't want to be the Toyota to Tesla, where Toyota said, \"We are not going to do battery electric.\" It's just like they're still saying that sometimes and everybody else is like, \"Tesla is the one we got to copy because that's the one that's winning.\" All these corporations are really afraid of being the Toyota. They're really afraid of being the last one who's not changing and then the world will move past them and then they're going to die. So I think the motivation here is intrinsically survival and it's really about sort of adopting this because this is where the world is going.\n\n(01:15:39):\nI think these are the two best news. The thing that I think what... We also wrote about this in the request for startups. This is not a thing where you can convince everybody to just agree with you. And even if you did, people wouldn't know what to do. So you have to view this as an economical opportunity and say... We can't convince everybody that this is going to be the thing that's going to happen. It doesn't actually matter if you convince everybody. What matters is that sufficient amount of corporations are convinced that they change their habits. And then you can sell the things you're building to them.\n\n(01:16:09):\nAs sort of founder, just focus on your customers and focus on B2B. That's what most people I recommend to do here because that's where most of the change is going to happen. That's why I'm really optimistic about these startups and these founders. What they're doing is, in my opinion, more impactful than someone running a campaign trying to convince some other people that this is a big problem. Even when people know that climate change is problem, they don't know exactly what to do about it. But the startup founders, they know.\n\nLenny (01:16:37):\nYou touched on this, but it feels like one of the biggest shifts is capitalism is kicked in and is now leaning into climate tech startups and that's-\n\nGustaf Alströmer (01:16:46):\nYes. Absolutely. Absolutely.\n\nLenny (01:16:48):\n... making a big dent. Well, with that, we've reached the final part of our chat, which is the very exciting lightning round. I've got six questions for you. Are you ready?\n\nGustaf Alströmer (01:16:58):\nYeah.\n\nLenny (01:16:59):\nWhat are two or three books that you recommend most to other people?\n\nGustaf Alströmer (01:17:04):\nThe first one I recommend, I think I have it here. Yeah, this one. It's called The 100% Solution. It's written by Solomon Goldstein-Rose. It's for people who think climate change is a problem but don't know what to do about it, or they're just kind of in despair or think they're like, \"Ah, everyone are going to die,\" right? There are some books written where the outcome of the book is like, \"We're all going to die,\" but the truth is that we're not all going to die. This book is trying to cover the 100% of all the solutions in detail, kind of much more detailed version of the request of Sharp that we wrote. It gets you freely optimistic. And I give that to anybody who's cared about climate change because it really lays out this from a very optimistic way of looking at the world. And that's why I recommend that book more than almost anything else. That's probably my number one book.\n\nLenny (01:18:00):\nAmazing. I love that if just a one book, here's the book you got to read. I like that approach. What's a favorite recent movie or TV show that you've really enjoyed?\n\nGustaf Alströmer (01:18:10):\nOh, I watched so much. I don't know. I love Emily in Paris on Netflix. I think I have TV serves different purpose for me these days. It's just like entertainment.\n\nLenny (01:18:22):\nYeah, I get that.\n\nGustaf Alströmer (01:18:24):\nBut what else movie do I watch? We watch the Everything All at Once. I thought that was a really good movie. That was-\n\nLenny (01:18:30):\nYeah, it might win Best Picture.\n\nGustaf Alströmer (01:18:32):\nYeah.\n\nLenny (01:18:32):\nWe have a drinking game here. People say White Lotus, we drink. And so you did not, that's probably for the best. Favorite interview question that you like to ask YC founders when you're interviewing them?\n\nGustaf Alströmer (01:18:43):\nWhat have you done since you applied to YC on your product? What are specific things that you've accomplished since you applied? Because that usually is a month or two month months ago.\n\nLenny (01:18:51):\nThat's awesome. It connects so much with what you said earlier.\n\nGustaf Alströmer (01:18:55):\nI hope the answer is like, \"Here are all the things that we did.\"\n\nLenny (01:18:59):\nVersus we just prepared for this interview.\n\nGustaf Alströmer (01:19:01):\nExactly. Exactly.\n\nLenny (01:19:02):\nMost out there wild startup you have funded?\n\nGustaf Alströmer (01:19:07):\nI think I would say when I stepped onto the hangar floor of Heart Aerospace. I can send you a photo. Literally, I am looking at an airplane that's being made and I'm like there's no SaaS company's office you can walk into and you just open your mouth and you're like, \"What the hell is this?\" There are a few of those companies that are space companies or airspace companies or something like that where it's just a different feeling that you fund them and you can touch it. I have a lot of appreciation for things like that now because they're much harder to do, but when you succeed, they're much more tangible and you can be like, \"I have a tiny little piece in this space rocket or this airplane that we funded or this satellite above us.\" I really think that that's in some way a strong legacy compared to some other things that exist and just replace other softwares. And all these are better businesses, but there are strong legacies.\n\nLenny (01:20:06):\nWhat's a pro tip for applying to YC?\n\nGustaf Alströmer (01:20:09):\nPro tip. Number one thing is go to YouTube and type in like... I think there's a video that we've recorded which is about how you succeed with your application [inaudible 01:20:18]. It's an hour long video that gives you all the pro tips on how to do it. We told people in advance, \"Once you've watched that video, then see if you know anybody who've done YC and then reach out to them and maybe ask them if YC is right for you, but also ask them what's important for you to, as you kind of approaching applying to YC, writing the application, during the interview, what were the things that matter?\" Those are probably the two things I would do.\n\nLenny (01:20:46):\nFinal question, what's one pro tip for visiting Sweden?\n\nGustaf Alströmer (01:20:49):\nFirst of all, you should visit in the summer. It's a really good time to be there. It's a very different country in the winter. Try to go outside the cities into the nature and then prepare yourself for Swedes not all being Americans. They're a little bit more colder and have a little bit more distance to you and they don't randomly talk to you like I've learned to do here in America. I think you just have to go along with a little bit different of a vibe than you have here in the US. Most people actually love it. Most people who have just been, they love it, but most of them go in the summer.\n\nLenny (01:21:23):\nThis reminds me, I wanted to close it, but there's a tweet once about how in Sweden when you go to someone's house, they don't feed you. It's not expected that you will have food. You have to bring your own food. Is that true? And what's that about?\n\nGustaf Alströmer (01:21:35):\nIt's absolutely true. I actually gave an unconference talk about this topic. The unconference talk was all of the strange things to Swedish people do and why. If i would summarize it, yes, we do that. I actually experienced that. I went to a friend's house and they had dinner and I waited in my friend's room while they had dinner. That was just normal. And why did that happen? I think there's a strong sense of individual responsibility in Sweden, which kind of reaches over to unfriendliness, [inaudible 01:22:10] from an American or foreign lens because this is so crazy. But in Sweden it's just like, \"Well, you take care of your kids. I'll take care of my kids.\" And it's not really a question.\n\n(01:22:18):\nI think that a lot of the motivations of why Swedes are strange, one of them is we don't want to be indebted to someone else. So we never want to feel like... Which is why you wouldn't... For example, if you go to a bar in Sweden, you don't buy a round, you buy your own beer because maybe you have to figure out the money at the end of the day, things like that. I think it's just actually quite individualistic society, but it's individualistic with heart I would say. There's a warmth to it, but it will definitely be appeared strange to people who don't really understand this. They think people are cold and they're just like they don't understand that there's actually a heart behind this stuff.\n\nLenny (01:23:00):\nThat sounds really smart, to be honest, the system. I would be into it, but I can see how people are very confused. Gustaf, I can't thank you enough for doing this. This was incredible. I know that people listening to this are going to leave informed, inspired, motivated, hopefully motivated to move faster and make more progress. Two final questions. Where can folks find you online if they want to learn more or ask you may be follow up questions? And two, how can listeners be useful to you?\n\nGustaf Alströmer (01:23:27):\nI tweet sometimes on twitter.com/gustaf. The most useful things that I put out is probably on the YC's YouTube channel. So I record a couple videos on growth, on sales, on how to talk to customers. I actually send them to people all day long because the Start School videos that we made are a lot of preparation went into it and it answers most of the questions that people have. So watch those first, I would say. But yeah, sometimes I tweet other stuff that people can follow. That's fine. How can people be useful to me? I love hearing feedback from founders, what they're working on. I want to hear kind of questions they have about their companies. But I want to also really emphasize that to apply to YC, you don't need to know any of us. You don't need to reach out to us. It doesn't make any specific difference.\n\n(01:24:15):\nThe principles in YC is that you should be able to become an insider in YC in Silicon Valley without knowing anybody. That's kind of what the application process is about. So feel free to reach out to us if you have questions, but don't feel like that's required to be a good YC applicant. It's actually the opposite in that we read and treat all the applications equally. Thank you so much for listening to this podcast. I mean, it made me happy you made all the way to the end.\n\nLenny (01:24:44):\nYeah, extra credit for listening to the end. I also just want to say while you're saying that, it feels like YC is such a good force for the world. It just enables so much innovation and progress. And if technology is what drives the world forward, IC is so at the center of a lot of that. So just huge props to what YC is doing and what you're doing, Gustaf.\n\nGustaf Alströmer (01:25:02):\nWe feel a lot of responsibility towards that. That's for sure.\n\nLenny (01:25:05):\nAll right, I'll let you go. Again, Gustaf, thank you for doing this.\n\nGustaf Alströmer (01:25:09):\nThank you so much.\n\nLenny (01:25:12):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "Gustaf Alströmer (00:00:00):\n如果我深入分析是什么导致公司失败，其实非常简单。就是他们不与用户交流，这意味着他们无法找到产品市场契合度(product market fit)。如果他们找不到产品市场契合度，其他一切都无关紧要了。人们犯的错误就是这样。一切都在于与客户交流，了解你正在构建的东西是否真正有用。YC Slack 的标语是\"创造人们想要的东西\"，这句话至今仍然适用，而且永远都会适用。\n\nLenny (00:00:30):\n欢迎来到 Lenny 的播客，在这里我会采访世界级的产品领导者和增长专家，学习他们在构建和发展当今最成功产品过程中艰苦获得的经验。今天我的嘉宾是 Gustaf Alströmer。Gustaf 是 Y Combinator 的集团合伙人(group partner),他在那里工作了近六年。在此之前，Gustaf 在 Airbnb 工作了四年多，他创建了 Airbnb 最初的增长团队，我非常幸运能够在那里与他共事多年。Gustaf 也是 YC 加大对气候科技(climate tech)关注的核心人物，在我看来，他是少数几个对气候科技领域日益增长的投资和人才流入产生巨大影响的人之一。\n\n(00:01:10):\n我们深入探讨了气候科技领域正在发生的事情，为什么最近变化如此之大，有什么新的令人兴奋的东西，以及如果你希望进入这个领域应该如何思考。我们还深入讨论了 Gustaf 在 YC 期间与 600 多家初创公司合作的经验。我们谈到了早期初创公司和创始人最常犯的错误是什么，YC 合伙人最常给创始人什么建议，成功创始人最常见的特质，拥有技术联合创始人的重要性及其原因，还有更多内容。我保证你听完这期节目会变得更聪明、更受启发，我迫不及待想让你听到它。接下来，在我们精彩的赞助商简短介绍之后，我将为你带来 Gustaf Alströmer。\n\n(00:01:53):\n本期节目由 Linear 赞助。说实话，你今天使用的问题跟踪工具并不是很有帮助。为什么它似乎总是在与你作对而不是为你服务?为什么使用它感觉像是一件苦差事?好吧，Linear 不一样。它速度极快，设计精美，并配有强大的工作流程，可以简化你的整个产品开发流程，从问题跟踪一直到管理产品路线图。Linear 是为现代软件团队的工作方式而设计的。用户喜欢 Linear 的原因包括强大的键盘快捷键、高效的 GitHub 集成、真正创造进展的周期，以及让每个人保持同步的内置项目更新。简而言之，它就是好用。Linear 是初创公司的默认工具选择，它还为 Vercel、Retool 和 Cash App 等众多大型知名公司提供支持。亲自体验一下为什么产品团队将使用 Linear 描述为神奇的体验，访问 linear.app/lenny 免费试用 Linear，升级时可享受 25% 的折扣。网址是 linear.app/lenny。\n\n(00:03:02):\n本期节目由 Eppo 赞助。Eppo 是由 Airbnb 校友为现代增长团队打造的下一代 A/B 测试平台。Netlify、Contentful 和 Cameo 等公司都依赖 Eppo 来支持他们的实验。无论你在哪里工作，运行实验都变得越来越重要，但没有与现代增长团队技术栈集成的商业工具。这导致在构建内部工具时浪费时间,同时还要通过笨重的营销工具来运行你的实验。当我在 Airbnb 时，我最喜欢我们实验平台的一点是能够轻松地按设备、国家和用户阶段切分结果。Eppo 做到了这一切甚至更多，快速交付结果，避免令人烦恼的冗长分析周期，并帮助你轻松找到发现的任何问题的根本原因。Eppo 让你超越基本的点击率指标,转而使用北极星指标,如激活、留存、订阅和支付。Eppo 支持前端、后端、电子邮件营销甚至机器学习客户端的测试。访问 getepo.com 查看 Eppo。网址是 Get, E-P-P-O.com,让你的实验速度提升 10 倍。\n\n(00:04:15):\nGustaf,欢迎来到播客。\n\nGustaf Alströmer (00:04:17):\n谢谢你,Lenny。说实话,见到你真是太好了。我很高兴能和你聊天。\n\nLenny (00:04:22):\n自从我们预定这次谈话以来,我一直期待着这次对话。我们在 Airbnb 一起工作了很多年。在你去 YC 做更大更好的事情之前,我非常幸运能和你一起工作。说到 Airbnb,你曾经发推文谈到那对你来说是多么特别的经历,我觉得更有趣的是,有多少离开 Airbnb 的人找不到另一个同样特别的地方,就像那个标准已经定得太高了。所以我的第一个问题是,你认为是什么让 Airbnb 如此特别?为什么它对你和其他人来说是如此重要的经历?更重要的是,你从那段经历中获得了什么,并将其带给你现在合作的初创公司?\n\nGustaf Alströmer (00:05:02):\n是的,很有趣。我想今年几个月后,就是你我开始在 Airbnb 工作的 10 周年了。\n\nLenny (00:05:07):\n哇。\n\nGustaf Alströmer (00:05:08):\n那是 2012 年。我发那条推文的原因是我问了所有在 Airbnb 之后遇到的人,因为我有这样的经历,就像,这是我职业生涯的高光时刻,至少在那个团队中是这样,我问每个人,\"你找到更好的了吗?\"除了可能一两个人,我没有听到任何人说他们找到了更好的。他们都非常怀念那段时光。我想了很多为什么会这样,但我想说 Airbnb 感觉不像一份普通的工作。它更像是一群朋友试图一起做一些事情,我们就是朋友。至少在一开始,这感觉不像是一份工作。它有点像一个持续的项目和一群了不起的人的集合。我认为最终我们成功构建了两样东西,比如一家非常成功的公司,这要感谢 Joe、Nate 和 Brian 创办了这家公司。没有他们,就没有可以构建的东西。\n\n(00:06:04):\n我认为人们不喜欢使用\"家庭\"这个词,但我有这种感觉,因为当我去见那个团队的 Airbnb 校友时,我们有一种非常特殊的纽带,让我想起了亲密的社交关系,而不是其他任何东西。它不会让我想起同事。我问自己为什么会这样。我能给出的最好答案可能是我们引入了特殊类型的人。我们有非常多元化的背景。我们很多人是前创始人。我们中没有多少人是早期科技行业的职业人士,没有多少人。\n\n(00:06:37):\n我认为我们设定的标准,首先,我相信我加入时大概有五到七名产品经理,有 30 名工程师左右,你比我早一点加入,那些人设定了标准或设定了我们之后寻找的标准。我认为改变这种叙述花了很长时间。我的意思是,最终你必须雇用那些只有大公司职业经历的人,但我不记得我们这样做了很长时间。当我最近重读我的告别信时,我在那里的话对我仍然意义重大,它有点像是你试图反思这些事情,比如,建立一家成功的伟大公司,并成为这个非常亲密的朋友\"家庭\"的一部分。\n\nLenny (00:07:21):\n所以听起来,如果你必须归纳 Airbnb 做了什么,听起来招聘是影响结果的主要因素,就像创始人对他们招聘的人的类型非常具体。\n\nGustaf Alströmer (00:07:32):\n绝对是的。\n\nLenny (00:07:32):\n那里有什么,我不知道,可以借鉴的东西,就是你对创始人的建议,比如招聘。人们知道,要非常小心你雇用的人。前面,我不知道,10 个人会长期影响文化。但我不知道。抽象出来,在第一批招聘中寻找什么,有什么建议吗?\n\nGustaf Alströmer (00:07:50):\n这是一个棘手的问题,因为我想说我们做的所有事情都是这个结果的原因,但世界并不是这样运作的。我们做的一些事情有效,我们做的一些事情没有效果。我们很难真正分清楚哪些事情是有效的,但我认为我们可以谈谈我们做的事情。首先,我们确保我们雇用的人真的很兴奋能在那里,对吧?他们想要构建 Airbnb,他们真的很兴奋能在 Airbnb 工作。这是最重要的事情。当然,人们有其他 offer,但我认为你可以从这些 offer 中弄清楚你是否兴奋能在这里。所以这可能是第一件事。\n\n(00:08:30):\n第二件事,我认为是试图理解那里的人的真正动机,比如,\"你为什么在这里?\"我们做了一些我们称之为文化面试的事情,我认为创始人已经写过或者网上可能有关于这方面的内容。我们早期做了很多文化面试,试图弄清楚我们得到的人是否符合我们的核心价值观,并且真的很兴奋在 Airbnb 工作。我认为最后,我不知道这是怎么发生的,我们确实从不同背景挑选了人。大多数初创公司的大部分产品经理不是前创始人,但我相信 Airbnb 前 10 或 12 或 15 名产品经理的情况就是这样。我们很多人都是前创始人。我认为这对你如何做决策和如何开始做事产生了很大的影响。\n\n(00:09:21):\n我认为我实际上在 Airbnb 创始人身上看到了很多这一点。他们真的很关心在 YC 的时光,他们试图在 Airbnb 内部重建 YC 几次,举办演示日,推出与其他部分完全隔离的新产品,从做不可扩展的事情和与客户交谈开始。所以我认为那段经历对他们产生了很大的影响,但很难说只是应用这两件事。很难说,\"好吧,这会像在 Airbnb 一样有效。\"我认为这是一个非常难以回答的问题。\n\n(00:09:51):\n我要说的最后一件事是,Airbnb 从早期就有一个令人难以置信的商业模式,一个令人难以置信的业务,很难失败。我的意思是作为一家公司很难失败。你可以在公司内部的个别事情上失败,但公司仍然会成功。我认为我们都感觉到了这一点。很多公司没有能力像 Airbnb 早期那样承担风险,因为他们没有如此明显优秀的东西。\n\nLenny (00:10:18):\n关于最后一点,这是一个非常有趣的观点,你可能有最令人惊叹的文化并且招聘做得非常好,但如果公司没有成功,它就不会被回顾为,\"哇,那是一次了不起的经历,但我们失败了。\"\n\nGustaf Alströmer (00:10:18):\n是的。\n\nLenny (00:10:30):\n是的，这很有意思。所以你提到了YC，这正好引出了我想重点讨论的内容。你提到你已经与600多家公司合作过，这个数字太惊人了。感觉你已经能从中获得一些统计学意义上的收获，知道什么有效什么无效。所以我有一系列关于你在YC工作以及与这些公司合作经验的问题。首先，我想到Elad Gill曾经发过的一条推文，我记得他还写了一篇文章。Elad Gill是一位传奇天使投资人。他说创业是一种绝望的行为。你要么是迫切想改变职业轨迹，要么是迫切想赚大钱，要么是迫切想实现某种使命或打造一个特定产品，你就是觉得\"我需要让它存在\"。我很好奇你是否同意这个观点，然后我还有一个相关的后续问题。\n\nGustaf Alströmer (00:11:20):\n是的，实际上我之前没听过这个说法，但你了解我，我是个乐观的人。我想这可能反映在我对这个问题的看法上，但我会说\"绝望\"听起来像是你从一个负面的地方开始。实际上我认为大多数创业的人是从一个积极的地方开始的。但我同意他说的，成功创始人的动机可以是非常多样化的，对吧?\n\n(00:11:41):\n所以我们实际上在早期的一次集体办公时间(Group Office Hours)会议上问过这个问题。我们问他们：\"你为什么要做这个?\"我们不想听到像\"我发现了市场的这个利基\"这样的答案。那不是为什么。\"为什么\"是指，\"四年后当你没钱了，一切都搞砸了，你为什么还会来公司加班到很晚?\"，对吧?那时候利基市场不是答案。一定有比这更深层的东西。我们了解到人们创业的动机差异很大。有些人只是想解决一些他们热衷于解决的技术问题。有些人想在别人面前证明自己，或者向自己证明自己。有些人有宏大而重要的动机想要改变世界，他们会说\"我想让每个人都有水喝\"或\"我想解决气候变化\"或\"我想让出版民主化\"。你可以想象任何数量的宏大想法。有些人只是想创办一家大公司，只是想成功。\n\n(00:12:44):\n根据我的经验，你的动机是什么并不重要。我不认为这些动机中的某些会比其他的更好。根据我的经验，事实并非如此。随着时间推移，动机会变成只是经营这家公司，对吧?一旦某件事变大了，就很难每天都想着你当初为什么开始，因为动机就变成了这可能很有趣，即使做无聊的事情也很有趣，因为打造大东西本身就很有趣。不是所有事情都必须闪亮、宏大和华丽，因为有很多想法是\"无聊的\"，但经营公司这个想法本身最终会成为动机。\n\nLenny (00:13:17):\n这真的很有意思，听起来你在面试时寻找的主要东西之一就是打造这家公司的驱动力有多强、多持久。你是这个意思吗?\n\nGustaf Alströmer (00:13:26):\n实际上在面试中筛选动机是相当困难的，我得说，因为这种办公时间问题的目的是突出某人为什么在这里，突出人们在这里的原因的多样性，有时甚至突出从一个创始人到另一个联合创始人，他们为什么要做这个。他们可能从未谈论过这个。实际上，令人惊讶的是，创始人们经常没有谈论过他们为什么要做这个。知道某人为什么在这里真的有助于解决冲突，比如说，真的有助于理解某人为什么在某一天会在那里或类似的事情。所以这不是我们筛选的东西，而是我们试图帮助创始人在他们自己之间发现这一点，真正了解自己的这一点。我已经接受了创业动机是广泛多样化的事实。\n\nLenny (00:14:13):\n当你看到某些动机可能不够持久或持续，或者基于其他原因，知道创业最终会有多困难时，你会劝阻创始人创业吗?\n\nGustaf Alströmer (00:14:23):\n这是个好问题。我会说，有时如果某人没有动机或不知道他们为什么要做这个，他们做这个是因为他们读到这将是一个自然的职业步骤。所以不创业的一个好理由是，如果你把创业当作一个职业步骤。嗯，它不是。因为如果成功了，它将是你的整个职业生涯。很可能会是10年。如果不成功，那么这不是人们通常渴望开始的事情。所以不成功的初创公司。所以我认为人们会创业是因为这是他们想放在简历上的东西。他们还没有理解什么是初创公司或为什么你应该做它们。\n\n(00:14:58):\n有时你可以筛选并弄清楚这一点，但有时人们在开始时甚至不知道他们为什么要创业，这在过程中会弄清楚。这没关系。我不想劝阻那些不知道他们为什么要创办这家公司而只是想创业的人。他们可能会在过程中弄清楚，在做了一段时间后找到真正的动机，或者发现这真的很有趣。\n\n(00:15:21):\n我想我会劝阻那些生活中有很多其他比创业更重要的事情的人创业。所以如果有财务限制、家庭限制或关系限制，而这些会超过创业，那么是的，你应该再考虑一下，因为创业很难。它比正常工作难得多。无论成功还是失败，同样困难，对吧?没有中间道路，不会说\"哦，我的公司做得很好，所以我可以放松。\"也不是那样运作的。所以我不真正劝阻或鼓励人们，我只是想让他们拥有所有的信息。\n\nLenny (00:16:03):\n你提到了YC办公时间,我有个相关问题。我正在写一篇文章,采访了一些做得非常好的B2B公司的创始人,我问了他们几个问题,比如\"你是如何想到这个想法的?你是如何找到最初的几个客户的?\"令人震惊的是,他们中有多少人提到YC办公时间的一次对话是让他们走上现在这条轨道的最关键时刻。我很好奇这些办公时间里发生了什么?你在这些办公时间给出的最常见的建议是什么,或者最令人惊讶的建议是什么,这样人们可以了解一下你们的这些对话?\n\nGustaf Alströmer (00:16:43):\n所以在YC我们有两种办公时间,两种常见的。我们有常规办公时间(regular Office Hours),通常是一对一的,或者基本上是创始人与我交谈,或者我加上另一个合伙人。它们在整个项目期间每周或每两周进行一次。它们在项目结束后的几年里也会定期进行。然后我们有集体办公时间(Group Office Hours),就是你和其他六七个初创公司一起与我们交谈。它们的目的有点不同。所以常规办公时间的目标是,我总是问这个问题:\"什么阻碍了你更快前进?我们不想听更新,不想听战略问题。我们想了解什么在拖慢你,或者什么阻碍你更快前进。你通常有一个具体目标。\"\n\n(00:17:27):\n我认为\"什么在拖慢你或阻碍你\"这个问题能明确优先事项。作为一个初创公司你只能做这么多事情,在那个阶段只有这么多事情是重要的。通过问这个问题,我们可以开始深入探讨,\"好吧,目标是什么?推动实现这个目标的事情是什么?阻碍你实现这个目标的事情是什么?\"通常,创始人不知道什么在拖慢进度,所以对话和我们提出的问题实际上导致我们或他们发现到底是什么在拖慢他们。\n\n(00:17:59):\n在集体办公时间,有点不同。集体办公时间有几个不同的目的。其中之一是,如果我回想Paul和Jessica创办YC的动机,这对他们来说是个惊喜,但创业是非常孤独的。你真的不能依靠你的员工说,\"嘿,我今天作为创始人感觉很糟糕。一切都搞砸了。\"员工不会很好地接受这个。所以你可能依靠你的投资人,但他们并不总是有空。但你能依靠的是其他创始人,因为他们都处于同样的境地。就像当你问一个创始人\"事情进展如何?\"这个问题,对他们来说回答这个问题是如此情绪化,因为事情从来都不顺利,对吧?从来不会是\"哦,一切都很棒。\"他们可能会这么说,但每个人都知道,所有创始人,当他们看着彼此的眼睛时,知道那不是答案。\n\n(00:18:48):\n所以创始人有无数的问题一直在思考,这就是为什么他们对\"事情进展如何?\"这个问题过敏。但当YC开始时,我们把所有创始人放在一个房间里的一个小组中,他们开始了解到所有创始人、所有公司都以某种方式破碎,对吧?他们都有这些巨大的问题,当他们听到\"事情进展如何?\"这个问题时,他们都感到焦虑。听到其他创始人解释他们的问题,也许解决他们的问题,对你自己来说是一个很好的方式,既能感到有动力自己去做,又能看到当其他公司遇到类似问题时问题是如何解决的。现在由于YC的规模,我们把在同一领域运营或有相同问题的公司分组在一起。\n\n(00:19:30):\n集体办公时间做得好的第二件事是问责制,对吧?我们问你,\"你的目标是什么?过去两周你的目标是什么?你实现了吗?\"这给创始人带来了问责制,因为创始人是有竞争力的。他们不想看起来糟糕。他们不想在两周后回来说\"什么都没做成\",或者至少\"我们什么都没学到。\"他们想学到一些东西并取得进展,无论是积极的还是消极的。\n\n(00:19:54):\n对我来说,集体办公时间是最神奇的时刻,因为它真的创造了这个非常紧张的三到四个月的时期。创始人经常事后回来对我们说,\"嘿,我们想再做一次。我们没有这种非常紧张、非常高效的时期。我们没有完全相同的项目。我们有其他项目,但我们没有完全模仿那种体验的东西。\"但我们确实鼓励创始人在YC之后继续进行集体办公时间。他们中的许多人这样做了,他们中的许多人会临时继续在这个小组环境中见面多年,他们互相问同样的问题,让自己负责,互相学习,只是有其他人可以依靠。我认为这是未知的,不知何故世界以前不知道创业是超级孤独的,你有所有这些焦虑。只是与有同样问题的其他人交谈,这就是你能做的最好的事情之一。\n\nLenny (00:20:45):\n当你谈到这个话题时，让我想起了很多事情。其中之一是我曾经有一个创业公司，我们在联合办公空间工作。我们加入联合办公空间是因为我们想，\"哦，我们会遇到其他创始人。这会很社交化，我们不会孤单。\"但事实证明，每个人都只是埋头工作，戴着耳机，\"我没有时间做任何其他事情。我只需要工作。\"这就像是那种体验的缩影，即使你被创始人包围，也没有人有时间做任何事情。他们只是在工作。\n\nGustaf Alströmer (00:21:09):\n你必须安排时间，强制执行，把笔记本电脑放在地板上，把手机放在地板上，然后你就坐在那里，只用纸和笔。这就是你必须做的方式。我们试图通过Zoom尽可能地模仿这种方式。但说实话，最好的体验是在现场，在山景城的一个圈子里，没有电脑，每个人都专注于其他人。那是最好的体验。是的，这是我记得YC最有意义的部分之一。我自己在YC的时候没有这样的体验，但现在每个人都有了。\n\nLenny (00:21:36):\n另一件让我思考的事情是，有人曾经发推文说，\"永远不要问创始人他们过得怎么样或进展如何。这只会制造焦虑，因为从来没有什么事情进展得很好。\"\n\nGustaf Alströmer (00:21:44):\n别这样做。每个人都看着彼此的眼睛，他们知道他们对这个问题过敏。\n\nLenny (00:21:50):\n这太搞笑了。所以总结一下你说的问题，一个是在个人办公时间(Office Hours)里，问的是什么阻碍了你。然后在小组环境中，你问的问题又是什么来着?\n\nGustaf Alströmer (00:22:01):\n你接下来两周的目标是什么，过去两周的目标是什么，你达到目标了吗?如果你没有达到，是什么阻碍了你达到目标?这非常简单。这可以揭示其他创始人以完全相同方式遇到的很多问题。只是通过谈论阻碍你的事情或让你达到目标的事情，就能为圈子里其他七家公司揭示一些实质性的东西。\n\nLenny (00:22:26):\n如果你稍微放大一点视角，想想你合作过的创业公司，你认为早期创业公司最常犯的错误是什么?\n\nGustaf Alströmer (00:22:36):\n有太多了。我的意思是，这就是我最初学习创业的方式，通过在谷歌上搜索这个问题并找到Paul Graham的文章，因为他一直——\n\nLenny (00:22:45):\n哇。\n\nGustaf Alströmer (00:22:45):\n我想我写过很多关于这个话题的文章，因为这太常见了。所以这个话题可以永远讨论下去。但如果我以我在YC最近的经验来说，我会说创业公司失败，第一，是因为他们不与客户交谈。如果你不与客户或用户交谈，你实际上不知道什么是重要的。如果你不知道什么是重要的，那么你构建什么并不重要，你脑子里有什么想法也不重要，如果你实际上不知道你需要构建什么，并且不与客户验证。这就是很多失败的根源。YC早期或项目的早期阶段，我们花了很多时间推动和探查创始人，比如，\"告诉我们你与客户的对话。你学到了什么?你能给我们展示这些组织吗?\"或者像所有这些问题，\"他们使用什么软件?他们为什么付费?他们有什么问题?他们如何描述这个问题的严重程度?\"所以这就是我们在YC早期花了很多时间做的事情。\n\n(00:23:43):\n之后，我会说在……我这里不是在谈论一般的创业公司，我是在谈论YC内部。我在YC看到的第二个最常见的事情是人们只是害怕与客户交谈。他们只是不够努力地去接触客户。我认为这来自于，技术人员倾向于认为软件就是一切的解决方案。但实际上你需要做的是通过Zoom、电话或面对面与某人交谈，面对面更好。人们只是害怕这样做，他们害怕被拒绝。这很常见，想要构建好产品的人真的很害怕人们说不。\n\n(00:24:25):\n问题是，任何在加入YC之前没有做过销售的人，他们意识到这一点，就是如果你在世界上选择平均客户群，90%的人不是早期采用者(early adopters)。不管你有什么新的和酷的东西，他们就是不感兴趣。他们没有动力在工作中冒险尝试新东西。他们只是被激励不要冒险，只是继续他们正在做的事情。那10%才是早期采用者。他们才是你真正想要接触的人。但这意味着你必须接触10个人才能找到一个。然后你说服那一个人与你通话或视频通话。这需要工作，需要很多工作。我认为人们并不真正考虑这个问题。这对销售人员来说是常识，基本的东西,但以前从未做过销售的创始人只是对这些百分比和这意味着什么感到惊讶。\n\n(00:25:12):\n如果我更普遍地思考YC之外的情况，所以这是我在YC内部经历的两件事，但我认为在YC之外，我会说两个最常见的问题，同样一个是不与客户交谈,另一个是不懂技术，不知道构建成功的技术公司需要什么。这意味着要有技术创始人，意味着能够自己构建第一个原型。这是我们在YC面试时筛选的东西，我们不会接受很多不知道如何自己构建或完成第一个原型的团队,因为我们知道这是一个非常常见的失败模式。\n\n(00:25:50):\n关于这个我可以一直说下去，但说实话，如果我深入研究是什么让公司失败，这很简单。就像他们不与用户交谈，这意味着他们找不到产品市场契合度(product market fit)。如果他们找不到产品市场契合度，其他一切都不重要了。人们犯的错误就是这个。这完全是关于与客户交谈并了解你正在构建的东西实际上是有用的。YC Slack的标题是\"制造人们想要的东西\"，这仍然是真的，永远都会是真的。\n\nLenny (00:26:23):\n这真的很有趣，也是很好的建议。有趣的是……比如，\"与客户交谈\"，人们一直听到这个。他们会说，\"当然我们会与客户交谈。我们当然会这样做。\"而你的经验是，他们知道这一点,但他们就是不做，可能是因为他们害怕。也许还因为他们认为自己已经知道需要构建什么，就像，\"是的，我们很好。\"\n\nGustaf Alströmer (00:26:41):\n而且你有所有这些验证，对吧?所以人们在验证，即使你不与客户交谈，为什么YC接受了你?这个投资者投资了你。这个投资者说你很棒，等等等等。所有这些不同的验证，你将其与产品市场契合度混淆了，对吧?我们必须在YC的第一天提醒每个人，\"你们都没有产品市场契合度，因为你们可能没有\"，对吧?几乎没有人有。因为人们把这种外部验证与最重要的事情混淆了，那就是与客户交谈并了解什么是重要的。这只是一件不断重复的事情。有些人真的很擅长这个。这就是成功创业公司的来源，当你真正擅长这个的时候。\n\nLenny (00:27:21):\n这让我想起回到Airbnb，Airbnb历史上最重要的时刻之一是Paul Graham告诉Airbnb的创始人，\"你的客户在哪里?\"他们说，\"哦，他们在纽约\"，他说，\"为什么你在和我说话而不是现在就在纽约和他们交谈?\"他们一直在谈论这件事。\n\nGustaf Alströmer (00:27:35):\n是的，这绝对是真的。我认为他写了文章《做那些无法规模化的事情》(Do Things That Don't Scale)作为一个学习……那里的学习是Airbnb创始人去纽约旅行并学习如何构建Airbnb，这是一个非常反直觉的想法，就是当你必须与客户花费最多时间的时候。我认为Airbnb是YC内部做得很好的最好故事之一。\n\nLenny (00:27:57):\n这也让我想起，我最近和很多创始人交谈。我问他们，\"你与多少客户交谈过以帮助确定这个想法?\"就在前几天，他们在实际开始这轮融资之前与150位财务首席风险官(CRO)交谈过。另一家公司，实际上是两个Airbnb的人创办的，他们实际上在LinkedIn上投放广告，我认为是为了找到特定的人交谈，特定的角色。他们至少谈了100个，也许200个。所以那里有很强的相关性。\n\nGustaf Alströmer (00:28:26):\n是的，我认为这是人们没有预料到的数量。他们认为可能只需要与5个人交谈，但我认为你必须与25到50个人交谈。这意味着你必须接触更多的人才能找到可能是早期采用者的人。你交谈的那些人也是成为你客户的人。所以无论如何，你只是通过做这项工作就已经完成了大部分销售。\n\nLenny (00:28:45):\n你能分享一个战术性的技巧吗，关于如何克服与客户交谈的恐惧，或者只是让自己对实际做这件事负责?\n\nGustaf Alströmer (00:28:55):\n是的，我讲这个故事，实际上我昨天讲了这个故事。所以记得当你注册第一个很酷的服务时，你在TechCrunch或类似的地方听说过，然后你意识到你一年前已经注册过了，对吧?然后从创始人的角度来看，你注册了一些你从未使用过的东西。所以构建这些服务的创始人，他们的倾向是认为\"每个人都讨厌我，因为他们注册了但从不使用。\"他们从不使用这项服务。对此的恐惧基本上就是对拒绝的恐惧。所以如果我把我的东西放出来，大多数人不会使用它，他们会告诉所有朋友这东西有多糟糕，你永远不应该注册它，这就是人们的恐惧，但事实是人们注册它然后说，\"哦，我很忙。我有其他事情要做。\"他们实际上不记得或不在乎。\n\n(00:29:43):\n所以每当你注册一年前注册过的东西时，想想你自己，这就是常见的客户体验，就是你注册了很多你甚至不记得的东西。你从来没有这种\"我讨厌这个东西\"的反应。你总是有这种\"我对这个东西无所谓。我实际上不在乎甚至完成注册流程或尝试它\"，对吧?我认为这就是人们需要记住的事情，就是创业公司可能发生的最糟糕的事情不是人们讨厌你正在做的事情，而是他们对你正在做的事情完全无动于衷。这不是最糟糕的事情，但最常见的事情是人们只是无动于衷。但它确实给你第二次机会。比方说，它总是给你第二次机会，你真的需要内化这一点，人们的生活很忙，如果人们实际上不使用你正在构建的东西，那没关系。如果你做了一些改进，你可以在一年后、六个月后或两周后再次联系他们，他们可能会使用。\n\n(00:30:37):\n我认为人们只是有这种恐惧，\"如果我遭受很多拒绝，那意味着一切都很糟糕。\" 但是拒绝应该放在早期采用者理念的背景下来看，大多数不关心的人并不是早期采用者，他们不想深入研究新事物。而且你为特定问题提供的解决方案越狭窄，实际上想要深入了解的人就越少。但这就是你必须开始的地方，因为你不能一开始就构建整个产品并让每个人都爱上你。事情不是这样运作的。\n\n(00:31:07):\n即使是 Airbnb，最初也只是气垫床或者在房主在家时住在他们家里。这并不是 Airbnb 的完整解决方案。但有早期采用者深入研究并说，\"是的，我喜欢这个。我喜欢这两件事。我想让人们住在我客厅的床垫上。\" 但这不是今天 Airbnb 的样子，当时很多事情都是未知的。但我认为人们只是害怕拒绝，你只需要克服这种恐惧，并且要明白当人们不使用服务或不注册、不关心时，真的不会发生什么很糟糕的事情。这真的没那么糟糕。\n\nLenny (00:31:42):\n这让我想起了我一直很喜欢的 Mark Andreessen 的一句话，每个人的时间都已经被分配了。他们现在没有空间给你的产品。他们已经有了一天的计划。\n\nGustaf Alströmer (00:31:42):\n完全正确。\n\nLenny (00:31:51):\n要说服某人关注任何事情都需要很大的努力。我想这又回到了为什么你的产品解决真正的痛点如此重要，而不仅仅是一个比现有产品更好的小玩具，但还不够好到让你觉得\"我现在就需要这个。\" 所以也许沿着这个思路，你对痛点的重要性以及它有多关键有什么想法吗?\n\nGustaf Alströmer (00:32:15):\n实际上我录制了……我对这些视频很满意，但我在去年秋天为 YC Startup School 在 YouTube 上录制了两个视频。你现在可以在 YouTube 上观看它们。其中一个是如何与用户交谈，另一个是如何销售或如何使用销售。关于与用户交谈的那个，我认为询问某人\"你在 X、Y、Z 方面有问题吗?这个播客设置对你有用吗?\"和人们说\"是的，还算有用\"是有区别的。但如果你是播客设置专家，你看着人们使用其他真正糟糕的东西，他们可能也认为那还不错。但你必须看着他们做这件事。对你来说，找出问题强度的最好方法不是问他们，而是看着他们或看着他们解决他们所做的事情。\n\n(00:33:06):\n你知道很多非技术人员不知道如何自动化事情吗?所以他们会在 Excel 中做同样的事情，就像一百万次地点击，因为那是他们唯一知道的事情，他们不够技术化，无法编写某种脚本来完成它，你只需要看着这些人就能感受到痛苦。你实际上不能问他们做 X、Y、Z 有多困难，因为他们甚至不知道这对他们来说有多困难。所以我学到的关于如何发现痛点的最好方法是观察人们，让他们分享屏幕，让他们向你演示他们在你正在进行探索的领域的日常工作流程。这是最好的方法。\n\n(00:33:43):\n我再给你举个例子。有很多公司在做电动汽车的充电，他们说，\"电动汽车充电有什么问题?\" 我说，\"就租一辆电动汽车，去所有非特斯拉的充电站充电，看看他们说什么，看看你的体验。\" 事实是那简直就是垃圾。很多电动汽车充电系统都太糟糕了，应用程序也很糟糕。你只需要自己使用它们就知道有多糟糕。\n\nLenny (00:34:13):\n很酷的是，它经常回归到\"就去做这件事。做那些不可扩展的事情。\" 经典的 YC 建议。我想回到你提到的一些事情，我想深入探讨一下作为技术联合创始人，早期的技术性，只是为了涵盖这一点。所以我知道 YC 希望……拥有技术创始人是你决定接受一家公司的重要变量。假设某人没有技术联合创始人，你对他们可以做什么有什么建议吗，比如什么通常可以奏效?\n\nGustaf Alströmer (00:34:41):\n是的，我认为第一件事是理解技术联合创始人的价值。所以有些人处于这种情况，他们有一个想要构建的东西的想法，但没有人帮助他们构建它，我有一个朋友 Paul 说了一句令人难以置信的话，他说，\"我有一首歌的想法，我只需要一个音乐家来帮我制作它，\"对吧?这有点类似于工程的情况。如果你把工程的输出看作，\"我只是有一首歌的想法，我只需要有人真正为我制作它\"，那么你对软件工程或机械工程或任何工程技能集的评价就不够深入，对吧?\n\n(00:35:17):\n事实是，工程部分是真正困难的部分。我要说的第一件事是你需要学会如何评价工程部分。让我给你一个你不该这样做的例子。你申请了 YC，你给自己 90%，给工程师 10%。你基本上是在说，\"哦，这家公司的工程部分只值我的十分之一。我是非技术人员。\" 所以对我来说，这是一个信号，表明你并没有真正重视工程。\n\n(00:35:44):\n好的，那么你如何去找到某人呢?嗯，事实是有很多技术联合创始人。技术人员，他们也想找商业联合创始人。他们不想做其他部分。他们不想做销售，他们实际上也不太关心筹款。他们只想解决问题。这很好。我们构建了一个叫做联合创始人匹配 (co-founder matching) 的东西，创始人可以在那里见面，但如果你不参与其中，你可以从询问你认识的最好的技术人员开始。\"你有兴趣和我一起创办公司吗?\" 和拒绝一样。他们中的许多人会说，\"不，我有一份很好的工作，我真的很开心。\" 但其中一些人会想过创办公司一段时间，并希望有人来邀请他们这样做。所以你必须消除恐惧，去问最好的人。\n\n(00:36:29):\n你想要一个技术联合创始人而不是一个雇佣的工程师或不是一个雇佣的承包团队的原因是，因为你要做的很多决定都是技术性的，你要做的很多迭代都依赖于工程。如果你不理解这一点，你实际上无论如何都不会做出正确的决定。这不像服务。你有一个产品的想法，你构建一个产品，然后你就完成了。在这个过程中有无限数量的迭代。\n\n(00:36:54):\n最后，我会说很多人自己学习编程，对吧?所以网上有很多地方可以让你学习构建原型所需的技能。你可能不是最好的工程师。所以有很多成功的创业创始人不是最好的工程师，因为当他们雇佣三四个工程师时就停止编程了，这没关系。但你需要足够好，以至于你理解工程的价值，并且你理解用软件解决大多数问题是最好的方法。有很多创始人，出于某种原因，学习了其他东西，在你 18 或 19 岁时不一定有一个有意识或非常精确的理由，然后你 25 岁时，你说，\"哦，我希望我知道如何编程\"，然后就去学习编程，他们学会了如何编程。这并不比那更难。\n\nLenny (00:37:42):\n如果他们有一个承包公司，比如工程公司来构建产品，你有没有见过创业公司成功的?这会奏效吗，还是你只是说，\"不，永远不要这样做\"?\n\nGustaf Alströmer (00:37:53):\n基本上，我不记得有任何具体的例子是人们有承包公司，但我记得创始人，比如说你有两个非技术创始人，但他们重视工程，他们有能力建立一个由不是联合创始人的优秀人才组成的团队，他们给他们股权，他们变得成功了。我会说有很多这样的例子，但我不记得有任何具体的例子是你让承包团队构建整个东西。我认为原因是构建产品需要的不仅仅是编写规格说明。你实际上不能仅凭规格说明就做出一个伟大的产品。你必须自己成为迭代的一部分。这就是为什么我认为作为工程师的人，有迭代的想法并且只是去做是你做事的方式。\n\n(00:38:38):\n我认为在我看到非技术创始人让这个奏效的案例中，他们有非常好的工程团队，他们感觉自己就像创始团队。按照 YC 的定义，他们可能不是拥有 10% 的联合创始人，但他们感觉自己就像创始团队。\n\nLenny (00:38:52):\n这让我想起了一个故事，就是我最近对 Calendly 的首席产品官做的播客采访。她谈到当 Calendly 开始时，他们实际上有一个乌克兰开发团队构建了第一个产品。他们不仅帮助他们构建了第一个产品，他们实际上最终推动了所有最初的增长，因为他们看到了 Calendly 并开始在他们公司内部使用它。\n\nGustaf Alströmer (00:39:14):\n哇。\n\nLenny (00:39:14):\n然后他们认识的每个人都开始使用它，并在乌克兰传播开来，他们实际上继续与那家公司合作。他们仍然是 Calendly 的[听不清 00:39:20]团队或其中的一部分。\n\nGustaf Alströmer (00:39:22):\n哇。\n\nLenny (00:39:24):\n是的\n\nGustaf Alströmer (00:39:24):\n哇，这太酷了。\n\nLenny (00:39:24):\n这是一个成功的故事。\n\nGustaf Alströmer (00:39:26):\n我的意思是，我会说在某些国家，人们在创办创业公司的同时还有其他工作，比如工程师。例如在乌克兰或东欧，如果他们开始自己的创业公司，他们实际上有一份全职工作作为承包商，同时他们正在创办创业公司，因为这就是你支付账单的方式，因为通常你无法筹集资金。这也没关系。\n\nLenny (00:39:46):\n太棒了。这是一些努力奋斗。\n\n(00:39:49):\n本期节目由 Pando 赞助，这是一个始终在线的员工绩效平台。你有多喜欢绩效评估流程?是的，它很耗时，主观，有偏见，而且很少有透明度。随着向分布式工作的快速转变，很难创建你想要的结构和透明度，以帮助你的员工在他们的职业生涯中产生最大的影响和成长。Pando 正在颠覆旧的绩效管理范式，包括一种持续的以员工为中心的方法，这样员工可以保持参与，实时看到他们的进步，并确切地知道他们何时以及如何可以升级。有了 Pando，管理者可以利用基于能力的框架来有效地指导和发展他们的团队，并就一致的成长标准达成一致，从而获得更高质量的反馈和更高绩效的团队。访问 pando.com/lenny 获取更多信息，当你注册并引用本播客时可以获得特别折扣。那就是 pando.com/lenny。\n\n(00:40:47):\n我想稍微放大一点，问另一个大问题，看看你对此有什么答案。如果你只是考虑 YC 中最成功的创业公司，甚至只是你合作过的公司，如果你必须只选择一两个成功公司最常见的属性，那会是什么?\n\nGustaf Alströmer (00:41:04):\n我想说，我所见过的创始人成功或公司成功最常见的原因，归根结底在于创始人以及这些个人的特质。这些个人最重要的特质是，他们真的非常坚定地想要赢，在遇到困难时不会放弃，并且他们拥有一种内在动力，这种动力对周围的人极具感染力，这也是他们最终能够在身边建立起真正优秀团队的原因。人们实际上会想要去为他们工作。我有很多这样的例子，CEO或其中一位创始人就是非常鼓舞人心的人。\n\n(00:41:42):\n第二点我想说的是，他们具备技术能力。也就是说，他们在技术上足够强。如果我按技术能力的高低给公司打分，我会说技术能力更强的创始人更有可能成功。然后我会说，他们早期就找到了如何与用户交流并快速行动的方法，所以他们不会等待投资人或YC或其他人的许可才开始取得进展。他们是那种每天或每周都在持续进步的人。他们不是为别人做这件事，他们是为客户做的。他们肯定不是为投资人做的。投资人某种程度上反而是阻碍。他们只是自然地专注于客户。\n\n(00:42:29):\n最后，我想说的是，真正优秀创始人所具备的技能是出色的沟通能力。也就是能够清晰地传达非常复杂的想法，并且享受沟通这个过程，对吧?享受沟通往往与享受融资相关，而融资是某些公司成功的重要组成部分。不是所有公司都这样，但对某些公司来说确实如此。我会说沟通或讲故事是同一条弧线的一部分，对吧?这些都是能够激励你周围人的同一件事的一部分。如果你能够传达你为什么要建造，你在建造什么，以及它为什么对世界重要，讲述一个关于这个的故事，这可以激励你周围的人想要追随你。我认为很少见到创始人成功的情况下，这位创始人不是在某种程度上是一个鼓舞人心的人或一个善于沟通的人。大多数时候，你至少会尊重他们，或者你在某处知道他们会成功，对吧?这就是激励你想要在他们身边或成为他们团队一员的原因。\n\nLenny (00:43:33):\n这是一个非常棒的清单。总结一下，第一，他们有强烈的获胜意志，并且因此他们很鼓舞人心。他们能够带动人们，让人们真正兴奋起来。第二，如果他们具备技术能力并能够构建产品，他们更有可能成功。第三，他们找到了如何与客户交谈的方法，不等待，直接开始做。他们对此非常执着，而不是去做投资人想让他们做的事，他们不想花时间与投资人交谈，而是要为客户腾出时间。然后是出色的沟通能力，这又回到了第一点。他们能够讲故事并让人们兴奋起来。是这样吗?\n\nGustaf Alströmer (00:44:06):\n是的，我会说这些是成功的特质。要成为一家超级成功的公司，还必须发生其他一些事情。这些事情不是你能列在清单上的，因为它们是异常值(outliers),对吧?如果你看一个典型的YC批次中的初创公司，会有几家十亿美元级别的公司。这些就是异常值。他们几乎肯定拥有我们讨论过的所有特质。批次中的许多其他公司也会有这些特质,但真正让某人成为真正的异常值的是一些未知的东西。这就是为什么当Airbnb试图融资时,那么多投资人对他们说不,因为那是一个异常值想法。这是一个不合逻辑、对大多数人来说没有意义的想法。那种想法,最终成功的那些,往往对人们来说是没有意义的。有些原因导致之前没有人做过这个,因为它们不是世界自然的下一步。\n\nLenny (00:44:57):\n这是一个很好的过渡,引出了我一直想问的一个问题,就是,你在预测一个批次中哪些初创公司会成为巨大的成功方面有多准确?比如你个人,然后整体上YC,你们在知道什么会成功、会成为下一个Airbnb或Dropbox方面有多准确?\n\nGustaf Alströmer (00:45:14):\n我认为事实是,我们不太擅长知道什么会成功。当然,我们无法弄清楚谁会成为批次中真正成功的公司。这是不可能的。我们擅长的是知道失败是什么样子的。我们有时喜欢在批次开始时告诉创始人,\"如果你要失败,请用一些新的、令人兴奋的方式失败。而不是我们已经见过100次的那种。\"因为我们已经看到人们因为大量原因而失败。让我们不是预测、而是让更多公司成功的最好方法是告诉他们他们可能如何失败,对吧?对他们非常直接和诚实地说,\"你做这三件事,这些事情很可能会导致你不会成功。\"如果我们把工作做好,大多数人会得到那个反馈,然后他们就走上了成功的轨道。\n\n(00:46:06):\n现在,这些公司中哪些最终会成为最好的?有太多与成为最好的公司不相关的因素,而这些是人们不喜欢的事情。我在一个热门行业,我在TechCrunch上被报道,比如,这个投资人开始和我交谈。你会惊讶地发现,我刚才提到的很多事情与异常值成功是不相关的,对吧?这就是为什么实际做这件事如此困难。我认为人们真的希望这些问题能够得到回答。人们真的想相信你可以在种子阶段挑选出真正优秀的公司,但我从与我合作过的600多家公司中学到的一切是,这并不那么容易,甚至可能不可能,当你谈论寻找异常值公司时,肯定是不可能的。我不认为这很容易。如果很容易的话,那么我们会接受少得多的公司。我们只接受那些,但事实并非如此容易。\n\nLenny (00:46:59):\n你是否能感觉到哪些公司可能会比其他公司表现更好?还是就像,\"我们有150家公司,真的不清楚,但希望其中之一能成功。\"\n\nGustaf Alströmer (00:47:09):\n一个好的指标是,如果每次新的办公时间(Office Hour)都有真正令人兴奋的新东西,对吧?我们不是在谈论两周前或四周前谈过的同样的事情。他们已经完成了那些事情,对吧?比如,\"哦,我当时在尝试卖给这三个客户。嗯,他们已经买了。我现在实际上在与另外七个客户交谈。\"现在我们在谈论不同的价格和不同的产品,因为他们希望得到更多我们正在做的东西。如果我正在经历这种情况,并且这是一个持续的趋势,那么当人们画出这种每周10%增长率的收入图表时,这些就是我们归因于此的公司。就像如果你能够在这么短的时间尺度上取得进展,你就走在做好某事的轨道上。\n\n(00:47:51):\n现在,还有很多其他事情必须顺利进行,你才能最终成功,但在这种每周或两周的时间尺度上取得进展是某人会成功的一个非常好的指标。对我来说,比我在这个市场或我在与这个投资人交谈之类的要好得多的指标。但这些都是比我正在取得进展并且速度相当快要差得多的成功指标。\n\nLenny (00:48:17):\n有意思。所以我听到的是,在批次开始时,我们只是押注在一堆有很大潜力的公司上,这些公司的创始人具备技术能力,有强烈的获胜意志以及所有这些特质。在整个批次过程中,你在关注那些在他们所取得的进展方面,每周都超出你预期的公司。\n\nGustaf Alströmer (00:48:34):\n我的意思是,有时人们不取得进展可能有不同的原因。但如果你在持续取得进展,我认为Paul和Jessica说过这个,这在YC早期是真实的,如果你在实现你的目标并且在持续取得进展,如果这种情况继续下去,这与某种成功有很强的相关性。但再次回到这个问题,我们能预测谁会成为最好的吗?不能。这就是为什么我们真正专注于试图帮助人们不要失败。特别是好的团队不能失败。如果你有一个真正有才华的团队,他们在如何构建产品方面真的很有技术能力,但他们犯了一些其他基本错误,比如不与客户交谈或类似的事情,或试图一次构建所有东西,我觉得我们有责任确保他们不犯我们见过很多次的基本错误。我们需要帮助他们至少犯一些我们以前没见过的壮观错误。那就是一个高潜力团队。如果某人在一个不错的想法上走在正确的轨道上,但他们仍处于早期阶段,那就是一个非常好的潜力。\n\nLenny (00:49:30):\n我有一个挺有趣的问题想试试,这与成功创始人和公司的特质这个想法有关。我有一个创始人朋友叫Flow,他最近问我,\"如果你必须考虑最成功的创始人,他们有哪些特质?\"他给了我这个清单,有点像光谱的两端。所以我想遍历这个清单会很有趣,看看,根据你的经验,光谱的哪一端,如果有的话,与最成功的创始人相关联和相关。这样可以吗?\n\nGustaf Alströmer (00:50:01):\n当然。当然。我们来做吧。\n\nLenny (00:50:03):\n好的。第一个是速度(speed)对比质量(quality)。光谱的哪一端你会发现最成功的创始人要么专注于速度,要么专注于质量?\n\nGustaf Alströmer (00:50:10):\n有时创始人会问我们这个问题,\"我应该关注什么?增长还是留存?\"答案是,他们在向我们寻求许可,不做其中一个或另一个。事实是,要成功,你必须两者都做。我会说速度对比质量,在公司的不同阶段有不同水平的速度和不同水平的质量。但事实是,你总是必须快速行动,并且你必须理解质量的含义是什么,对吧?\n\n(00:50:35):\n所以我实际上不把它看作一个光谱,但我会说,如果你在与客户交谈方面快速行动,你将构建出有可能具有质量的东西,因为你对问题了解很多。我认为当人们考虑质量时,他们经常想的是,\"我个人对质量的定义是什么?\"我有一个质量标准,但对我来说,一个好的产品想法、一个好的初创公司想法的质量,更多地与客户认为有价值的东西有关。如果你通过与客户交谈、获得客户学习和了解问题来快速行动,那么你实际上会想出高质量的东西。所以对我来说它们不是一个光谱。\n\nLenny (00:51:11):\n好的。让我们试试另一个。作为创始人,自信(confidence)对比谦逊(humility)?\n\nGustaf Alströmer (00:51:16):\n我不认为它们是在一个光谱上的。我认为作为创始人学会展现自信是至关重要的，这又回到了沟通这一点，即激励你周围的人，对吧？我不会想加入一家创始人对自己的想法完全没有信心的公司，对吧？因为这会显而易见地表现出来。投资人也不会想投资一个对自己想法完全没有信心的人。所以首先要学会为你正在做的事情建立自己的信心，然后向周围的人展现这种信心，我认为这是至关重要的。你周围会有很多人持怀疑态度。如果你不展现出这种信心，作为创始人，如果你都不这样做，显然没有其他人会这样做。你必须是那个这样做的人。\n\n(00:51:58):\n我认为你可以在展现这种信心的同时，对周围的人保持强烈的谦逊感。但我认为当涉及到初创公司时，学会拥有这种信心是早期阶段的重要部分，对吧？特别是如果你正在构建一些非常困难的东西，需要大量的工作和大量的资金，展现你会成功的信心对于所有怀疑你的人来说都是至关重要的。而怀疑你的人有很多，对吧？你只需要拥有超乎寻常的信心来证明他们是错的。我认为，再说一次，这与谦逊并不在一个光谱上。事实上，最成功的创始人往往是最……如果你没有强烈的谦逊感，你就无法激励周围的人。人们实际上不想和你共度时光，这意味着他们不想为你工作或投资你。同样，你需要两者兼备，但在你起步时它们服务于不同的目的。\n\nLenny (00:52:48):\n这创始人生活真是艰难。你必须成为一切。让我们看看下一个问题是否有很大不同。执行和战术 versus 专注于战略和更高层次的东西。你发现最成功的创始人会深入到什么程度？\n\nGustaf Alströmer (00:53:02):\n关于这个问题我其实有强烈的看法。我认为我们经常谈论战略的原因是因为这要追溯到商学院。商学院的起源是为了教人们加入企业界。在企业界，战略很重要，对吧？所以当你加入一家大公司，你是第2010号员工或类似的情况，那么你可能会有一个商学院的工作，思考企业战略是一件重要的事情。当你是一家小型初创公司时，战略并不重要，因为没有太多可以制定战略的内容。也许后来你可能会发现思考战略是有成效的，但战略某种程度上假设你可以同时做多件事情，而小型初创公司做不到。它们一次只能做一件事。所以执行才是对公司重要的事情。\n\n(00:53:51):\n每当有人想进行战略对话时，这就假设他们不理解自己的优先事项。优先事项总是一个从上到下的列表，其中有一件事比其他事情更重要。你不能真正就其他事情进行战略会议，因为只有一件事需要去做。所以对我来说，这里的明确答案是优秀的创始人是执行导向的，他们持续地专注于一个他们试图实现的优先事项。然后他们就一直朝着那个优先事项努力，接着新的优先事项会出现，你真的没有时间讨论公司战略。公司战略还假设你已经有了产品市场契合度(product market fit)，因为你已经有了一些正在运作的东西。如果你没有这个，那么让人们想要你的产品，这就是你的战略。你没有其他战略。\n\nLenny (00:54:36):\n很好。好的。我们发现了一个相当不同的，一个在光谱的这一边或那一边。那么独裁式的，有点像，我不知道，我想到的是像史蒂夫·乔布斯那样的 versus 共识式的、协作驱动的，如果这是一个光谱的话。那么你发现最成功的创始人可能适合哪里？\n\nGustaf Alströmer (00:54:53):\n我不知道我是否有这个问题的答案，因为我认为当你在早期阶段工作时，你可能看起来与在后期阶段工作时不同。我不会花很多时间和拥有数千名员工的创始人在一起，听他们如何在……当我和那些创始人交谈时，我是一对一地和他们交谈，我只从他们的角度听到。所以我实际上不知道他们在大型企业环境中是如何表现的。但当你是一家小公司时，你有三个人或五个人或十个人，你不能成为一个独裁的决策者。创始团队有一个创始团队的决策动态，可能看起来不同。有时候每个人都一起决定所有事情，有时候你说，\"我有我的专业领域，你有你的。我们分开决策。\"这些事情中的任何一种都可以。我认为你只需要有一个流程，这样你就不会在做出决定后重新讨论每个决定无数次。\n\n(00:55:42):\n我会说在那个时候最重要的事情是愿意遵守你和你的创始团队制定的流程。在不同公司的不同角色中，你的个人特质可能会不同。但为了让初创公司成功，你必须有一个关于如何做决策的具体流程。这些决策是在非常短的冲刺周期内进行的，比如每周或每两周。每个人都需要在事后对决策感觉良好。至少他们对流程感觉良好。我不认为你可以只是决定……你也不能完全协作，让每个人对每件事都做决定。所以小型初创公司就如何共同决策达成一致。在那之后，每个人只需遵循流程。事情通常就是这样运作的。\n\nLenny (00:56:27):\n好的，我还有一个问题。更关心产品还是更关心分发和增长策略？\n\nGustaf Alströmer (00:56:33):\n嗯，我会说这里面有很多假设，因为对我来说，关心产品就是关心客户。有时候如果我说，\"哦，伟大的创始人关心产品，\"很多创始人会误解为我对产品的个人看法或我对产品的想法。这是错误的。正确的理解是客户对产品的期望或使用。所以如果你的意思是关注产品或关心产品是在客户关心的那种意义上，那么绝对的，我认为这在早期是一件非常非常关键、重要的事情，比如与用户交谈，做那些不可扩展的事情(doing things you don't scale)。一旦你变大了，如果你没有找到一个可扩展的分发策略，你就不会成功。这对不同的公司来说是不同的，但它们不是在做任何不可扩展的事情。\n\n(00:57:27):\n做那些不可扩展的事情不是一个可扩展的策略。最终，一些具体的东西将是对你有用的东西。如果你幸运的话，人们会谈论你的产品，你会有有机增长(organic growth)。但在很多情况下，那就是销售，那是某种消费者分发策略。你不能从那个开始。我见过很多，这是当我不得不重置我的思维方式，从增长团队加入YC时，你不能用增长团队的心态来创办初创公司，因为那总是可扩展的东西。而你真正需要回到的是做那些不可扩展的事情，以及不可扩展的方式去思考客户。但一旦有东西开始运作，拥有增长思维是非常有用的，对吧？一旦你每天有成千上万的人注册所有东西，那么你如何达到2000人？嗯，那可能看起来更像增长团队或分发团队会做的事情。\n\n(00:58:21):\n我会说每个人对此都有不同的经验，基于他们之前的经验，对吧？所以如果你为一家无限成功的公司工作过，那么你就不会太在意这个。如果你为谷歌工作，你甚至永远不会想到这个，因为分发就只是网站。但如果你为一个真正小的糟糕产品工作过，那么你会想很多关于分发的事情，因为这对你来说是自然的，是你如何成功的。所以我认为归根结底，与客户交谈是最重要的。这对我来说就是关心产品的意义。然后分发是一旦有东西开始运作你肯定会大量投资的东西。\n\nLenny (00:58:53):\n太好了。好的。我可能还有一百个其他问题想问这方面的，但我想确保我们讨论另一个话题，我知道这是你非常关心的，那就是气候科技(climate tech)。所以我的理解是你在推动YC专注于气候科技作为一个重点领域方面发挥了重要作用。我相信你主导了他们最初的\"寻求初创公司\"(request for startups)计划，我想是这个术语，你们发布了像\"这是我们想要资助的对象\"这样的内容。我想你提到过在过去几批中你资助了几十家气候科技公司，这些大体上都正确吗？\n\nGustaf Alströmer (00:59:24):\n首先，寻求初创公司实际上是Sam Altman和其他几个人推动的。我们写进实际的寻求初创公司的第二个，我写的那个，是专门关注碳去除(carbon removal)的。然后自然地，那些申请气候科技想法的人会进入我的应用审阅队列，我会阅读它们并面试他们。不是所有人，但很多人。我认为今天我们已经资助了130多家以某种方式专注于气候科技的公司。\n\nLenny (00:59:53):\n哇。\n\nGustaf Alströmer (00:59:54):\n趋势线是真正有雄心的人想要在这个领域创办公司。他们中的一些人想要创办公司是因为气候科技是头号问题，但他们不把这视为非营利组织。现在我想做出这个区分。人们不知怎么认为创办一家气候科技公司是在为世界做好事，但可能也就这样了。事实是世界已经决定了。因为气候是我们面临的最大问题之一，如果不是最大的话，我们已经决定我们将停止做我们正在做的事情，我们将改变我们整个能源系统，改变我们所做的所有排放碳的事情。我们已经决定了，政府已经决定了这个。问题是它将如何发生，但这个决定已经做出了。\n\n(01:00:42):\n在这个转型中，我们谈论的是数万亿美元的资金从导致气候变化的事物转移到不导致气候变化的事物。这种转型的规模不是我们最近见过的。软件相比之下并没有那么大。它实际上比这个转型要小得多。所以我认为如果你看像特斯拉这样的公司，现在有，我不知道，6000、7000亿美元的市值，这只是一家公司，目前提供了美国所有汽车的几个百分点，新售汽车。这已经是世界上最大的公司之一，现在拥有世界上最富有的人。我们只是看到了这个的开始。人们正在做出的决定背后的经济动机与我想要解决气候变化一样强烈，因为这只是一门非常好的生意。这个变化吸引了大量你我认识的、听这个播客的软件创始人，他们说，\"我的技能在这里是相关的。我可以做很多事情。如果不能，我可以学习这些东西。\"\n\n(01:01:43):\n但最重要的是，在初创公司工作的技能对于加入这场转型真的非常关键。他们中的很多人已经创办了公司或加入了公司。我每周仍然会收到一封来自某位资深软件工程师的邮件，问我\"我应该去哪些软件公司工作来解决气候变化问题？\"我已经收到这样的邮件两三年了。这个领域就是能吸引非常非常有雄心的人。它没有停止，而是在加速。我感到很幸运能与这么多优秀的创始人合作，因为他们都是独特有趣的人。\n\nLenny (01:02:16):\n我注意到完全相同的情况，就是有多少聪明、有干劲、出色的人都在说：\"我只想转到气候科技公司。这是我现在唯一在寻找的。\"我要给你点个赞，我觉得你在这个已经开始发生的转变上走在了前面，并推动YC很早就关注这个领域。我总是想：\"天啊，我认识Gustaf，我觉得Gustaf在推动初创公司投资和关注气候方面产生了如此巨大的影响。\"所以我想为你做的这些以及在这么多方面处于前沿而给予巨大的赞扬。\n\nGustaf Alströmer (01:02:50):\n谢谢。我的意思是，有时候我会说，对于拥有YC这样的信誉的人开始接受这些公司是很重要的。这确实很重要。我记得2018年当我和Pachama的Diego交谈时，他正在创办Pachama，我们在YC的白板前讨论。他是YC校友，正在创办一家不同的公司。当时\"气候科技\"这个词还不存在。人们不确定投资者是否会资助这样的公司。Pachama已经融资6000万美元，拥有很多大客户，很多员工，显然发展得非常好。但我认为在2018年的时候这是未知的。它之所以未知的原因之一是我们之前在2008、2009、2010年有过清洁科技泡沫，由于一些特定原因没有成功，投资者因为之前发生的事情留下的创伤或伤疤而害怕投资这些领域。\n\n(01:03:46):\n现在情况完全颠倒了。投资气候科技的新投资者数量和我们在过去十年或二十年中看到的任何其他趋势一样大。投资方面有着巨大的关注。最近，我和另一个叫David Rusenko的人写了这个\"初创公司需求\"，一个新的更新的、非常详细的清单...我希望我们可以把它放在节目注释里，一个非常详细的想法或领域清单，我们认为如果你想创办一家公司，这些可能值得关注。\n\n(01:04:18):\n现在，我们不知道好的想法是什么样的。我们不知道。但我们可以告诉你所有机会存在的领域。我们应该去寻找好的想法。我们写这个是为了回应所有那些来找我们说\"我想做气候科技。我没有好的想法，因为我在这方面没有任何具体经验\"的人。然后我们就说：\"不要做这三件事，但去做这25个方向中的任何一个。\"它已经产生了良好的反响。我认为它会产生更多反响。但我认为YC告诉世界我们关注并资助这些东西是很重要的。这一直是我们发布初创公司需求的原因，就是让人们知道这些是我们真正想要资助的东西。\n\nLenny (01:04:58):\n实际上几周前我主持了一个小组讨论。这个叫Climate Draft的组织召集了从事气候科技的产品经理们。很多问题就像：\"我需要什么样的背景才能转入气候科技初创公司来创办一家气候科技公司？\"有趣的是，每个人一次又一次地说：\"你的常规产品经理技能就是我们所需要的全部。\"公司里已经有很多在科学方面的专家，如果你没有经验也没关系。他们只是需要商业经验、如何运营、如何执行，产品经理学习的标准东西。那么你同意吗，你不需要在科学和气候方面有深厚的背景就能进入这个领域？\n\nGustaf Alströmer (01:05:41):\n是的，我会说如果你在软件公司工作，甚至一些硬件公司，这可能通常是对的。绝对是。拥有那种背景比拥有这种特定领域专业知识背景要有价值得多。这些是互补的。但作为产品经理，拥有扎实的产品经理背景是更有价值的部分，我会说。成为一个有竞争力的产品经理，来自一个非常好的产品管理文化，知道什么是好的样子，这对这些公司来说是无价的，因为过去他们无法雇用这些人。所以我100%同意。\n\n(01:06:14):\n就创始人而言，我什么都见过，对吧？我见过有一些领域专业知识的人创办公司并真正成功。我见过没有领域专业知识的人学习他们需要知道的一切。也许他们与有领域专业知识的人合作，然后成功了。我都见过，我实际上认为你可以在这些类别中的任何一个成功。你不需要深厚的专业知识。这真的取决于你所在的领域。但像Pachama这样的公司，Diego和Tomas除了个人经验外，并没有森林方面的专业知识。他们只是有解决问题的意愿，这对他们来说真的很有效。\n\nLenny (01:06:51):\n你提到你有这个你感到兴奋的领域清单。我知道我们会在节目注释中分享，但有没有你想强调的，比如这些是你最兴奋的领域，想要资助的，或者有没有你想提到的公司，在这个领域非常有趣和非常酷，人们应该知道的？\n\nGustaf Alströmer (01:07:04):\n我们写了这个清单，我们在每个类别中都突出显示了公司。我不知道我是否想强调任何特定类别，但我可以谈谈我们过去资助的一些真正有潜力的东西。所以我通常是这样思考气候科技的。我们必须对我们做的所有产生排放的事情进行脱碳。这意味着我们必须改变世界上的一堆东西，改变交通、改变能源、改变住宅，所有这些东西，或者改变我们如何给住宅供暖等等。\n\n(01:07:35):\n然后是碳移除(carbon removal)。碳移除有点像，即使我们把所有这些事情都做得很好，可能也不够。因为有机会，也有一些证据表明我们实际上可以以某种方式从大气中移除碳，所以很多公司也在同时做这个。我会说我们需要同时做这两件事，它们不冲突。我们可能需要做这两件事。嗯，我们肯定需要做第一件事。\n\n(01:08:02):\n在脱碳方面，我们社会中有无数产生大量碳的类别，对吧？我给你举个例子。航运是一件大事。很多碳排放来自世界各地的货船。这没有明显的解决方案来解决这个问题，因为他们使用的那种油真的很便宜，这是一个利润率非常低的行业，除了即将出台的监管外，他们没有太多改变的动力。所以这不是一个理性的解决方案，有人会建造一批测试船，然后就成功了。但我们在该领域资助的两家公司，其中一家是Seabound，他们正在为船舶建造碳捕获和移除系统。\n\n(01:08:41):\n另一家是Fleetzero,他们制造电动船。电气化一次又一次地被应用,事实证明这是一种比以前用内燃机做任何事情都更有效的方式。它几乎不需要维护。制造成本更便宜。电池更贵,但它更清洁,符合你的碳目标。这里有很多好处,但也有局限性。通常电气化的局限性与电池有关。就像你能走多远?现在这个类别是我所说的...这是一个非常重要的关键类别,就是碳核算和某种推荐系统,帮助大公司核算他们拥有的碳,并给他们一些关于该做什么的建议。\n\n(01:09:25):\n所以我给你三个例子。我们资助了Unravel Carbon,这是新加坡的碳核算软件,专注于亚洲,可能是那里领先的。有一家叫Carbon Chain的公司,专门关注供应链、航运和原材料之类的东西,来自英国。然后是湾区的ANAI。谁知道这个市场会如何发展,但这个市场现在就有碳核算的客户需求,对吧?所以世界上所有的大公司要么向政府承诺,向股东承诺,向公众承诺,甚至可能向员工承诺,他们要去脱碳。他们并不总是知道如何做到这一点。这些软件平台就像即插即用的\"这就是你该怎么做\"。\n\n(01:10:07):\n然后我给你两个例子,如果你没有任何特定领域专业知识,只是一个优秀的软件工程师,你可以进入的领域。有一家叫Enode的公司。他们基本上在为电动汽车充电器和家庭能源系统构建Plaid。所以如果我们想象所有家庭的未来或所有电动汽车充电的未来将是一堆由小型计算机运行的能源设备,它们都是wifi连接的,你可以连接到它们并做事情,告诉它们开启、关闭、便宜时开启、任何时候关闭,所有这些对能源电网有价值的不同事情。那么你需要一个软件平台来连接所有这些。这就是Enode一直在构建的。\n\n(01:10:48):\n另一家相关公司叫Static。Static是印度电动汽车充电的Airbnb。你需要这样的东西的原因是你没有特斯拉充电。你实际上一般没有公共充电。人们的车库里没有插座,他们也没有车库。所以你需要建立一个新的自下而上的电动汽车充电系统或平台,这就是Static一直在做的。他们实际上也在建设公共充电基础设施,但他们有自己的应用程序。所以如果你使用Static应用程序,他们会引导你到所有Static充电器。我相信他们是印度最大或增长最快的电动汽车充电网络,印度现在是世界第二大国家,如果不是最大的国家的话。\n\n(01:11:25):\n所以这些想法的潜力,即使它们现在做得很好,也是无限的,这是一个巨大的市场。如果你在这些事情中的一个成功了,我不认为我们会有像今天这样多的加油站和不同的网络。我们在电动汽车充电方面不会有同样的情况。它将更多地围绕最终用户的使用体验和他们打开来做这些事情的应用程序进行整合。所以我非常确信软件企业家有真正的巨大机会来解决这个问题。当前批次中有一些公司也专注于此。\n\n(01:11:59):\n我要提到的最后一个是Heart Aerospace。我们有Heart Aerospace、Right Electric和其他几家专注于航空的公司。航空是另一个难以脱碳的大领域。Heart和Right专注于电池电动飞机。所以他们基本上在制造使用电池和电动马达飞行的商用飞机,看到这些令人难以置信。\n\nLenny (01:12:22):\n太棒的清单了。我们一定会在节目注释中附上所有这些公司的链接。我在想的是，你提到的一个颠覆性叙事是气候科技领域实际上是有钱可赚的。这不再是一个以影响力为导向的市场了。讨论一下为什么会发生这种变化可能很有价值，但我想探讨的问题是，事情正在好转。正在取得很多进展。人们看到气候变化时会想\"我们完了，游戏结束了\"。但感觉电池价格在下降，太阳能成本在降低，风能在增长，所有这些初创公司都在投资。所以很想听听哪些方面进展顺利，哪些方面值得乐观，但同时也想了解\"好的，是的，事情进展不错，但仍有一些不太理想的地方需要我们加倍努力。\"\n\nGustaf Alströmer (01:13:10):\n过去12个月或24个月里有两件具体进展顺利的事情。第一件是政治方面。在美国我们通过了IRA（Inflation Reduction Act，通胀削减法案）。这个名字有道理，因为向更清洁能源的转变确实会降低通胀，因为它降低了能源成本。但这实际上是一项气候法案，对吧？它真正关注的是将绿色经济的大量供应链转移到国内，并激励我们刚才谈到的许多变革。无论是碳移除、家庭能源还是家庭供暖，无论是什么，这项法案都涵盖了所有内容，而且规模巨大。所以这是一个非常好的消息。在这方面，美国政治很长时间都没有好消息了。实际上可能从来没有过。\n\n(01:13:52):\n第二个好消息，而且是如此好的消息以至于欧洲现在正试图跟进。他们试图用自己的法案来应对IRA，因为他们看到一些电池公司说：\"嗯，我实际上要在美国而不是欧洲建下一个工厂了。我改主意了。\"\n\nLenny (01:14:05):\n哦，哇。\n\nGustaf Alströmer (01:14:05):\n所以欧洲现在也必须用他们的激励措施来应对。第二个好消息是企业现在成为了客户。也许三四年前你去找一家财富100强公司，你会说：\"嘿，你想买我的某某脱碳解决方案吗？\"可能是软件平台、电动车或其他什么。他们会说：\"嗯，去找这层楼的某个人谈谈。也许他们能帮你。\"而这个人实际上并没有权力做决定。这种情况已经改变了。现在他们会说：\"实际上，我们向股东承诺每年减少2%的排放，我们也向政府承诺，向公众承诺要做到这一点。所以我们必须做到。\"他们会问：\"我们从哪里开始？首先要脱碳的2%是什么？也许从能源开始。哦，我们换能源供应商。\"但他们现在作为客户出现，不只是签署意向书，而是支付实际合同费用，对吧？对这些公司进行投资，因为他们都看到了未来，不想落后。\n\n(01:15:02):\n这背后有财务动机。他们想获得带有某些附加条件的资本，但他们不想落后。他们不想成为丰田之于特斯拉那样的角色，丰田说：\"我们不会做纯电动汽车。\"他们有时仍然这么说，而其他所有人都在说：\"特斯拉才是我们要复制的对象，因为那是赢家。\"所有这些企业都非常害怕成为丰田。他们真的很害怕成为最后一个不改变的企业，然后世界会超越他们，他们就会死亡。所以我认为这里的动机本质上是生存，真正是要采纳这个方向，因为这是世界发展的方向。\n\n(01:15:39):\n我认为这是两个最好的消息。关于这一点...我们在创业需求(request for startups)中也写到了这一点。这不是一件你可以说服所有人都同意你的事情。即使你做到了，人们也不知道该做什么。所以你必须把这看作一个经济机遇，然后说...我们不能说服所有人这将会发生。实际上说服所有人并不重要。重要的是有足够数量的企业相信这一点，从而改变他们的习惯。然后你就可以把你正在开发的东西卖给他们。\n\n(01:16:09):\n作为创始人，只需专注于你的客户，专注于B2B。这是我在这里向大多数人推荐的做法，因为这是大部分变革将要发生的地方。这就是为什么我对这些初创公司和创始人非常乐观。在我看来，他们所做的事情比某人开展一场试图说服其他人这是一个大问题的活动更有影响力。即使人们知道气候变化是个问题，他们也不知道该如何应对。但初创公司的创始人们，他们知道。\n\nLenny (01:16:37):\n你提到了这一点，但感觉最大的转变之一是资本主义介入并开始倾向于气候科技初创公司，这正在...\n\nGustaf Alströmer (01:16:46):\n是的。绝对是。绝对是。\n\nLenny (01:16:48):\n...产生重大影响。好了，我们已经到达了对话的最后部分，这是非常激动人心的快问快答环节。我有六个问题要问你。准备好了吗?\n\nGustaf Alströmer (01:16:58):\n好的。\n\nLenny (01:16:59):\n你最常向其他人推荐的两三本书是什么?\n\nGustaf Alströmer (01:17:04):\n我推荐的第一本，我想我这里有。是的，这本。它叫《The 100% Solution》(百分百解决方案)。作者是Solomon Goldstein-Rose。这本书适合那些认为气候变化是个问题但不知道该怎么办的人，或者那些感到绝望或认为\"啊，所有人都会死\"的人，对吧？有些书的结论是\"我们都会死\"，但事实是我们不会都死掉。这本书试图详细涵盖100%的所有解决方案，是我们写的创业需求的更详细版本。它让你真正乐观起来。我把这本书推荐给任何关心气候变化的人，因为它真正从一个非常乐观的角度来看待世界。这就是为什么我推荐这本书胜过几乎任何其他书。这可能是我的首选书籍。\n\nLenny (01:18:00):\n太棒了。我喜欢这种\"如果只推荐一本书，这就是你必须读的书\"的方式。我喜欢这种做法。你最近喜欢的电影或电视节目是什么?\n\nGustaf Alströmer (01:18:10):\n哦，我看了很多。我不知道。我喜欢Netflix上的《Emily in Paris》(艾米丽在巴黎)。我觉得现在电视对我来说有不同的用途。就是娱乐而已。\n\nLenny (01:18:22):\n是的，我理解。\n\nGustaf Alströmer (01:18:24):\n但我还看了什么电影?我们看了《Everything Everywhere All at Once》(瞬息全宇宙)。我觉得那是一部非常好的电影。那部...\n\nLenny (01:18:30):\n是的，它可能会赢得最佳影片奖。\n\nGustaf Alströmer (01:18:32):\n是的。\n\nLenny (01:18:32):\n我们这里有个饮酒游戏。人们说《White Lotus》(白莲花度假村)，我们就喝酒。所以你没有提到，这可能是件好事。你在面试YC创始人时最喜欢问的面试问题是什么?\n\nGustaf Alströmer (01:18:43):\n自从你申请YC以来，你在产品上做了什么?自从申请以来你完成了哪些具体的事情?因为那通常是一两个月前的事了。\n\nLenny (01:18:51):\n太棒了。这与你之前说的非常契合。\n\nGustaf Alströmer (01:18:55):\n我希望答案是：\"这是我们做的所有事情。\"\n\nLenny (01:18:59):\n而不是\"我们只是为这次面试做了准备\"。\n\nGustaf Alströmer (01:19:01):\n没错。没错。\n\nLenny (01:19:02):\n你资助过的最疯狂的初创公司是哪家?\n\nGustaf Alströmer (01:19:07):\n我想我会说当我走进Heart Aerospace的机库时。我可以给你发张照片。确实，我看着一架正在制造的飞机，我就像\"我的天，这是什么?\"没有哪家SaaS公司的办公室你可以走进去然后张大嘴巴说：\"这到底是什么鬼?\"有一些这样的公司，太空公司或航空航天公司之类的，当你资助它们并能触摸到它们时，感觉就完全不同了。我现在对这类事物有了很多欣赏，因为它们做起来要困难得多，但当你成功时，它们更加具体，你可以说：\"我在这个太空火箭或这架飞机或我们头顶的这颗卫星中有一小部分。\"我真的认为这在某种程度上是一种强大的遗产，与其他一些仅仅存在并替代其他软件的东西相比。所有这些都是更好的业务，但它们都是强大的遗产。\n\nLenny (01:20:06):\n申请YC的专业建议是什么?\n\nGustaf Alströmer (01:20:09):\n专业建议。第一件事是去YouTube搜索...我想我们录制了一个视频，关于如何成功申请[听不清 01:20:18]。这是一个长达一小时的视频，为你提供所有关于如何申请的专业建议。我们提前告诉人们：\"看完这个视频后，看看你是否认识任何做过YC的人，然后联系他们，也许问问他们YC是否适合你，但也问问他们在你准备申请YC、撰写申请、面试期间，哪些事情很重要?\"这可能是我会做的两件事。\n\nLenny (01:20:46):\n最后一个问题，访问瑞典有什么专业建议?\n\nGustaf Alströmer (01:20:49):\n首先，你应该在夏天去。那是一个非常好的时间。冬天的瑞典是一个非常不同的国家。试着走出城市进入大自然，然后要做好心理准备，瑞典人不都是美国人。他们会更冷淡一些，与你保持更多距离，他们不会像我在美国学会的那样随意和你交谈。我认为你只需要接受一种与美国这里略有不同的氛围。实际上大多数人都很喜欢。大多数去过的人都喜欢，但他们大多数是在夏天去的。\n\nLenny (01:21:23):\n这让我想起来，我本想结束对话，但有一条推文说在瑞典当你去别人家时，他们不会给你食物。不期望你会有食物。你必须自带食物。这是真的吗?这是怎么回事?\n\nGustaf Alströmer (01:21:35):\n这绝对是真的。我实际上做过一个非正式会议的演讲，主题就是这个。那次非正式会议演讲的内容是瑞典人做的所有奇怪的事情以及原因。如果我总结一下，是的，我们确实这样做。我实际上经历过这种情况。我去朋友家，他们吃晚饭时我在朋友的房间里等着。这很正常。为什么会发生这种情况?我认为瑞典有一种强烈的个人责任感，从美国或外国人的角度来看，这有点不友好，[听不清 01:22:10]因为这太疯狂了。但在瑞典这很正常：\"嗯，你照顾你的孩子。我照顾我的孩子。\"这根本不是个问题。\n\n(01:22:18):\n我认为很多关于瑞典人为什么很奇怪的动机，其中之一就是我们不想欠别人的人情。所以我们永远不想感觉像是……这就是为什么你不会……例如，如果你在瑞典去酒吧，你不会请一轮酒，你只买自己的啤酒，因为也许你必须在一天结束时算清楚钱，诸如此类的事情。我认为这实际上是一个相当个人主义的社会，但我会说这是一个有温度的个人主义。它是有温暖的，但对于那些不太理解这一点的人来说，肯定会显得很奇怪。他们认为人们很冷漠，他们只是不明白这些东西背后实际上是有温情的。\n\nLenny (01:23:00):\n老实说，这个系统听起来真的很聪明。我会喜欢它，但我能理解人们会非常困惑。Gustaf，我真的非常感谢你做这期节目。这太棒了。我知道听这期节目的人会离开时获得信息、受到启发、充满动力，希望他们能被激励去更快行动、取得更多进展。最后两个问题。第一，如果大家想了解更多或者向你提问，他们可以在哪里找到你？第二，听众如何能帮助到你？\n\nGustaf Alströmer (01:23:27):\n我有时会在 twitter.com/gustaf 上发推文。我发布的最有用的内容可能是在 YC 的 YouTube 频道上。所以我录制了几个关于增长、销售、如何与客户交谈的视频。我实际上整天都在把这些视频发给别人，因为我们制作的 Start School 视频投入了大量准备工作，它回答了人们的大部分问题。所以我会说，先看那些视频。但是，有时我也会发一些其他内容的推文，人们可以关注。这没问题。人们如何能帮助到我？我喜欢听到创始人的反馈，他们在做什么。我想听他们对公司的疑问。但我也想真正强调的是，申请 YC 时，你不需要认识我们任何人。你不需要联系我们。这不会产生任何具体的区别。\n\n(01:24:15):\nYC 的原则是，你应该能够在不认识任何人的情况下成为 YC 在硅谷的内部人士。这就是申请流程的意义所在。所以如果你有问题，请随时联系我们，但不要觉得这是成为一个好的 YC 申请者的必要条件。实际上恰恰相反，我们平等地阅读和对待所有申请。非常感谢你听完这期播客。我的意思是，你能听到最后让我很高兴。\n\nLenny (01:24:44):\n是的，听到最后有额外加分。我还想说，当你说这些的时候，感觉 YC 对世界来说是一股非常好的力量。它促成了如此多的创新和进步。如果说技术是推动世界前进的动力，YC 就处于其中很多的核心位置。所以对 YC 正在做的事情以及你正在做的事情，Gustaf，致以巨大的敬意。\n\nGustaf Alströmer (01:25:02):\n我们对此确实感到很大的责任。这是肯定的。\n\nLenny (01:25:05):\n好的，我让你去忙了。再次感谢你，Gustaf。\n\nGustaf Alströmer (01:25:09):\n非常感谢。\n\nLenny (01:25:12):\n非常感谢收听。如果你觉得这期节目有价值，你可以在 Apple Podcasts、Spotify 或你最喜欢的播客应用上订阅本节目。另外，也请考虑给我们评分或留下评论，因为这真的能帮助其他听众找到这个播客。你可以在 lennyspodcast.com 找到所有过往的剧集或了解更多关于本节目的信息。下期节目见。",
  "chunks_count": 9
}