{
  "guest": "Jason Feifer",
  "en": "Jason Feifer (00:00:00):\nThe editor, the writer, I'll just say it as plainly as possible. They don't care about you. They don't care about you. They care about their reader or their listener or their viewer. That's who they care about. That's who they're serving, and if you can be of use to them in sharing the kinds of information that they are looking to serve their audience, then you can get what you want. But you can't treat them like a service provider because they're not. And so you have to approach them with an understanding of what they're trying to do for their audience and how you can fit into that because if you don't, they are not interested in you.\n\nLenny (00:00:47):\nToday, my guest is Jason Feifer. Jason is editor in chief at Entrepreneur Magazine, previously an editor at Fast Company and a number of other magazines. He's also an author, podcast host, keynote speaker, and startup advisor. In our conversation, we get incredibly tactical about how to get press for your product. Jason shares how to pitch a journalist, how to find the right journalist to pitch, what publications to consider, why freelance writers are more likely to write about your story, why the mission of the publication is so important in how you pitch them, plus what channels to use to reach out to journalists, how to think about your goals and what success looks like from getting press, so much more.\n\n(00:01:25):\nI learned a ton from this conversation, and if you're looking to get press for your stuff, you'll find so much value here. With that, I bring you Jason Feifer after a short word from our sponsors. This episode is brought to you by Sidebar. Are you looking to land your next big career move or start your own thing? One of the most effective ways to create a big leap in your career, and something that worked really well for me a few years ago, is to create a personal board of directors, a trusted peer group where you can discuss challenges you're having, get career advice, and just kind of gut check how you're thinking about your work, your career, and your life. This has been a big trajectory changer for me, but it's hard to build this trusted group.\n\n(00:02:05):\nWith Sidebar, senior leaders are matched with highly vetted, private, supportive peer groups to lean on for unbiased opinions, diverse perspectives, and raw feedback. Everyone has their own zone of genius, so together, we're better prepared to navigate professional pitfalls, leading to more responsibility, faster promotions, and bigger impact. Guided by world-class programming and facilitation, Sidebar enables you to get focused tactical feedback at every step of your journey. If you're a listener of this podcast, you're likely already driven and committed to growth. A Sidebar personal board of directors is the missing piece to catalyze that journey. Why spend a decade finding your people when you can meet them at Sidebar today?\n\n(00:02:46):\nJump the growing wait list of thousands of leaders from top tech companies by visiting sidebar.com/lenny to learn more. That's sidebar.com/lenny. This episode is brought to you by Maui Nui Venison, a mission-based food company, bringing the healthiest red meat on the planet directly to your door. I actually joined Maui Nui Venison earlier this year after hearing their app on the Tim Ferriss Podcast, and I'm excited to be spreading the message further. Not only does this company provide the most nutrient-dense and protein-dense red meat available, their operation produces the only stress-free 100% wild harvested red meat on the market that is the only one of its kind in the world, actively managing Maui's invasive access, deer populations, helping to restore balanced, vulnerable ecosystems, food systems and communities in Hawaii.\n\n(00:03:33):\nAlso, it is seriously delicious. Not at all [inaudible 00:03:37] and easy to cook. My wife and I made stew and steaks and all kinds of grilled goodies with the meat. We also feel great about it as a protein from an ethical standpoint. I highly recommend trying their all-natural Venison jerky sticks for an optimal protein snack, as well as a wide variety of fresh cuts, all available in their online butcher shop. There are limited memberships available, but you can sign up and get 20% off your first order at mauinuivenison. com/lenny. That's mauinuivenison.com/lenny. Jason, thank you so much for being here, and welcome to the podcast.\n\nJason Feifer (00:04:13):\nLenny. Thanks for having me.\n\nLenny (00:04:14):\nIt's absolutely my pleasure. We've actually collaborated on a couple of things recently, and as we were chatting about some stuff, I was asking for advice on how to help a startup I'm working with get press, and you shared a bunch of killer advice, and so I asked if you could just come on this podcast and share similar advice for how to help startups get press and here we are.\n\nJason Feifer (00:04:36):\nYeah, I'm really happy that you asked me to do that. This is something people ask me about a lot. I've been in media for decades. I've worked at a lot of different magazines. Obviously, I run Entrepreneur Magazine now, but I was a Fast Company. I was at Men's Health, so I've seen a lot of different sides of media, and it is a very misunderstood tool, particularly for people in business, and so I love demystifying it.\n\nLenny (00:05:00):\nAmazing. I'm excited to learn all this too, and so thanks for doing this.\n\nJason Feifer (00:05:04):\nYeah.\n\nLenny (00:05:04):\nFirst question is just, as someone in press, how much volume is there coming at you from startup founders and PR people trying to get you to write about them and also just reporters that you work with?\n\nJason Feifer (00:05:15):\nYeah, it's tremendous. It's ridiculous. I would say that by the time we are done recording this podcast, I'll have, I don't know. I mean, it could be anywhere from 30 to 50 pitches in my inbox. It comes all day. Now, to be clear, most of that is garbage in the real garbagey sense, right.\n\n(00:05:36):\nIt's a lot of completely unrelevant press releases that were sent to me and a bazillion other people. But within, there are definitely some people who have spent the time to reach out very specifically to me, and everybody in media gets some kind of volume like that. To reach out to somebody in media is to be shouting over a lot of noise.\n\nLenny (00:06:01):\nWow. I imagine we'll get to this later, but I'm curious just what percentage of those are PR people and press release versus a founder or someone that is doing it themselves?\n\nJason Feifer (00:06:12):\nThe percentage of direct messages from founders that I'm getting is low. I would say probably 20, 25%. And then the 75% is PR in some capacity, either targeted PR where somebody's intentionally reaching out to me or mass blast press releases.\n\nLenny (00:06:30):\nYou know what's crazy is I've been getting a lot of these now. People think I'm some kind of journalist, and they're just like embargoed announcement product launch.\n\nJason Feifer (00:06:37):\nIt doesn't take much because you just end up on some list, and what's really interesting, and we'll talk about PR later, I know. But one of the great insights that you can get into the challenges of that industry is how completely automated a lot of it is where a lot of people in PR are not thinking specifically about how to tell the right story to the right potential media outlet. Instead, what they're doing is they're just playing a numbers game, and they're just blasting it out to everybody.\n\n(00:07:13):\nAnd that means that you could end up... I write this newsletter, right. I have... Entrepreneur Magazine is the thing that people obviously would pitch, but then I have this newsletter where I don't interview anybody. There's no opportunity to be featured in my newsletter, and I still get pitches to the newsletter because somebody saw it and dropped it in some spreadsheet, and it just... now I get it. And I think that's a real disservice to entrepreneurs who are paying for people to do that, and I really hate that.\n\nLenny (00:07:41):\nYeah. Okay, so we're going to get into the meat of just how to actually do this well, but a couple more questions just to set a little context. One is in terms of impact. What kind of impact have you seen from getting press for a startup in terms of growth for their product specifically?\n\nJason Feifer (00:07:57):\nSo it's a really wide range. I have had entrepreneurs tell me that a single story in Entrepreneur Magazine, like the print magazine or just online, will drive more, whatever more app downloads, more sales that month than any of their paid marketing efforts.\n\n(00:08:16):\nBut then I have also heard entrepreneurs tell me that it didn't do anything for them or that it did one very specific thing for them, which is to say maybe some potential partner read it and reached out, and it started an interesting conversation. It's all over the gamut, and it's a really important thing for people to remember is that this is not something that I think that you should bank on as a strategy for growth. It's a great add-on. But if you think that press by itself is going to solve your problems, you're wrong because it might, but it's way too unpredictable.\n\nLenny (00:08:48):\nIs there anything else along those lines of just when it's worth somebody investing time into getting press, either stage of startup, type of startup, any just general broad advice of you should not be spending time on trying to get press versus this is a really good opportunity for you.\n\nJason Feifer (00:09:02):\nThink about press the same way that you think about raising money, which is to say you do it when you know what the money is for, and you should do it when you know what the press is for. A lot of people reach out to me at such an early stage that if we wrote about them, it wouldn't get them anything. They're not at a stage where they could use that press in any meaningful way, and so there's really no purpose in chasing it now. You should step back and think really as a starting point, \"What do I need press for?\" And if you have a good tactical answer to that, that could be because I need to drive awareness to a new product. That could be because I'm going out to raise money, and I need articles to show that the marketplace takes me seriously.\n\n(00:09:55):\nThese are good reasons, but I get a lot of emails. It's funny because people are... like entrepreneurs, in particular, they're just so vulnerable, and it's kind of a wonderful way sometimes. And sometimes people will just email me, and they'll just say, \"You know, I've worked really hard, and I just feel like I deserve this.\" I respect that, and I relate to it in some ways with my own trying to get attention for my own work. But, \"I deserve this\" that's not a good tactical decision for your business that doesn't do anything for you. And so I would put that to the side and only think of press as you don't go out and raise money if you don't know what the money is for. You shouldn't go out and try to get press if you don't know what the press is for.\n\nLenny (00:10:38):\nI'm curious to hear other examples when it's not, when it's a bad idea because, as like I said, an outside observer, I would always love to get more attention for my product and more people to be aware of it, more people to check it out. Is there an example or anything that comes to mind of there's no need for you to do that in this moment or for this product?\n\nJason Feifer (00:10:55):\nOftentimes, it's not even about the moment, but it's about the publication. So I'll give you an example. I spoke at an event once, and afterwards, this guy comes up to me, and he has a small hot dog food truck business in Washington, DC. So he said he's got a couple trucks, and he's doing good business selling hot dogs, and he wants coverage in Entrepreneur Magazine. He's like, \"Oh, how can I get a feature?\" And the problem with that instinct that he has is that he's really directing his energy in the wrong place because if he is selling hot dogs in Washington, DC, then I understand what press is for him. Press is to drive hotdog sales. That's what he wants to do. Entrepreneur is not going to do that for him. Full stop. Why? Because Entrepreneur reaches a national to international audience.\n\n(00:11:52):\nSo that means that 99.5% of the people who would read a story about this guy have no ability to go get his hotdogs, which means that that was wasted effort. So fine. Was it that hard to come up and talk to me at the conference? No. But scale that out. How many emails is he sending that are like that? How much energy is he putting into chasing things that ultimately don't have good direct value to him? What he needs to do is think, \"Okay, my goal, get more people to buy hot dogs. Where am I? I'm in Washington, DC. How can I reach people who are interested in food in my market?\" So stop chasing Entrepreneur and start chasing the local eater or the food section of the Washingtonian or something like that. That small shift can give you a lot more payoff for your effort.\n\nLenny (00:12:38):\nThis is a good segue to just let's just dive into how to actually go about getting press, and I know you-\n\nJason Feifer (00:12:38):\nYeah.\n\nLenny (00:12:42):\n... kind of have this three-step structure for thinking about it. Maybe just start with what are the three steps, and then we'll dive into each one.\n\nJason Feifer (00:12:50):\nYeah, sure. So I mean, look, it is pretty simple, right. Step one is prep. You want to be thinking about how to tell your story. You want to be thinking about the kinds of stuff I just talked about. What is press for for you? Everything that you need to do to orient yourself towards what is this opportunity, and why am I chasing it, and how to make the most of it. Step two is figuring out who to pitch. Not all press is created equal. There are not reasons to just go chasing everybody arbitrarily. The hotdog example is a good one.\n\n(00:13:19):\nSo finding the writers and editors who you're actually going to reach out to, who are going to most receptive to you. And also making sure that because you did the prep, you can figure out how to tell your story in a way that they're going to be interested in. We'll talk about that. And then step three is the actual pitch. What does it mean to reach out to these people, to engage the writers and editors? How do you find them? What do you send them? What are you telling them? That's it.\n\n(00:13:42):\nI mean, right. But what you need to understand is that you're entering a world that probably doesn't operate the way in which you think it does, and I see that all the time as the recipient of pitches. People don't understand who they're reaching out to and how I and my colleagues think. We should maybe even start with that because a really important thing to understand just again, to go to [inaudible 00:14:07]-\n\nLenny (00:14:07):\n[inaudible 00:14:07] do it. Yeah.\n\nJason Feifer (00:14:08):\n... yeah, the metaphor of the investors, you don't reach out to an investor if you don't understand what that investor does, what they're interested in, or what kinds of companies they invest in. You can't do that with media, either. So I get pitches every single day along the lines of, \"How do I get coverage in Entrepreneur Magazine? How do I get a feature in Entrepreneur Magazine?\" And to me, it always feels like they're ordering a hamburger from me. Like, \"How do I get a hamburger from Entrepreneur Hamburgers, right?\" They're treating me like a service provider. That my job is to provide press.\n\n(00:14:44):\nAnd I get it because, of course, if you're an entrepreneur, and you're looking for press, then the... [inaudible 00:14:51] writers and editors out there seem to be in the business of writing about people, and therefore, there's some service that they seem to provide, and you're trying to figure out how to get it. But that's not how the media thinks of themselves, right. The editor, the writer, I'll just say it as plainly as possible, they don't care about you. They don't care about you. They care about their reader, or their listener, or their viewer.\n\n(00:15:18):\nThat's who they care about. That's who they're serving. And if you can be of use to them in sharing the kinds of information that they are looking to serve their audience, then you can get what you want, but you can't treat them like a service provider because they're not. And so you have to approach them with an understanding of what they're trying to do for their audience and how you can fit into that. Because if you don't, they are not interested in you.\n\nLenny (00:15:49):\nI love that. And more... even specifically, what is it they're trying to do for their audience? I imagine it's just have something interesting that they want to read. Something they can learn. Something they're like, \"Wow, I'm really excited to read this.\"\n\nJason Feifer (00:16:00):\nYeah. But it's going to be more specific based on the mission of each publication. So, for example, I've worked at two separate business titles. I was a senior editor at Fast Company for a number of years, and now I'm the editor-in-chief of Entrepreneur Magazine. The decision that is made about whether or not a story belongs in a publication, it was totally different based on these two publications. So I can't speak to Fast Company now because they've gone through a couple of leadership changes. I don't know what their mission is, but back when I worked there under Bob Safian, he was the editor-in-chief, that was really a magazine about where businesses going, and the stories that were in the magazine were all supposed to be in some way representative of the evolution of business.\n\n(00:16:50):\nAnd so when people would pitch what we'd really be looking for are, are there insights into... in what this person is doing that other people could read and say, \"Aha, that helps me understand where this industry is going or that industry, or it helps me think about how I can shape my own company to match current trends,\" that kind of stuff. Entrepreneur, totally different mission. The way that I think of Entrepreneur is that it's not even a magazine about business. It's a magazine about thinking. Or what I want to do is make sure that everybody who comes to the magazine walks away with great insights into how to think through the challenges in their business.\n\n(00:17:29):\nAnd so what I'm looking for when somebody reaches out is did they make some interesting counterintuitive decision that solved a problem in their business, and I'll emphasize in. Because, oftentimes, when people hear me talk about solving problems in business, they think, \"Aha, but I solve a problem in business, right. I saw that there weren't the best razors in the world, and I made the best razors.\" That's not what I'm talking about. What I'm talking about is... There's this woman whose name is Joelle Mertzel. She has a company called Kitchen Concepts Unlimited, and she makes a butter dish, and it's a really smart butter dish because it is built on a hinge, right. So this is designed to solve a very specific problem, which Lenny, I don't know if you knew this, I did not, that you don't need to refrigerate butter. Did you know that?\n\nLenny (00:18:18):\nI knew that intellectually, but I still refrigerate it. I know people don't.\n\nJason Feifer (00:18:22):\nMe too, even though I've had multiple conversations with this woman about this. You don't need to refrigerate butter, and if you leave it out, it cuts easier. It's more spreadable. Big problem, the butter dish. So most butter dishes you just lift up. And so if you have warm room temperature butter that's soft, and you lift the butter dish top up, you might bump into the butter, and it's going to make a big mess. So Joelle makes a butter dish on a hinge, right. Opens and closes exactly the same way every single time. No mess. Brilliant, solves a problem. She reaches out to me about this. This is not interesting to us, right. Maybe this is interesting for a cooking magazine, right. Maybe Bon Appétit is interested in this. Entrepreneur's not interested in this because that doesn't help other entrepreneurs to have thought through that problem.\n\n(00:19:13):\nBut then she tells me something else. What she tells me is that she is, at the very beginning of this, trying to figure out how to answer some basic questions about her audience, like what colors do they want in this butter dish and what price point are they willing to pay? And she wants to do some market research. She goes to a market research company. She says, \"How much would it cost to research consumers and answer these questions?\" They say, $10,000. She doesn't have $10,000. And then, one day, she's sitting at the airport waiting to board a flight, and she looks around and she realizes that airports are full of people who have absolutely nothing better to do than answer questions about butter dishes, right. Nothing better to do, just sitting there. And you could start at gate one. By the time you get to gate eight, everyone in gate one is new. You could do it all over again, and you could have a 6:00 PM flight, and you could show up at 9:00 AM. Nobody's going to stop you. You can do this all day in the airport. And this is how she starts to do her own market research. She saves that $10,000, and she does it herself. I put that story in the magazine. It's tiny. It's this tiny random company and this random decision. But the reason I did it is because every time I repeat that story to entrepreneurs, they're all like, \"Ugh, right, totally. There's always other ways to do things.\" They love the ingenuity of it. That's what I'm looking for. That's Entrepreneur's stories. So to go back to the point that you were making, it's not just about, \"Well, it's a magazine called Entrepreneur. They must write about entrepreneurs, right. I'm an entrepreneur. I belong in Entrepreneur.\"\n\n(00:20:41):\nPeople think that all the time. No. You have to step back and read what these publications are publishing and ask yourself, \"What are they doing? What is the purpose here?\" The editors and the writers, they're making decisions about what goes in this magazine, and they're making decisions about how the stories are constructed. Why are they doing that? Who are they trying to reach? When you start to see it through that lens, you start to see the pattern, and you get an understanding a real instruction manual for what it actually means to pitch these publications.\n\nLenny (00:21:13):\nThat is such an interesting insight. I had no idea that that was something you should be thinking about. Is there an easy way to understand the mission of the publication? Is there an about page they often add this to or is it, like you said, you just read a bunch of stuff and try to suss it out?\n\nJason Feifer (00:21:28):\nNobody publishes an about page in that way because the internal logic of the editorial team. But you can certainly make some starting assumptions based on who the publication is trying to reach. Everybody is trying to reach somebody. It gets more complicated the more general interest something becomes, right. What is the New York Times?\n\n(00:21:53):\nWhat is the mission? That's a hard thing to answer. You sort of have to divide it up into sections, right. The mission of the National News Desk is different from the mission of the Business Desk, and even within there, the mission of the Sunday business section is different from the mission of the Monday to Saturday business section.\n\nLenny (00:22:09):\n[inaudible 00:22:09].\n\nJason Feifer (00:22:09):\nSo you have to start to really parse it out. And this is the reason why people hire PR is because if they're good at their jobs, they understand a lot of this already. But I really do think that if you spent time with the content and your starting point is, \"I understand that this publication is trying to reach X. They're trying to reach these people,\" then you can start to see the patterns of what it is that they're doing. How are they telling stories? What do these five stories all have in common? They have something in common. There's something that they're all doing, and you can certainly read the tea leaves and try to figure it out.\n\nLenny (00:22:48):\nAwesome. Okay. It feels like we've already gone into step one around prep. What else is involved in preparing to get press?\n\nJason Feifer (00:22:57):\nIf we're talking about prep, the very first thing that you need to do is what I had said earlier, which is just ask yourself, what do I need press for? And you need a good answer to that question. And once you have that, the next thing you should do is you should start to think about, \"Well, what's interesting about my business? And oftentimes, it's not necessarily what you think, and you can be guided in a way by what's happening in step two, where you start to think about who you're trying to reach out to. Because, for example, the story that somebody might tell me at Entrepreneur is going to be different than the story that somebody might tell Cosmo.\n\n(00:23:42):\nThere's a reason for a company to end up in, both Entrepreneur and Cosmo, right. Maybe the product is for young women. And so, Cosmo might be interested in some kind of product feature or including the product in a roundup of some kind of products. Whereas Entrepreneur would do the entrepreneur-focused story. What did this founder do? How they do they write? You can take your... You could think about your story and kind of break it up into a whole bunch of different little pieces and then figure out which piece goes to what media. But oftentimes, people make the mistake of trying to do that in reverse, which is to say that they kind of decide what narrative they would like to have out in the world, and then they just go around to different publications trying to sell them on that. I get that all the time.\n\n(00:24:34):\nA lot of my pitches that I'll receive in my inbox are somebody who hasn't really thought at all about what Entrepreneur publishes but instead just has something that they would like to get out into the world. I mean, a good kind of dumb example is, yesterday, somebody sent me an email about a company that had just hired a new president. I don't care about that. That's not useful to my audience at all. I'm sure that there is a trade publication, right. Let's say that there was a company in the restaurant industry. I'm sure that a trade publication that follows the blow by blow by blow of a restaurant industry might be interested in your new president. But I'm not because you hiring that new president isn't useful to my audience. Stories in Entrepreneur are not really about the person that I'm writing about.\n\n(00:25:23):\nThey're really about the audience. They're really me serving the audience through the stories of the people I'm writing about. That's not useful. I wish that they had spent a moment and thought about that, but they didn't. So once you start to think about who it is that you're trying to reach, you can step back and say, \"Well, what part of my journey is going to be most relevant to them? And I would push you to be really, really creative about it. Because if you go back to the Butterie example, the butter dish, that little funny story about the airport, I mean, who else is writing about that? It's not central to her story as a brand. It's not central to her sales pitch. It was-\n\nJason Feifer (00:26:00):\n... central to her story as a brand, it's not central to her sales pitch. It was just for us. We were probably the only publication in the world who cared about that, but I really cared about it.\n\nLenny (00:26:11):\nAmazing. Okay, so just kind of summarizing what you shared, think about the goal. What are you trying to get out of press? Goals could be awareness of what we've done, something new, investor interest. What are some other common examples of goals that you see for trying to get press?\n\nJason Feifer (00:26:27):\nYeah, awareness of something new. But also doesn't have to be awareness of something new, it could just be continued growth, trying to reach into a new marketplace. That's fine. Anything that's tied to growth or reaching a new customer base-\n\nLenny (00:26:45):\nCool.\n\nJason Feifer (00:26:45):\n... would make sense.\n\nLenny (00:26:45):\nThat makes sense.\n\nJason Feifer (00:26:47):\nBut it could also be that you're looking to position yourself in your own marketplace a little differently. I see, for example, a lot of people, a lot of big companies, keep knocking on my door because we don't just hear from startups, we hear from major companies as well who are pitching stories. I know why they want to be an entrepreneur. They want to be an entrepreneur because they're trying to position their brand as also being relevant to small business owners. It's helpful to have that kind of context because coverage an entrepreneur can help them go out to the marketplace and say, \"Look, we're also reaching X, Y, Z people.\"\n\n(00:27:25):\nSo sometimes it's not even about a conversion, but rather it's about a positioning and that's a good reason to also maybe put forward your executives. Sometimes it's just about establishing your CEO or your founder as an authority in a particular area because you want them to be more trustworthy, you want them to be invited to more conferences. Because all of that stuff draws more attention to the company, all sorts of reasons to do this stuff. And then trying to get in front of investors, trying to get in front of partners. Look, there's a million reasons why being visible can be useful, but you need to make sure you understand what you're actually trying to do.\n\nLenny (00:28:07):\nOkay, awesome. That was really helpful. So think about what goal you have in mind for getting press, pick a publication and understand their mission and what their goals are. And then think about some interesting stories that you could pitch them. Not just like we have a new president, but something that you think they'd be excited to share that connects with their mission.\n\nJason Feifer (00:28:25):\nThat's right.\n\nLenny (00:28:26):\nKind of on this topic, I know we want to talk about who to contact and how to figure out who to actually talk to. A couple of questions that come to mind. This is all a lot of work. Founders are really busy.\n\nJason Feifer (00:28:35):\nYeah, it's a lot.\n\nLenny (00:28:35):\nSo begs the question, PR agencies, do you have a perspective on would you recommend working with PR agency? Is there a time when it makes to and doesn't make sense to?\n\nJason Feifer (00:28:45):\nYeah, I mean it's a ton of work. Everything that I'm describing is a ton of work. And let me be clear, people succeed in getting press without doing any of the things that I'm describing because dumb luck happens in the world. You could very well just bang out an email to some random editor and they might like it. That is entirely possible. You could disregard everything that I've just said. What I'm really helping you do is try to optimize your approach. But yeah, hiring PR can cut out a lot of this. Now you're not doing this research yourself, you're not thinking through these challenges yourself. You're working with people who understand exactly how to identify the most interesting parts of your story and then turn them into good pitches. So why wouldn't everyone do that? The couple reasons. Number one, cost PR can be expensive, so you just have to factor that in. Number two, PR is and can be, I'll say can be, a very frustrating journey because a lot of PR people are very bad at their jobs. They're very bad.\n\n(00:29:52):\nAnd this isn't just me bashing PR people. I have literally been hired to give keynotes at PR industry conferences. And I get on stage and I say most PR people are bad at their jobs and everybody nods. And they all know it. And of course, none of them think that they're one of the bad ones, but they all know it. PR is full of people who are bad at their jobs. Why are they bad at their jobs? They're bad at their jobs because they're lazy, because they're primarily relying upon email blasts, just sending things out, because they have a older idea of what it means to get the word out. For example, if you hire or talk to a PR agency and one of the things that they recommend doing that you should spend money on is a press release, like a traditional press release, run as fast as you can away from that. I don't know if you know this. Do you know this? The press release, there are some purposeful reasons to put out a press release, but the press release is really no longer the primary unit of press attraction.\n\nLenny (00:31:07):\nYeah, I get that sense.\n\nJason Feifer (00:31:08):\nYeah. But here's what's fascinating. So a PR agency I wouldn't recommend might do this. They'll tell you, \"We're going to put together a press release about this new thing, so you have to pay a little extra money for the production of this press release and then also the distribution of this press release because what we're going to do is we're going to put it out on the wire,\" because there are a whole bunch of press release distribution wires. So they'll do that, you'll pay the money, it'll go out on the wire. And then they'll send you a report about all the places that this press release ended up on. It ended up on Yahoo Finance, it ended up on Market Watch. And it technically did. The press release is there, it was posted. And zero people are going to see it in the whole world because Yahoo Finance has a section where they just publish every damn press release that gets published by all these different distributors. Nobody saw that.\n\n(00:32:08):\nSo don't confuse posting press releases even on very big websites with actual success. What you want in an actual PR person is someone who traffics in one thing, and that is relationships. The most important thing that a PR person can have is active relationships with people in media. Why? If a PR person is guaranteeing you press, that's another reason to run out the door as fast as possible because the PR people cannot control this. Writers and editors, they do what they want. It's a completely subjective industry and very frustrating. I completely understand. That was totally subjective. So the best that a PR person can do is shape your story, understand who to pitch, and then get that writer or editor to look at it, to pay attention to it. There are some PR people in this world who I think very highly of. I think they're incredibly smart, incredibly good at what they do, and they only pitch me when they have something that they think I will genuinely be interested in. Instead of a lot of PR people who just send me some random thing every week or every day.\n\n(00:33:21):\nI don't pay attention to those people. But, I don't know, just shout out, when John Beer from Jack Taylor PR sends me ... John, I met him in a PR capacity a decade ago and we've since become friends. When he emails me, I pay attention. I don't write about it all the time. I'm not going to write about something just because I like John, but I will pay attention. And paying attention honestly is half the battle because people in media are getting so much email. So you want someone who's going to understand you, understand your industry, understand and know the people who they should be reaching out to, and who really respect you as an entrepreneur and are going to give you the hard feedback. Because there are a lot of people who will go and hire PR and they'll say, \"I want you to email this and this and this and this and this publication.\"\n\n(00:34:16):\nAnd if the PR person just does that, all they're doing is annoying their contacts if they don't really feel like this was meaningful. You should like when a PR person pushes back on you and says, \"You know what? I don't think that your story is right for that publication. Here's why.\" That's someone you should hire.\n\nLenny (00:34:34):\nIs there any other PR people you want to call out as ones that you think are awesome?\n\nJason Feifer (00:34:38):\nThe challenge here is that I'm going to regret not including a whole bunch of people who don't pop to mind immediately, but-\n\nLenny (00:34:44):\nWe can include them in the show notes, whoever else.\n\nJason Feifer (00:34:45):\nYeah, sure. Okay, so let's see. Off the top of my head, so John of Jack Taylor, he does a lot of wellness stuff. So PR agencies tend to specialize, and so you want to make sure that you're going with people who really understand you and the media ecosystem that you are reaching out to. So I think John's really smart. Let's see. Hannah Lee at Hannah Lee Communications is great on hospitality stuff. So restaurants, hotels, booze, they're really smart. Jen Sesquila, sorry Jen, if I mispronounced your name. Max Borges Agency, really good on sort of consumer focused products. Greg Delman, he's based in San Francisco, he has a boutique shop called G3 Media and he does a lot of tech startups stuff, just really knows that world. Greg, I'll find writers through Greg because he just knows everybody. I just texted him recently and I was like, \"I need somebody who can write about this very specific AI thing.\" He happened to be at TechCrunch Disrupt and he found some freelancer and connected us. That's great. So those are four. I will have more that'll give you for the show notes.\n\nLenny (00:35:55):\nAmazing. Okay. This is really useful. If any come to mind as we're chatting, feel free to shout them out again. Similar question, when people are thinking about publications to go after, say you're a startup founder. Is there a list you could just share of just like, here's probably the top five, 10 that you should be thinking about? The obvious ones, you talked about entrepreneur, [inaudible 00:36:15] Company, TechCrunch obviously comes to mind. Is there others that are just like, \"Here's a good list to start with?\"\n\nJason Feifer (00:36:19):\nHonestly, it really, so much depends upon what it is that you're looking to do. You could be a startup, founder and entrepreneur and Inc and Fast Company are for maybe some good reason not at the top of your list because you're a startup founder, but your goal right now is to reach consumers. And those publications don't reach consumers and they don't reach people who are in a buying mindset. They reach people who are in a creating mindset. So I would expect that if you have a startup and that startup is not B2B in some way, that it would be possibly very reasonable that business publications might not be your target right now. Maybe Men's Health is. Maybe, I don't know, anything could be. I think oftentimes people tend to think too close to them about where they belong. Lenny, here's a real kind of exchange that happens, which is if somebody will email me, I don't respond to every publicist.\n\n(00:37:23):\nIt's just literally not possible. I would not have enough time in the day. I do do my best to respond to every entrepreneur who reaches out because I feel like they deserve a response. And sometimes somebody will email me and they'll send me something and it's just not relevant. And I'll reply and I'll just say, \"Hey, thanks. Congratulations on what you've built. But this isn't a fit for entrepreneur.\" And maybe once a month somebody responds really in a testy way, and they're like, \"But don't you write about entrepreneurs? I'm a great entrepreneur success story.\" It's like, no, that's not what we do. Yes, entrepreneurs are featured in our stories, but no, we're not just a directory of entrepreneurs. Here's a good way of thinking about it. If you have a startup and you're trying to figure out what publications to be in, go look at where your competitors have been featured. That's a great place to start. What audiences are they reaching and how are they doing it? That should give you some direction about where you might want to go next.\n\nLenny (00:38:33):\nAwesome advice. On TechCrunch, do you have a perspective on is it worth investing in getting featured in TechCrunch?\n\nJason Feifer (00:38:40):\nI'll tell you a sort of personal press journey moment, and then I think that it will translate into the answer for TechCrunch.\n\nLenny (00:38:47):\nAmazing.\n\nJason Feifer (00:38:48):\nOkay. Something we haven't talked about so far yet is, and this is sort of almost skipping all the steps that we've laid out to what happens after you get the press. But the point of the press is sometimes to reach the people who are reading it. You get covered in Entrepreneur and entrepreneurs are going to read it and maybe something good will come of it. But sometimes the point of it is not to reach the people who are reading it at all. Possibly a very small number of people are going to read it, which by the way is a real, real possibility. Because although all of these publications that I have mentioned, Entrepreneur, Forbes, Fortune Inc, Fast Company, whatever, these are reaching millions of people, their websites get many, many, many millions of unique visitors each month. That does not mean that your story is going to be read by millions of people.\n\n(00:39:40):\nIn fact, the largest possibility here is that your story will reach five to 10,000 people, a small number of people because these publications are publishing tons of stuff. So you might get this story, it might look awesome, it might not reach that many people. That might also be okay. Because maybe the reason in your logic for why to get that kind of coverage is not to have reached that publication's audience at all anyway. Maybe what it really is is to tweet it and then put some money behind promoting that tweet because then you can target that you got coverage to the people who you want to notice you got coverage.\n\n(00:40:21):\nAnd I see a lot of people do that. They'll take articles that we ran on Entrepreneur and they'll basically turn them into advertisements. And that's really smart because what they got out of Entrepreneur was the social cachet. It was the validation in the marketplace. And then they're going to do something with that themselves. That's really smart. You also see it sometimes the reason to get coverage, it's just so you can put it on your website. As seen in. As seen in is probably more valuable than anyone actually reading that story to begin with. They probably won't read the story. You might not even have to link it on the website. But you could just get to say as seen in. Because again, it gives you that validation.\n\n(00:40:56):\nMe personally, I am building a small podcast company with my friend Nicole Lapin. Nicole Lapin is a bestselling business money expert. And we have a company, she's the founder and I'm an advisor. And it's called Money News Network. We have a podcast on it called Help Wanted that we co-host together. And we got coverage in Variety. And that was the result of pounding on a lot of doors and finally getting someone at Variety to take interest and they ran an article about us. Did we get anything from that story in Variety? The answer is no, like nothing. But you better believe that every email we send out to every potential advertiser, to every partner, includes the link. Variety has covered us. And I guarantee that when someone receives that email, it makes them pay more attention.\n\n(00:41:52):\nAnd I have used it many times too when I reach out to people. It just gives you that validation. So sometimes what you're looking for is a prize to walk around with. And I would bet that the same is true for TechCrunch, which was your original question. Why get the funding announcement in TechCrunch? Probably not because anyone's going to care because they read it on TechCrunch, but now you can use that to your own means. And sometimes that's more valuable than the press itself.\n\nLenny (00:42:16):\nThat is an awesome insight. It also makes you realize you may not feel like it was a success after spending all this time getting in a story and entrepreneurs. Like, oh, nothing happened. But the benefits may come later, like weeks, months, years later when you start to share that.\n\nJason Feifer (00:42:30):\nExactly right. A lot of this is what you make of it.\n\nLenny (00:42:32):\nAmazing. Okay. That was extremely interesting. Okay, let's talk about step two. So initially you prepped, we talked about how to think about who to go after and the mission and goals. Then you get to step two, which just figure out who to reach out to at a publication.\n\nJason Feifer (00:42:47):\nRight. So a lot of people make the mistake of emailing me. If they want coverage in Entrepreneur, they email me. And I understand why they're emailing me. It's really for two reasons. One, I'm the most visible editorial person at Entrepreneur. And so it's easy to find me, it's easy to find my email address. And also they just assume, well, editor in chief, making all the decisions. But no. I mean, think about it. If you have a problem with a purchase that you made on Amazon, you don't email Bezos. He's too busy. And I am not comparing myself to Bezos. But I am the busiest editorial guy at Entrepreneur for whatever the hell that's worth. And I'm just not the guy to pitch because my job actually isn't really to select stories that go in the magazine. My job is to work with editors who develop their own ideas and then I get to say, \"Oh, that's a good one,\" or, \"Oh, let's refine that.\" I'm not sourcing as much. And so you really should start by looking at who's writing about your subject area.\n\n(00:43:57):\nAnd you can do that by going to the website and surfing around. You can do that by Googling around. But you'll find the answer. Every publication is structured differently. Some people have specific beats. Some publications will be like, \"This is the person on the transportation beat.\" And some publications don't. Entrepreneur doesn't really have a beat system necessarily. But if you look, you'll figure it out. \"Oh, that editor is clearly interested in food. That writer is clearly interested in food. They seem to write all the food stories.\" And a good way, again, to do it is to start with the publication and then look at how they're covering your competitors. So a good example is I was once consulting with a guy who has a kind of fun peanut butter company. It's like imagine peanut butter meets Ben and Jerry's, so it's like peanut butter with lots of stuff and fun names. And so he's trying to figure out how to get press. And originally his thinking, the reason why he reached out to me was because he's like, \"Well, I'm an entrepreneur. I run a business. I should be in Entrepreneur.\"\n\n(00:45:05):\nI was like, \"No, no, no, you shouldn't because none of our readers are going to buy your peanut butter. So who is your target audience? Who's buying your stuff?\" And he says, \"Millennial moms.\" I said, \"Great. Okay, so Cosmo is a good place to reach them. So let's look at how Cosmo covers snacks.\" I don't know how they cover snacks. I don't read Cosmo, but let's find out. It's not hard. I went to cosmopolitan.com, searched for snacks. What I found immediately was a lot of stories that are all basically roundup-y and anchored to some time-sensitive things. So it's 10 snacks for Valentine's Day, it's our 10 favorite new fall snacks, whatever. It's all stuff like that. So now we know they are not going to run a thousand word feature on your peanut butter company. Instead, the best that you could hope to do is get into one of these seasonal-ish roundups.\n\n(00:45:59):\nSo now next step, who's writing these things? Let's look. Let's open some of the articles. The byline is right there. You can click on the byline. You can see what this person does. And in many cases, maybe they're the food editor, maybe they're the lifestyle editor, whatever. You'll see what they cover. And you'll have a good understanding of now how to frame the thing that you're looking for. Now, let me introduce one other possible option. They don't work for the publication at all. They're a freelancer. Publications use a lot of freelancers. Freelancers are basically independent contractors. They're writers who are working sometimes. Sometimes they have longer term deals with publications. Sometimes it's just one-off. My wife is a freelancer. My wife is a freelancer who writes a lot for the New York Times and Washington Post and Guardian. And the interesting thing about my wife versus me is that my wife, whose name is Jen Miller, just so I don't keep saying my wife.\n\n(00:46:58):\nSo Jen, on a day-to-day basis as a freelancer is hungrier for stories than me because Jen has to hustle for her food. Jen has to find stories and pitch those stories to editors at publications, and that's when she gets paid. So she actually is more incentivized to be looking for stories than I am because I am a salaried employee of Entrepreneur Magazine. And my email address is very easily found and people just send me stuff all the time. And I should add here also, note that a good journalist, a good writer is not actually sitting around thinking that their job is to wait for people to pitch them so that they can just write about the best pitches. Their job as they see it, is to go and find the most useful things for their audience. And they like to do a lot of that themselves. So they're not sitting around just waiting for your pitches. And in fact, your pitches have to overcome their instinct to go find things themselves.\n\n(00:48:02):\nSo Jen is constantly hustling. Jen is constantly talking to people. Jen is curious about the world and will spend a lot of time hunting things down. But if somebody reads a story that she wrote and says, \"Ah, I think I have an idea of what this person is interested in,\" and then tracks her email address down and then emails her, Jen is getting a lot fewer pitches than me, the chances of her reading it are close to a hundred percent. And the chances of her taking it seriously if it's relevant to any of the publications that she writes for is much higher than me. So sometimes going to the staff person is not actually your best move. Finding the freelancer who's doing the work is sometimes the better move.\n\nLenny (00:48:43):\nSo many interesting tactical insights that you're sharing. I love it. With this freelancer tip, how do you know they're freelancers? Is there something in the byline?\n\nJason Feifer (00:48:51):\nIf you find them on the publication's website so let's say that you go to Cosmo and you click on a author's bio. If they're staff, it'll say staff. If they're not staff, it'll probably say something else. It might say writer, it might say contributor. It might say Jen Miller is a writer in Brooklyn, New York. But also you can just go one extra step and just Google their name because any smart freelancer has a portfolio website where they should be very easily found.\n\nLenny (00:49:22):\nAwesome.\n\nJason Feifer (00:49:23):\nSo sometimes just take their name, plug it into Google, you'll very quickly figure out who they are.\n\nLenny (00:49:28):\nOkay, so let me summarize things that you've taught us so far. One is think about publications that go to people that will buy your thing. So in your example, Cosmo is a good example of someone who would buy this peanut butter thing. Two is don't think of it broad thing. Think about the writer at the thing. So it's not like Cosmo would write about this. It's like, who specifically at Cosmo would write about this? And we find that as go to their site, search for, you talked about search for your competitors, but I think it's even broader, just things related to your area, right? [inaudible 00:50:01].\n\nJason Feifer (00:50:01):\nYeahs, that;s good point. Search for your category.\n\nLenny (00:50:04):\nEven adjacent things probably are close enough. And then this tip about freelancers is really great, that they're hungrier and that they're more likely to respond to your pitch versus someone that's working there. And then also this point that they're like, their assumption is this is not a good pitch and they don't want your pitch. But freelancers have a higher chance of being interested and will pay attention.\n\nJason Feifer (00:50:25):\nYeah, freelancers got to eat.\n\nLenny (00:50:28):\nAmazing. Is there anything else along this step of finding somebody at a publication that you want to share?\n\nJason Feifer (00:50:36):\nWell, the next step is going to be how to actually reach out to them and pitch. So at this stage, I think that we've fairly well covered it. And I love your summary. And just to double click on part of that, the reason why you're doing a lot of this is not just for the crazy busy work of it. But it's because you have to understand that the media ... Just sort of go back to translating the media. The media, which is a phrase that is used in all sorts of different ways, is a pretty bad way of actually understanding the media because the \"media\" makes it feel like it's a unified entity. In politics, the media will be criticized as a sort of multiple publications colluding together in some way. But the way that we're talking about it is just as organizations that you're trying to reach out to.\n\n(00:51:25):\nBut really and truly, these are just publishing companies made up of individuals. And those individuals are all making fairly subjective decisions about what it is that they're going to write about. And there are layers of approval that they have to pass through. So nothing makes it into the print magazine, for example, without me saying yes. But I'm also trusting my editors to be passionate about the ideas that they're finding and convince me of yes. And so the thing that you are really looking to do is to find the way-\n\nJason Feifer (00:52:00):\nThe thing that you are really looking to do is to find the way in to a publication. Because nothing gets covered until a single individual at a publication takes interest in you enough that they go to somebody else and say, \"I think that this would be a good story,\" and that other person says yes.\n\n(00:52:17):\nSo you have to find your way in. Because media is not a coordinated effort. It's a bunch of people showing up every day trying to figure out how to make the best thing for their audience.\n\nLenny (00:52:27):\nAmazing. Okay, so that's a great segue to final piece, which is actually, get someone excited and write about you.\n\nJason Feifer (00:52:33):\nSo how do we do that?\n\nLenny (00:52:33):\nHow do we do that?\n\nJason Feifer (00:52:36):\nThis is where the rubber hits the road, okay? So things not to do, don't call them, if you track down their phone number. Which is a real thing that happens. People call my personal cell phone number.\n\nLenny (00:52:48):\nOh, wow.\n\nJason Feifer (00:52:48):\nIt doesn't happen often, but it happens. And I don't even know where they get it from. But I don't like it.\n\n(00:52:53):\nAnd media people are torn on whether or not DMs by social are an okay way to reach out. I find them kind of annoying. Because, number one, the format doesn't lend itself very well, right? If you write anything wrong in a DM, it just looks like this endless thing that I got.\n\n(00:53:13):\nBut also, I don't know, my Instagram DMs, I just kind of don't think of as the place to be pitched. But other people don't care. So I don't know, you can roll the dice on that.\n\n(00:53:21):\nEmail is just the most traditional way. If you know somebody's going to be speaking at a conference, that's great, come up, you can talk to them. But the question of course is, what are you sending them? And here's what you're sending them.\n\n(00:53:34):\nYou're really sending them the product of the work that you have done in the previous two steps. Because you have now spent some time thinking about your story, and who you're pitching, and the publication, and how they're telling stories to their audience.\n\n(00:53:51):\nAnd then the individual person who you're reaching out to, who you now have some sense of how they write about this. And you're taking all of that, and you're trying to distill it down into a presentation that they're going to find appealing.\n\n(00:54:02):\nWhich again, to go back to the thing about how press is not that dissimilar to going out and raising money, that's kind of what you're doing when you go and meet an investor too.\n\n(00:54:12):\nIf you have meetings with 10 investors, the way in which you talk about yourself and the company should not be exactly the same with those 10 investors, because they're all going to have somewhat different approaches and different thesis.\n\n(00:54:25):\nAnd you're not trying to scam anybody, but you're just trying to be as customized as possible by building in your knowledge of what it is that they do, and what their firm does. And the same is true for media.\n\n(00:54:35):\nSo all of this is really going to take the form, in its most traditional sense, of a short email. A short email pitch. And what does that look like? I mean, look, there is literally no magic answer to that. I wish that there was, but there is not. There's no format. People always ask me, what should the subject line of the email be?\n\n(00:55:00):\nThat's is a good question. There's not one answer to that. The closest that I can give you to an answer is that, picture me. Picture me at my computer. I have a lot going on, and I'm glancing at my email, and 40 new emails are sitting there. And my instinct is to delete all of them as fast as possible, but I'm going to glance at each one.\n\n(00:55:23):\nI'm not going to open each one, but I'm going to glance at it, which means that I see the subject line and I see the preview text, or just the first thing that somebody had written. What you want to do is write something that makes it pretty clear to me that this is targeted to me. That's step number one.\n\n(00:55:40):\nBecause most of those emails that I got in my inbox are not targeted to me. They're mass blasts, and I'm delete, delete, delete, delete, delete. So which is the one that actually is reaching me? And sometimes you can do that by referencing something that I wrote in the past. I see people do that a lot. Don't fake it. People fake it all the time. People email me and they tell me they're fans of my work, they've never read my work. It's very obvious, right? Don't do that. But if you've read something, or if you're familiar with something, if you're familiar with the publication in some way, any signals of that are good.\n\n(00:56:15):\nBecause again, what you're trying to do is just separate yourself from noise to, this is customized to you. Because If you think about it, this is really an efficiency question. What I'm trying to do is, I'm trying to spend my time on the things that have the highest percentage chance of being relevant to me. And I'm filtering out the things that seem not relevant to me, who are wasting my time.\n\n(00:56:41):\nSo if I see something where somebody's writing me and they have a sense of the publication and they have a sense of me, there's a higher percentage chance that the next things that they're going to tell me are going to be relevant to me. Maybe even turn into a story.\n\n(00:56:53):\nWhich is great. I like when that happens. Because it saves me time, frankly, right? It's one less story I have to find myself. So I'm happy for it, but it's got to be right. So you want to structure ... And then the email that you're writing is don't go on forever, like three paragraphs max.\n\n(00:57:09):\nAnd you are telling the version, you're not writing an article, but you're telling me the thing that you are pretty sure I'm going to be interested in. It's the difference between, going back to the butter dish example, woman sending me a three paragraph email about the butter dish itself, and opening up, telling me a little bit about the butter dish, and then immediately moving into this very clever story about the product market testing survey.\n\n(00:57:43):\nThat's the difference. She told me the story that was going to be relevant to my audience. She got there quickly, and it felt like, to me, this is a interesting human being with an interesting entrepreneurial story to tell, and that's why I'm going to engage.\n\nLenny (00:57:57):\nSo that story actually came through a cold email?\n\nJason Feifer (00:58:00):\nThat was a cold email. Yep. Just showed up one day.\n\nLenny (00:58:02):\nAmazing.\n\n(00:58:04):\nThis episode is brought to you by Eppo. Eppo is a next generation AB testing platform built by Airbnb alums for modern growth teams. Companies like DraftKings, Zapier, ClickUp, Twitch, and Cameo rely on Eppo to power their experiments.\n\n(00:58:18):\nWherever you work, running experiments is increasingly essential. But there are no commercial tools that integrate with a modern grow team stack. This leads to wasted time building internal tools, or trying to run your own experiments through a clunky marketing tool.\n\n(00:58:30):\nWhen I was at Airbnb, one of the things that I loved most about working there was our experimentation platform, where I was able to slice and dice data by device types, country, user stage. Eppo does all that and more, delivering results quickly, avoiding annoying prolonged analytic cycles, and helping you easily get to the root cause of any issue you discover.\n\n(00:58:49):\nEppo lets you go beyond basic click-through metrics, and instead use your north star metrics like activation, retention, subscription and payments. Eppo supports tests on the front end, on the backend, email marketing, even machine learning clients. Check out Eppo at geteppo.com. That's get Eppo.com, and 10X your experiment velocity.\n\n(00:59:11):\nIs there any other examples that come to mind, of someone doing this well? For people to have more kind of examples of here's...\n\nJason Feifer (00:59:17):\nOh sure. Well here, let's see. We'll have to do this in real time here. But I keep in my inbox a folder called Bad PR Pitches and a folder called Good PR Pitches. We can go through both.\n\nLenny (00:59:28):\nLet's do it.\n\nJason Feifer (00:59:29):\nAll right, I just pulled this up. This is, and I haven't read this in a long time. I'm kind of trying to read ahead as I'm talking just to see if this is appropriate to read. But I think so. I don't know, whatever. We're just going to read it and see what happens.\n\n(00:59:42):\nAll right, so the subject of this was, \"Idea for entrepreneur and Problem Solvers, how the Border Closures grew my business.\" So this was sent to me in September of 2020.\n\nLenny (00:59:54):\nAnd this is a good or a bad?\n\nJason Feifer (00:59:56):\nThis is good, this is good. This turned into an episode of a podcast that I do for Entrepreneur, and I might've also then converted it into an article I can't remember.\n\nLenny (01:00:06):\nAwesome.\n\nJason Feifer (01:00:08):\nAnd so here's what she did. So her name, I shout her out. So this is Meg O'Hara. And Meg O'Hara is a painter, a Canadian landscape painter. Which again, a small business.\n\n(01:00:21):\nAnd she writes, \"Hi Jason, I have an idea for a story I think would be valuable and relevant to you, Entrepreneur Magazine and the Problem Solvers Podcast.\" That's the show I do for Entrepreneur. And then she says, \"Here's what's going on with my business. All entrepreneurs had to be flexible during Covid. This is a story about how one artist in Canada benefited from the border closure.\" This just sort of intrigues me. Oh, how?\n\n(01:00:42):\n\"When Covid hit in March, all ski resorts across North America shut down early. Skiers are a high earning demographic in Canada. They fall in the top 5% of income.\"\n\n(01:00:53):\nOkay, well anyway. So she goes on. What she tells me, I remember this now, what she tells me is that her business used to be being hired by ski resorts to come and paint landscapes for their facilities. And when the border shut down and people weren't going to these resorts anymore, she had to come up with a completely different way of doing her business.\n\n(01:01:15):\nAnd so she started to think, well, I can't work for these resorts anymore. They're not hiring me. But all these skiers who used to work at the resorts who have seen my work, or who used to ski at the resorts who were maybe familiar with my work, they're not skiing either. They probably are sitting around wishing that they were skiing. They'd love something to see of their favorite ski location, and they also have money sitting around because they're not spending it on the ski resorts.\n\n(01:01:39):\nSo then she lists off the problems and the solutions in bullet points. Which I love. Because she has listened to the show, the Problem Solvers Show, which is structured in exactly that way. Tell me the problem, tell me the solution that you came to. So she lists it off.\n\n(01:01:53):\nHere are the problems: the skiers can't come, people are spending more time at home.\n\n(01:01:56):\nThe solution: I create artwork for their homes that depicts their favorite views from skiing as they were. She goes on and on and on.\n\n(01:02:03):\nI read this and I just think, there is something here about what this person did to reinvent their business at a time in which one marketplace shut down, but it created a new one that I think people would like to hear. Because at that time everyone was thinking about how to reinvent themselves and their business.\n\n(01:02:21):\nAnd even though I reach people who have very complex and large businesses, sometimes it's really a beautiful thing to hear a single individual who does the simplest thing in the world, which is put paint to canvas, talk about how she did it for herself. Because you can extract these wonderful little lessons about how to reinvent yourself that I think are going to be relevant to a very broad audience.\n\n(01:02:44):\nSo Meg sent me that email, I replied and I said, \"I like it.\" And we did it. So that's a good example of someone who spent time understanding my work, down to the structure of how I'm communicating, and then sent me a pitch that very quickly and clearly seemed customized to me, and told me her story in a way that I could imagine telling my audience.\n\n(01:03:12):\nAt that point, it's a pretty easy yes,\n\nLenny (01:03:14):\nThat is an amazing example. I just took some notes on things that she did right based on things you've shared in the past.\n\n(01:03:19):\nEven just from the subject line or the first sentence, it was clear that she knew you. She knew you had this podcast, she knew the magazine, and she even expressed this specifically, you're going to be interested in this. She mentioned how this, she has a story. She starts immediately with a story. There's not the value prop of the company, here's what we do and here's why we're awesome. And then the lessons, the mission of Entrepreneur you talked about, is insights and lessons that people achieve, and she just went straight to here's what we've learned.\n\nJason Feifer (01:03:49):\nThat's right.\n\nLenny (01:03:50):\nSo I could see why that resonated.\n\nJason Feifer (01:03:51):\nYeah, it was great. And the next thing that made it a real success, by the way for her, was that once I got her on the phone, she was, and I find this, this is a make or break thing for me. Because I can talk to somebody and then kill the story, or not run the podcast. She was willing to be open about challenges.\n\n(01:04:17):\nI mean, she had reached out because of challenges, but not everyone is. I will get a pitch from someone who is presenting like, oh, we had this challenge in the business. But then when I talk to them, they act as if there was no problem. Or the problem was really small and their ingenuity immediately made this a very successful business. And that's not interesting to me.\n\n(01:04:42):\nBecause success stories are not interesting. They're not interesting to anybody. It's not useful for you to just hear that someone else succeeded. What's useful is for you to hear how someone else faced challenges that you faced. And got through them so that you can see. Aha, that's an interesting strategy to use for me.\n\n(01:05:01):\nI hate success stories. I love problem solving stories. And that's why when I talk to an entrepreneur, I expect them to be really open about that stuff. And if they're not, I basically lose interest.\n\nLenny (01:05:13):\nThe hero's journey. I'd love to hear another example. But before that, hearing this, obviously it takes a bunch of time to do this for a founder. I guess, two questions. Just, how many places should somebody probably try to reach out to give them a chance of being successful? And then do you have any thoughts on how much time they should put into something like this? I know it's a very broad question. But, any thoughts there?\n\nJason Feifer (01:05:35):\nYeah, it's a really broad question. So again, this is in some way why, in a large way, why a lot of people hire PR. Because PR can just move this along. They can reach a lot of people very fast, whereas you as an individual cannot.\n\n(01:05:51):\nOne way to think about it is, you're going to be on the hunt. You're going to try to make this work, and you're going to take a couple bets and hope that some of them pay off.\n\n(01:06:01):\nAnother way of thinking about it is, this is a passive activity. And I'll spend some time when I'm reading media, thinking about this, kind of developing an idea. Another thing that you can do, follow a bunch of writers and editors on social media.\n\n(01:06:20):\nMeg, I can't remember the order of operations here, because I know that Meg follows me on Instagram now, because she's DMd me many times. And I respond to everybody. I can't remember if she followed me before, but she might've. And maybe she even DMd me a few times. Usually it's somebody's responding to an Instagram story or something.\n\n(01:06:38):\nAnd I've seen a lot of people use this strategy with me, and I think that it's a really smart one. Which is basically, before you ever pitch, just get me to recognize your name. Just engage in social media in a very casual way, such that when you email me, I think, do I know who that person is? Meg O'Hara, I think I know who that person is. It just makes it more likely that I'll open the email.\n\n(01:07:08):\nAnd I see a lot of people do that. They'll spend a long time engaging with me on social media before ever pitching me. I know what they're doing, I understand that it's probably calculated. I still like it. It's smart. Because it means that by the time that they've reached out, I think you have a pretty good sense of my work. Which means that what you're bringing to me is probably in pretty good faith. And for that, I like it. It's a good filter.\n\n(01:07:36):\nSo if you've been listening to this whole thing, and you're thinking, this is a tremendous amount of work, I have a new product launch, or I have a bunch of budget that I can spend on this, this individual kind of approach, it may not be for you. You might want to just spend a bunch of time instead interviewing different PR firms. And find the one that seems most aligned with and understands your story, and your vision, and knows people in your space shortcuts a lot of this.\n\n(01:08:06):\nBut even then, even then, I think that having heard this is really useful. Because at some point, if the PR person is successful, you are going to get on the phone with the writer or editor. And it's very useful to understand how they think. That they're not there to serve you. That this isn't a service that they're providing you.\n\n(01:08:27):\nSo you better understand what they're entering into this with, and what they have in mind. When they're asking you questions, they're asking questions, thinking, this is what my audience is going to be curious about. This is how I'm going to drive this person in this interview towards the kinds of insights that my audience are going to find gratifying.\n\n(01:08:44):\nSo the more that you understand who you're dealing with, the better.\n\nLenny (01:08:48):\nAnd also just having done it yourself, you'll better understand what to ask your folks, how they're going to work, find opportunities to improve the way they're operating. On that question of quantity, say you're doing this, say you're spending the time. I'm going to really invest in understanding Jason and whoever else.\n\n(01:09:05):\nIs there a rule of thumb you'd recommend? Try to do this for three publications to get one, or is it five? I don't know. Is there anything there that you could recommend?\n\nJason Feifer (01:09:14):\nSo it's really dependent upon how easy you are to write about. I may just sort of note, if you are some kind of B2B service, especially in some kind of very niche or wonky space, it's going to be really hard for you to get [inaudible 01:09:40]. So hard that it might actually not even be worth trying. Because there are other things that you can do, or things that we haven't even talked about yet.\n\n(01:09:46):\nYou could say, you know what? Screw it. I'm not going to try to get coverage for my company. Why don't I just try to position myself as an expert? Right? It's a totally different kind of approach. Where instead, what you're maybe trying to do is just hook onto the news, try to get a quote or a perspective to a reporter who might be writing about something. I get these all the time.\n\n(01:10:07):\nSomething breaks, some news breaks, and people start reaching out to me. And they'll say, \"This just happened in the news. And my client,\" or sometimes just the individual, \"I have this insight into this, and here's what I would say if you want to interview me.\"\n\n(01:10:22):\nIt's not going to be a feature about you, You're not going to be the subject, there's no photo of you. You might get a quote. You might get a quote in a story. Which again, is all you need to be able to say as featured in on your website. So that's the reason why people do that.\n\n(01:10:33):\nSo sometimes it's about that. Sometimes it's about you could just be a writer. You might try to just pitch authoritative articles by you to different publications. Get yourself out in that way. Sometimes, again, you're not going to be able to be easily written about. And sometimes you are. Sometimes you made some insane technology that everyone's going to be talking about, and it's going to be super easy for you to get press.\n\n(01:10:56):\nAt which point your hit rate is going to be much higher. That's why going into this with really realistic expectations, and if you're going to work with PR, having PR who can set and hold you to those realistic expectations, can just save you a lot of heartache.\n\nLenny (01:11:12):\nAlong the same lines, there's always this idea of exclusivity and people want to write first about a thing. Say you talked about an awesome technology. Do you have advice on, do you just pitch the same thing to all of them and hope they all write about it? Do you pitch them different stories? Do you offer one an exclusive, any advice there?\n\nJason Feifer (01:11:29):\nEveryone has a different approach to this. The number one rule here is just, don't do it in a way that the people in media feel like you're playing them. Because they won't have tolerance for it. I would rather walk away from something like this than do some funny dance with somebody.\n\n(01:11:48):\nSo my favorite version of this goes like this. Actually, there's a founder who recently, I met him years ago. So when he reached out, I recognized the name immediately. And he reached out and he's like, hey, we did this really interesting thing and we haven't told anybody about it yet. And I'd love to see if it's a fit for entrepreneurs.\n\n(01:12:10):\nSo I hop on the phone with him, and he tells me. And I'm not going to tell you what it's yet because we haven't run the story. But after 15, 20 minutes, I say, yeah, you know what? This is a really interesting story.\n\n(01:12:20):\nAnd frankly, I know other media outlets are going to be interested in this too, particularly because a finance element to it. So I think the Wall Street Journal, and Bloomberg, and those kinds of places are going to be interested in this.\n\n(01:12:32):\nHe wants to go to Entrepreneur for whatever reasons he wants. I mean, I think probably two. Because number one, he wants to position himself towards that audience. And then number two, there's a trust factor. He knows me in a way that he doesn't know the editors over there. And so he feels like I'll probably treat the story more carefully.\n\n(01:12:49):\nSo we worked out a deal, which he proposed. And the deal is that we'll get the exclusive, and there's going to be a three-hour window after our story runs, and then they're going to start responding to everyone else. And then they're going to start talking to other people, or maybe they'll even line it up and reach out to some other media.\n\n(01:13:10):\nAnd that's fine with me. I understand. And we're going to create a little embargo window. And we'll go first, and then they're going to talk to everybody else.\n\n(01:13:21):\nSometimes you can offer an exclusive to someone in that you are going to release the news to everybody, but only one media outlet is going to get the interview. Which works really well if you have a big personality.\n\n(01:13:35):\nSo for example, recently a company that Mark Cuban has invested in offered us that, right? They're like, we have this news. We're going to reach out, we're going to send the news everywhere, but we're going to give you the exclusive interview with Mark Cuban. He's going to do one interview and he'll do it with you. You can parse it out in any way. You just want everyone to feel like you're being upfront with them.\n\nLenny (01:13:57):\nAnd that they're getting something special, as much as possible. That makes sense.\n\n(01:14:02):\nYou touched on this relationship piece, and that's something I wanted to ask. It feels like in tech, a lot of reporters end up writing a negative story, because a lot of times that's what people want to read. Why is this destroying the world?\n\n(01:14:14):\nI actually had a fast company do a thing on me, and I talked to the reporter, and I had no idea. Was he going to just completely tear me apart, or is he going to be really friendly and positive over what I'm doing? And I have no idea, and it just comes out.\n\n(01:14:24):\nIt's not like I look at it before it comes out. So do you have any just advice to give you a set, help if this is going to turn into something positive or negative? I know you have no idea\n\nJason Feifer (01:14:34):\nWhat happened, by the way? Was it positive or negative?\n\nLenny (01:14:35):\nSuper-positive.\n\nJason Feifer (01:14:35):\nGreat.\n\nLenny (01:14:37):\nI was very happy with it, yeah.\n\nJason Feifer (01:14:38):\nOkay, good, good. I'm glad to hear that.\n\n(01:14:40):\nSo part of it is the publication itself, right? Entrepreneur, and I would say Fast Company, are just sort of not in the business of running negative stories. And the reason is, it doesn't serve our audience. My audience is coming to me to learn things for their business. Tearing somebody apart just doesn't help them in any way.\n\n(01:14:59):\nSo part of it is just what ecosystem are you dealing with? You can also look at the past work of the writer. And if you work with a PR person, it's funny because occasionally somebody has accidentally forwarded this to me, and I'll see the dossier that a PR agency will put together on me.\n\n(01:15:17):\nBut a PR agency, if they set you up with an interview with someone, they'll usually do some digging. And they'll find, what does this person usually write about? What kind of stories do they do? What are they generally interested in? So you can have a sense, right? What kind kind of thing are they doing?\n\n(01:15:33):\nAnd past that, there's also a question of, well, what are you doing in the world, right? I mean, if there is something somewhat controversial about you, and especially if you're engaging with an outlet that is interested in that kind of stuff, there's a halfway-decent chance they're at least going to explore it with you, and ask you about it. And if you're weird and cagey with them, they're going to think that there's more to it, and they're going to start digging more.\n\n(01:16:03):\nBut the ultimate answer here is that every part of this, and this has come through, I'm sure, in our whole conversation, every part of this process is really out of your control. Does somebody pay attention to you? What do they write about you? When do they write about? All of it is outside of your control,\n\n(01:16:23):\nWhich again, is the reason why it's not smart to think about press as a primary strategy for driving growth. It's a good add-on, but these people are going to do what they're going to do. And the best you can do is read the tea leaves.\n\nLenny (01:16:37):\nYeah. It was a very weird ... I don't get press often, it's not like something I pursue. But it was just like, this is wild. I'm just going to talk to this guy, and then something will come out. I have no idea what it might be.\n\n(01:16:46):\nHe might have things wrong, because I didn't get a chance to review, and might skew things. But it's a strange experience to go through. But it all worked out great.\n\nJason Feifer (01:16:55):\nYeah, it is. It's very strange.\n\n(01:16:58):\nIt is, it's strange. And I find that people often don't ... In business, people understand the structure of what's happening. They understand that we're a business magazine, we're going to write a story about a business. It's going to take a certain form.\n\n(01:17:14):\nBut I've done a lot of different writing, and I have had the experience many times over my career where I will spend a lot of time with people, and they will have really no understanding of what it is that I'm doing at all. They can't conceptualize it.\n\n(01:17:30):\nAnd then the story will come out and then they'll always reach out to me and they'll be like, oh, now I finally understand what you were even trying to do. It's fascinating.\n\n(01:17:40):\nIt is a vulnerable experience, and you have to know that. And the more you try to control it, the more the reporter is going to be annoyed at you. And the more, in fact, the reporter might try to take a shot at you in the story as a result. Because they found you too controlling, because they felt like you...\n\nJason Feifer (01:18:01):\nThey found you too controlling because they felt like you had something to hide. This is not a comfortable thing. You have to go into this being vulnerable and you have to know that there's a chance that it could blow up in your face. That's the price that you're paying for reaching their audience.\n\nLenny (01:18:19):\nGreat advice. How about we do just one more example of an awesome email pitch that you got and then we get to our very exciting lightning round.\n\nJason Feifer (01:18:26):\nI'll tell you about a pitch. I don't know that I have it in my inbox still, do I? No, it's not there, sadly. I'll just tell you about it.\n\nLenny (01:18:32):\nYeah.\n\nJason Feifer (01:18:33):\nIi leads to something that is another way of thinking about getting press, which I think is really important for people to remember. So far, Lenny, we've spent the majority of our time talking about press in the form of some kind of feature on you, writing about you or including you in some kind of prominent way in a story that's basically highlighting the thing that you wanted to get out there, your product or something about your business, something. Then we talked a little bit about another way of doing it, which is sort of putting you out as an expert in authority. There's another way of thinking about this, which is that you can either create or present context in which you just happen to be a part.\n\n(01:19:18):\nHere's the story pitch that I got that leads into this. This is years and years and years ago. I had just started at Entrepreneur. I hear from a guy named Fred Ruckel. Fred Ruckel has got a cat toy and it's called the Ripple Rug. It's basically, imagine a rug and then another rug kind on top of it, but ill-suited. The rug is lumpy, there's a lot of lumps in and there are holes. This is for a cat to kind of crawl in and out these spaces and bat and do whatever cats do. I don't know. I don't know a cat. He wanted to tell me about the sales of this Ripple Rug and about how the sales are skyrocketing and all the things that he thought made it special. It's made out of recycled bottles and whatever the stuff, made in the USA, all cool stuff, but not relevant to me because we're not cat toy monthly and we're not reaching a whole bunch of cat owners, not that I know of.\n\n(01:20:16):\nI replied and I said, what I usually say, \"Congratulations on what you've built, but it's just not a fit for coverage.\" Now Fred stumbled his way into this, but he did really a very smart thing because what he responded with was he said, \"Totally understand. If you're ever interested in learning about a gigantic scam that's happening on Amazon and eBay that we've been caught up in, let me know.\" I was like, \"Oh, well, yeah, I guess I am interested in hearing about that.\" I said, \"Tell me more.\" He sent me this long email. Fred loves long emails, and I got him on the phone and had him explain, and finally I understood it.\n\n(01:20:53):\nThis is, and maybe people are familiar with this, but this is sort of known as Amazon to eBay arbitrage. Basically the idea here is that Fred is selling his Ripple Rug on Amazon, or at least he was then, I don't know if he still is, but he's selling his Ripple Rug on Amazon. There are a lot of people who are copying the listing for his Ripple Rug and making their own postings for it on eBay. They sell it for a slightly higher price. Let's say that, and again, I'm making these up, but let's say the Fred is selling his Ripple Rug for $30 on Amazon, so somebody will sell it for $40 on eBay. Then somebody buys it on eBay, they find it, they buy it on eBay, they pay $40, that person gets $40, takes $30 of it, goes to Amazon, buys the Ripple Rug, and then just has it shipped to the buyer. It's arbitrage.\n\n(01:21:47):\nYou might think, \"Well, why would Fred care about this? He still gets the sale.\" The reason he caress about this is because the Ripple Rug shows up at the customer's house and it shows up in a Amazon box, even though they bought it on eBay. They think, \"Why did that happen?\" Then the next thing they do is they go to Amazon and they discover that it's cheaper on Amazon and now they feel ripped off. Who do they feel like they got ripped off by? Fred, because they don't know about the arbitrage. They don't know that they exist.\n\n(01:22:21):\nThis person who has at this point opened the cat toy and probably had their cat roll around in it, now shoves the whole thing back in a box and returns it and Fred gets dinged and that's why he doesn't like this. He has tried and tried and tried to get Amazon and eBay to stop this, but he said, \"Nobody seems to care and all these small businesses are losing tons of money on returns because of this.\" I had never heard of this. I thought it was fascinating. It's like a problem small business owners are dealing with. I was like, \"Fred, do you know other people who are dealing with this?\" He's like, \"Yeah, I talk to them on the line all the time.\" He sends me off.\n\n(01:22:54):\nI reported this whole thing out. I wrote this three 4,000 word story on this thing, and Fred was the main character because he was the way to understand this problem. I did all the reporting and I contacted the platforms and I contacted the people who make the arbitrage software. I did a whole report, but Fred got his press because sometimes, and here's the lesson, sometimes you are not the story, but you can be part of the story. Sometimes that means if Fred stumbled into it, but I get plenty of people who've reach out and maybe they have a real estate startup and there's something really interesting happening in the real estate space and they reach out and they tell me about this really interesting thing that's happening in the real estate space and the role that they happen to play in it. Now I think, \"Oh, well that's interesting. Maybe there's a story about that.\"\n\n(01:23:46):\nMy wife, the freelancer, Jen Miller, she's done this many times where she once did this story about there was a bunch of startups that were all related to helping people prepare for death in some way or another. She's not going to write about one of them, but when somebody reached out and said, \"Hey, here's a trend happening and we are one of them.\" Well, great, that's an interesting story. She wrote that and the company that reached out to her got kind of prominent billing because they were the ones who reached out. You know Barbara Corcoran from Shark Tank?\n\nLenny (01:24:14):\nI think so. I think so.\n\nJason Feifer (01:24:15):\nYeah. She's been a regular Shark Tank since the very beginning.\n\nLenny (01:24:19):\nMm-hmm.\n\nJason Feifer (01:24:21):\nShe made her fortune by building a real estate company called Corcoran, realtors, buy and sell property. The way in which she built this company is fascinating. Barbara, before she was Barbara Corcoran of Corcoran Realty, Barbara Corcoran was random New York City realtor Barbara from New Jersey. She was trying to figure out a way to distinguish herself from the masses. She came up with an idea which was to take her own sales data, the only window she has into the Manhattan real estate market at that time is what she is what her clients are buying and selling, which she's facilitating. She has that data, is going up or down relative to last year. She puts all this data together in what she calls the Corcoran Report, and she starts sending the Corcoran Report out to the New York Times and the New York Post and whatever.\n\n(01:25:18):\nBecause nobody else at the time was putting together a report on the health of the Manhattan real estate market, everyone started reporting on the Corcoran Report as if it was an authoritative thing. It's produced by Barbara Corcoran, which immediately put her in the position of being an authority in this space. That was so smart, and I see it happen all the time.\n\n(01:25:37):\nMy inbox will also be filled with, for example, a company that specializes in remote work consulting. Especially remote work consulting, you can hire them, it's a B2B service. It's hard to get press for that, here's what they do. They pay a surveying firm to find all sorts of things. The top states for remote work, the top companies for remote work, the top whatever for remote work. They produce all these surveys and they send the surveys out. The surveys get covered because now they're creating a piece of news. They're creating some context in which they just happen to live in. Hard to write about them, this random company, but you write about the survey, that's interesting stuff. Oh, it turns out that Utah is the top, I don't know if that's true, is the top state for, that's something that people will write about. You're giving people things to write about. Then once they do that, you are a part of the story. I get those pitches all the time. I occasionally bite on them and Fred from Ripple Rug got himself a big feature as a result.\n\nLenny (01:26:38):\nThat's an amazing other strategy. I imagine if I was a founder, I'd be like, \"Hmm, what trends can I think about that I can tap into?\"\n\nJason Feifer (01:26:44):\nYeah. Sometimes you have it in your own data. If you have a lot of data, you might, Zapier. Zapier is a great example. I get a pitch from Zapier every single year about the fastest growing business apps of the year based on Zapier data because they see what people are using and they just compile that together into a top 10 list and people run it. It's very smart.\n\nLenny (01:27:09):\nAmazing. We've gone through all three steps. Is there anything else that you wanted to touch on that we haven't touched on? Anything else that you think would be really valuable for founders or product leaders trying to get press that we haven't already shared?\n\nJason Feifer (01:27:23):\nThis has come up in different ways, but I'll just put a point on it as a maybe final way of thinking about this. Be human, be human. Press releases don't work because they're not human. I don't like interviewing people who are on talking points because that's not human. You're ultimately engaging in a human business. A subjective decision is being made about how to serve an audience of humans. There's no right or wrong. There's no way to know. Media is a sort of barely data-driven industry because every story is kind of different. It's like it's hard. It's hard to optimize the product because the product changes every minute. You're dealing with humans and the more that you can be human in every step of this process, when you pitch, write a human email, don't write a thing that looks like it came off of some marketing copy. Write a human email to another human and then when that person engages with you, be very human with them.\n\n(01:28:26):\nI mean, Lenny, the reason why that fast company reporter liked you, I am very sure was because when they got on the phone with you, you were just like a normal nice guy. If you presented yourself differently because you just wanted to frame yourself in some way or you felt protective or something or whatever it was, the reporter would've thought, \"This guy is a dick,\" and he would've written a totally different story.\n\nLenny (01:28:53):\nMm-hmm.\n\nJason Feifer (01:28:54):\nBe as human as you can and you will be dealing with a human who will receive that.\n\nLenny (01:28:59):\nAmazing advice. With that, we've reached our very exciting lightning round.\n\nJason Feifer (01:29:04):\nYeah.\n\nLenny (01:29:05):\nAre you ready?\n\nJason Feifer (01:29:06):\nLet's do it.\n\nLenny (01:29:07):\nLet's do it. What are two or three books that you've recommended most to other people?\n\nJason Feifer (01:29:12):\nAndrew Chen's, The Cold Start Problem has come up over and over again for me because they're just really great lessons about network effects. I've been having a lot of conversations about anxiety and perfectionism with entrepreneurs lately, and a book by a psychotherapist named Katherine Morgan Schafler called The Perfectionist's Guide to Losing Control, is, I think, just a really great read.\n\nLenny (01:29:34):\nSuper cool. What is a favorite recent movie or TV show that you've really enjoyed?\n\nJason Feifer (01:29:38):\nMovie? I don't get to see a lot of movies these days. I have two little kids, but I took my eight-year old to see the new Teenage Mutant Ninja Turtles, which was great and a really nice way of, I loved them as a kid, and so it was cool to see the modern version. Then my wife and I just finished Better Call Saul like years late, but it was just perfect.\n\nLenny (01:29:56):\nI haven't watched that series yet. I loved Breaking Bad.\n\nJason Feifer (01:29:59):\nOh, it's worth it. You got to.\n\nLenny (01:30:01):\nOkay. Another series I got to get started on.\n\nJason Feifer (01:30:03):\nI know it's too much, too much television.\n\nLenny (01:30:05):\nI usually ask this next question too, like product leaders and growth people, but I'm curious what the answer for you would be is. Do you have a favorite interview question you like to ask people you're interviewing? Usually it's about people you're hiring.\n\nJason Feifer (01:30:16):\nInterviewing a job candidate?\n\nLenny (01:30:16):\nYeah, that's the ideal, but take it either way.\n\nJason Feifer (01:30:19):\nI'll take it a little bit different because we've been talking about press. This is a really great strategy for interviewing people, and I'm going to tell it to you because I think that it's also good in any other context, and it might be a thing that somebody will do to you in an interview. My favorite strategy for interviewing people is to throw a theory at them, and I don't mean a theory of the world. I mean that maybe 10 minutes in after they have told me a couple different things and answer some different questions, I'll make a connection in my head and I'll say, \"I want to run a theory by you. Do you think that the reason why you are really interested in this or you made that decision is actually because of this other thing that you told me a little bit about?\"\n\n(01:30:59):\nYou're listening. It's really active listening, and you're combining things together into some theory. The reason why the theory works so well is because it forces people to think in real time in front of you. I like that because I often interview people who have been interviewed a million times before. I interview Jimmy Fallon and The Rock and whatever. They've been interviewed a million times before, so how do you get them to think in front of you? The answer is to ask them the thing that they haven't been asked. What I love about the theory is that it shows them that you're really listening and you're trying to understand them. \"It's so interesting that you did that. I wonder if it's because of,\" X, Y, Z thing. That gets them to react in a really earnest honest way.\n\n(01:31:49):\nI would say for what it's worth, as a job candidate tactic, it's not that bad either. My favorite job interview that I ever did as a candidate that I didn't even get the job was years and years ago, I interviewed for a job at New York Magazine. I interviewed with Adam Moss, who is not there anymore, but he was the legendary editor in chief. He made me, on the spot, drill down specifically into an idea. He was like, \"What's your favorite section in Strategists,\" which is one of the sections of magazine. I was like, \"I really like the real estate section.\" He's like, \"All right, what would be a good neighborhood that we should feature in the real estate section?\" I was like, \"Oh, I don't know,\" I named a neighborhood. He's like, \"What would be three good elements of that?\" He just kept pushing me, drill down, drill down, drill down. There was no right or wrong answer. He just wanted to see how I thought. I found that to be incredibly powerful, and I do a version of that when I interview people.\n\nLenny (01:32:48):\nAwesome. I love that. What is a favorite product you've recently discovered that you really like?\n\nJason Feifer (01:32:54):\nI use BIGVU, I don't even know how to pronounce it, BIGVU, B-I-G-V-U, all the time. It's a teleprompter app. I spent like $150 buying an actual teleprompter because I make a lot of video and that teleprompter is, it's actually for people who are just listening to this, I'm pointing at another desk across my room where it's sitting there and I've never used it. The reason is because then I discovered BIGVU, which is just a app that runs a teleprompter very close to the camera, either in horizontal or vertical mode. I've tested it out in a million different ways, and it really works like you're reading it and it really looks like you're looking directly at the camera. I love it. It has saved me so much time.\n\nLenny (01:33:33):\nThat is cool. You basically put your phone on your screen next to the camera or wherever your camera is?\n\nJason Feifer (01:33:39):\nNo, no, no. This would be for if you're recording, if you're recording on the phone.\n\nLenny (01:33:44):\nGot it. You're staring at the phone and it's telling you what to say. I get it.\n\nJason Feifer (01:33:44):\nYeah. Yeah.\n\nLenny (01:33:44):\nThat's awesome.\n\nJason Feifer (01:33:47):\nYou write a script and then you just import the script and then you choose the speed and you can fuss with it, how many words per minute, and then it'll run the text very close to where the camera lens is.\n\nLenny (01:34:01):\nAmazing. All right.\n\nJason Feifer (01:34:02):\nYeah.\n\nLenny (01:34:02):\nI'm going to check that out. What is a favorite life motto that you'd like to repeat yourself, share with friends, something that comes up a lot,\n\nJason Feifer (01:34:10):\nSomething that I've been repeating a lot to people is something that I heard, so I recommended Katherine's book, The Perfectionist Guide to Losing Control. I met Katherine because I, we've since become friends, but I interviewed her for the podcast when her book came out. We were talking about feeling overworked and being stretched too thin, and she gave me this question, which I think about almost daily, and I repeat to people all the time, and that is, \"What's the point of building something if you can't maintain it?\" I love that question because I, like probably everyone listening to this, pushes themselves really hard, and at some point you have to step back and think, \"Am I building something where at some point there is sustainability for me here, or is this unsustainable and what's the point of building something if you can't maintain it?\" It's a great reminder for why you're building something and how you have to build it.\n\nLenny (01:35:03):\nI have a very similar quote that my sister's partner once said that has stuck with me forever, which is, \"Life is maintenance. Basically everything that you buy or bring into your life, you have to maintain.\"\n\nJason Feifer (01:35:16):\nYeah.\n\nLenny (01:35:17):\nWe got a new air conditioner. Now, we have a guy that comes every year to check it. You got a generator, someone's got to check that thing all the time. We got a toy, now I got to think about where does it go and do we throw it away? Do we keep it? Everything that you bring into your life, you have to maintain basically for the rest.\n\nJason Feifer (01:35:17):\nYeah, it's really true.\n\nLenny (01:35:33):\nYeah, so it's really, I think specifically for work, it's like you start a new project, you're going to have to-\n\nJason Feifer (01:35:39):\nYou're going to have to maintain it.\n\nLenny (01:35:40):\n... maintain it, like this podcast, right? It's like, do you want to start a podcast and do it forever?\n\nJason Feifer (01:35:45):\nYeah.\n\nLenny (01:35:46):\nThat's a part of it. Part starting something is you have to maintain it.\n\nJason Feifer (01:35:49):\nYeah.\n\nLenny (01:35:49):\nYeah.\n\nJason Feifer (01:35:50):\nI know we're in the lightning round and we've defied the logic of lightning rounds, but I'll just add one other thing to that, which is that I interviewed Michelle Pfeiffer for the cover of the magazine, and one of the things that I thought was most fascinating was that she started this fragrance company, and it's called Henry Rose. She said the major difference between making movies and building a company that she found, was that when you make a movie, all the work happens in the beginning. You make the movie and then the movie is out, and then you are done. You don't have to work on the movie ever again. She was not really mentally prepared for a company being the exact opposite, that the launch of the company is actually the start of the work and there's an endlessness to it. She said that it took her a solid year to adapt to that reality, and then it became fun. I think it's the thing people forget.\n\nLenny (01:36:42):\nMm-hmm, Well, that story, it's cool that you got to interview Michelle Pfeiffer.\n\nJason Feifer (01:36:45):\nYeah, she's great.\n\nLenny (01:36:46):\nFinal question. I was reading your profile line and you said that the only reason you were able to achieve what you've achieved in life and got to where you're today is something that you called the opportunity set B.\n\nJason Feifer (01:36:57):\nOh, yeah.\n\nLenny (01:36:58):\nCan you just explain what that is and why that is so important to you?\n\nJason Feifer (01:37:02):\nOh, yeah, sure. In front of you right now, you, Lenny, you everyone listening, watching, there are two sets of opportunities. Opportunity set A and opportunity set B, opportunity set A is everything that's asks of you. If you have a job, it's what your boss expects of you. If you have your own company, it's what everybody expects of you. Doing good at those things is really important. That's a measurement of success. That's opportunity set A, everything that's asked of you. Then there's opportunity set B and opportunity set B is what's available to you, even though nobody's asking you to do it. That could be, again, if you have a job, that could be taking on new responsibilities or joining a new team or something. Personally, it could be pursuing a hobby. It could be starting a podcast because you like listening to podcasts, anything.\n\n(01:38:01):\nWhat I have found throughout my own career is that opportunity set B is always more important, infinitely more important. The thing is that if you only focus on opportunity set A, then you are only qualified to do the things that you're already doing. Opportunity set B is where growth happens and where you push yourself in different directions. I found a long time ago that it was just really helpful to think about these two things. Oftentimes, maybe we don't do opportunity set B because we don't know how it's going to pay off, or we don't know where we're going to find the time. I have always found, always, that engaging in these things of what is available to me, what's available to me right now around me, and nobody's asking me to do, leads to the next growth either because it turns into an actual opportunity or because it informs some future opportunity.\n\n(01:38:58):\nI got to Entrepreneur Magazine, zero, zero people, when I became editor in chief, zero people said, \"You should hit the speaking circuit. You should get really good at being interviewed on podcasts. You should write a book.\" Nobody said any of that. My job was to make a good magazine and direct the editorial of the brand, but all those things were available to me, and once I recognized that, I realized that I can pursue them and in doing so, also think differently about who I am. Am I a magazine editor? Not really anymore. That's one of the things that I do now. I think of myself as an entrepreneur, as a person who is now in the business of helping others. I'm an entrepreneur who helps entrepreneurs. That's what I think of myself as. I only got there because I was thinking, I am here and therefore I can get there. Nobody's ever going to ask me to do it. I have to do it myself. It's the thing that I always think about, and it's the thing that keeps me up at night. What am I doing now that is leading me to something else? I'm the only one who can figure it out.\n\nLenny (01:39:59):\nBeautiful. It reminds me of a recent podcast guest's advice, which is the best way to track your progress in your career and in life too is just measuring how many, \"Oh shit\" moments you have because those are the moments where you're growing, you're doing something. I think maybe it's an example of an opportunity set B where it wasn't the default path that's like, \"oh, I think I should do this, even though it's really hard.\"\n\nJason Feifer (01:40:20):\nYeah.\n\nLenny (01:40:22):\nWhat a beautiful way to end it. Jason, not only do I want to start working on press, it feels like very achievable to get press now. That was really energizing, like, \"Holy shit, I could do this. I could just find some people, pitch them. Here's how I do it.\"\n\nJason Feifer (01:40:33):\nYeah.\n\nLenny (01:40:34):\nNot only that, I'm going to look for some opportunities set B routes for myself too. Thank you so much for being here. Two final questions. Where can folks find you online if they want to reach out, maybe pitch you on their story? How can listeners be useful to you?\n\nJason Feifer (01:40:47):\nOh, so Lenny, thanks for all the work you do, which I just really love, and for creating the space for me to share all this insight. How can you find me? Well, I'll offer two things. An opportunity set B, like a good launching point for both of them, I wrote a book, it's called Build for Tomorrow. It is meant for anybody who's going through any kind of change in their lives or their work. There's an audiobook version that I read myself, but also hardcover and eBooks, just find it wherever you get books. Again, it's Build for Tomorrow. Opportunity set B, that whole thing, is actually a chapter in the book, so I go into a lot more detail there.\n\n(01:41:20):\nThen if you want to get in touch and also get those kinds of things, I have a newsletter, which is called One Thing Better each week. One way to improve your work and build a career or company that you love. Again, the kind of opportunities set B, that's the kind of thing that I put out. It's very much about the personal and emotional side of work. You can find that by going to the web address onethingbetter, that's one, O-N-E, onethingbetter.email. Just plug that in. Onethingbetter.email. I said that's a good way to reach out to me because if you get the newsletter and you reply to it, it goes to my inbox. I guarantee I will write back to you.\n\nLenny (01:41:56):\nInside track. Jason, thank you again so much for being here.\n\nJason Feifer (01:42:01):\nOh, thanks Lenny. This was so fun.\n\nLenny (01:42:03):\nBye everyone.\n\n(01:42:05):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review, as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "# 播客对话翻译\n\nJason Feifer (00:00:00):\n编辑、作家，我就直说了吧。他们不关心你。他们不关心你。他们关心的是他们的读者、听众或观众。那才是他们关心的人。那才是他们服务的对象，如果你能在分享他们想要为受众提供的信息方面对他们有用，那么你就能得到你想要的。但你不能把他们当作服务提供商对待，因为他们不是。所以你必须带着对他们想为受众做什么以及你如何融入其中的理解来接触他们，因为如果你不这样做，他们对你不感兴趣。\n\nLenny (00:00:47):\n今天，我的嘉宾是 Jason Feifer。Jason 是《企业家杂志》(Entrepreneur Magazine) 的主编，之前曾担任《快公司》(Fast Company) 和其他多家杂志的编辑。他也是一位作家、播客主持人、主题演讲者和创业顾问。在我们的对话中，我们非常具体地探讨了如何为你的产品获得媒体报道。Jason 分享了如何向记者推介、如何找到合适的记者推介、要考虑哪些出版物、为什么自由撰稿人更有可能报道你的故事、为什么出版物的使命在你如何推介时如此重要，以及使用什么渠道联系记者、如何思考你的目标以及从获得媒体报道中如何定义成功等等更多内容。\n\n(00:01:25):\n我从这次对话中学到了很多，如果你想为你的项目获得媒体报道，你会在这里发现很多价值。接下来，让我们在简短的赞助商广告后，请出 Jason Feifer。本期节目由 Sidebar 赞助。你是否在寻找你的下一个重大职业转变或开创自己的事业?创造职业生涯重大飞跃最有效的方法之一，也是几年前对我非常有效的方法，就是建立个人董事会 (personal board of directors)，一个值得信赖的同行群体，在那里你可以讨论你面临的挑战、获得职业建议，并对你如何思考你的工作、职业和生活进行核查。这对我来说是一个重大的轨迹改变者，但建立这个值得信赖的群体很难。\n\n(00:02:05):\n通过 Sidebar，高级领导者会与经过严格审查的私密支持性同行群体配对，依靠他们获得公正的意见、多元化的视角和直接的反馈。每个人都有自己的天才领域，所以我们一起能更好地准备应对职业陷阱，从而获得更多责任、更快的晋升和更大的影响力。在世界级的项目和引导下，Sidebar 使你能够在旅程的每一步都获得有针对性的战术反馈。如果你是这个播客的听众，你可能已经很有动力并致力于成长。Sidebar 个人董事会是催化这一旅程的缺失部分。为什么要花十年时间寻找你的人脉，当你今天就可以在 Sidebar 遇到他们?\n\n(00:02:46):\n访问 sidebar.com/lenny 了解更多信息，跳过来自顶级科技公司数千名领导者不断增长的等待名单。就是 sidebar.com/lenny。本期节目由 Maui Nui Venison 赞助，这是一家以使命为导向的食品公司，将地球上最健康的红肉直接送到你家门口。我实际上是在今年早些时候听了 Tim Ferriss 播客上的广告后加入 Maui Nui Venison 的，我很高兴能进一步传播这个信息。这家公司不仅提供最营养密集和蛋白质密集的红肉，他们的运营还生产市场上唯一无压力的 100% 野生采集红肉，这是世界上独一无二的，积极管理毛伊岛入侵的过剩鹿群，帮助恢复夏威夷脆弱的生态系统、食物系统和社区的平衡。\n\n(00:03:33):\n而且，它真的很美味。一点都不腥，而且很容易烹饪。我和我妻子用这种肉做了炖菜、牛排和各种烤制美食。从道德角度来看，我们也对它作为蛋白质来源感觉很好。我强烈推荐尝试他们的全天然鹿肉干条作为最佳蛋白质零食，以及他们在线肉店提供的各种新鲜切割肉类。会员名额有限，但你可以在 mauinuivenison.com/lenny 注册并在首次订购时获得 20% 的折扣。就是 mauinuivenison.com/lenny。Jason,非常感谢你来这里,欢迎来到播客。\n\nJason Feifer (00:04:13):\nLenny,感谢邀请我。\n\nLenny (00:04:14):\n这绝对是我的荣幸。我们最近实际上在几件事上合作过，当我们聊一些事情时，我向你寻求建议，如何帮助我正在合作的一家创业公司获得媒体报道，你分享了一些很棒的建议，所以我问你是否可以来这个播客上分享类似的建议，告诉人们如何帮助创业公司获得媒体报道，于是我们就在这里了。\n\nJason Feifer (00:04:36):\n是的，我很高兴你邀请我这样做。这是人们经常问我的事情。我在媒体行业工作了几十年。我在很多不同的杂志工作过。显然，我现在经营《企业家杂志》，但我曾在《快公司》工作过。我在《男士健康》杂志工作过，所以我见过媒体的许多不同方面，这是一个被严重误解的工具，特别是对商业人士来说，所以我喜欢揭开它的神秘面纱。\n\nLenny (00:05:00):\n太棒了。我也很兴奋能学到这一切，所以谢谢你这样做。\n\nJason Feifer (00:05:04):\n好的。\n\nLenny (00:05:04):\n第一个问题是，作为媒体从业者，有多少来自创业公司创始人和公关人员试图让你报道他们的信息向你涌来，还有你合作的记者?\n\nJason Feifer (00:05:15):\n是的，数量巨大。太疯狂了。我会说，等我们录完这期播客，我的收件箱里会有，我不知道。我的意思是，可能有 30 到 50 个推介。它整天都在涌来。现在，需要明确的是，其中大部分是垃圾，真正垃圾意义上的垃圾，对吧。\n\n(00:05:36):\n很多完全不相关的新闻稿被发送给我和无数其他人。但在其中，肯定有一些人花时间专门联系我，媒体上的每个人都会收到某种程度的这种信息量。联系媒体上的某人就是在大量噪音中喊叫。\n\nLenny (00:06:01):\n哇。我想我们稍后会谈到这一点，但我很好奇，这些信息中有多少百分比来自公关人员和新闻稿，而不是创始人或自己做这件事的人?\n\nJason Feifer (00:06:12):\n我收到的来自创始人的直接信息百分比很低。我会说大概是 20%、25%。然后 75% 是某种形式的公关，要么是有针对性的公关，有人故意联系我，要么是大规模群发的新闻稿。\n\nLenny (00:06:30):\n你知道什么很疯狂吗,我现在也收到很多这样的信息。人们认为我是某种记者，他们就像\"禁止发布公告产品发布\"。\n\nJason Feifer (00:06:37):\n这并不需要太多，因为你只是最终出现在某个列表上，真正有趣的是，我们稍后会谈论公关，我知道。但你可以深入了解该行业挑战的一个重要见解是，其中很多是完全自动化的，很多公关人员并没有具体考虑如何向正确的潜在媒体渠道讲述正确的故事。相反，他们所做的只是玩一个数字游戏，他们只是向所有人群发。\n\n(00:07:13):\n这意味着你可能最终......我写这份新闻通讯，对吧。我有......《企业家杂志》显然是人们会推介的东西，但后来我有这份新闻通讯，我不采访任何人。没有机会在我的新闻通讯中被报道，但我仍然收到新闻通讯的推介，因为有人看到了它并把它放在某个电子表格中，现在我就收到了。我认为这对支付费用让人们这样做的企业家来说是一种真正的伤害，我真的很讨厌这样。\n\nLenny (00:07:41):\n是的。好的，所以我们将深入探讨如何真正做好这件事的核心内容，但还有几个问题只是为了设定一点背景。一个是在影响方面。你看到获得媒体报道对创业公司的影响是什么，特别是在产品增长方面?\n\nJason Feifer (00:07:57):\n所以这是一个非常广泛的范围。我有企业家告诉我，《企业家杂志》上的一篇文章，比如印刷杂志或只是在线，将推动更多的，无论是更多的应用下载，还是那个月的更多销售，都超过他们任何付费营销努力。\n\n(00:08:16):\n但我也听到企业家告诉我，它对他们没有任何作用，或者它为他们做了一件非常具体的事情，也就是说，也许一些潜在的合作伙伴读了它并联系了他们，开始了一次有趣的对话。它遍布整个范围，这对人们来说是一件非常重要的事情要记住，我认为你不应该把这作为增长策略来依靠。这是一个很好的附加功能。但如果你认为媒体报道本身会解决你的问题，那你就错了，因为它可能会，但它太不可预测了。\n\nLenny (00:08:48):\n在这些方面还有什么其他的，只是何时值得某人投入时间获得媒体报道，无论是创业阶段、创业类型，任何一般性的广泛建议，你不应该花时间尝试获得媒体报道，相对于这对你来说是一个真正好的机会。\n\nJason Feifer (00:09:02):\n以你思考筹集资金的方式来思考媒体报道，也就是说，当你知道资金的用途时你才这样做，当你知道媒体报道的用途时你才应该这样做。很多人在如此早期的阶段联系我，如果我们报道他们，他们不会得到任何东西。他们不在一个可以以任何有意义的方式使用该媒体报道的阶段，所以现在追逐它真的没有目的。你应该退后一步，真正作为一个起点思考,\"我需要媒体报道做什么?\"如果你对此有一个好的战术答案，那可能是因为我需要提高对新产品的认知。那可能是因为我要出去筹集资金，我需要文章来表明市场认真对待我。\n\n(00:09:55):\n这些都是很好的理由，但我收到很多电子邮件。这很有趣，因为人们......就像企业家，特别是，他们有时非常脆弱，这在某种程度上是一种美妙的方式。有时人们会给我发电子邮件，他们只会说,\"你知道，我工作很努力，我只是觉得我应该得到这个。\"我尊重这一点，并且在某些方面与我自己试图为自己的工作获得关注相关。但是,\"我应该得到这个\",这对你的业务来说不是一个好的战术决策,这对你没有任何作用。所以我会把它放在一边，只把媒体报道看作你不会出去筹集资金,如果你不知道资金的用途。如果你不知道媒体报道的用途，你就不应该出去尝试获得媒体报道。\n\nLenny (00:10:38):\n我很好奇听到其他例子,什么时候不是，什么时候是一个坏主意，因为，就像我说的，作为一个外部观察者，我总是希望为我的产品获得更多关注，让更多人了解它，更多人查看它。有没有一个例子或任何想到的事情，在这个时刻或对这个产品来说，你没有必要这样做?\n\n# 播客对话翻译\n\nJason Feifer (00:10:55):\n很多时候,关键甚至不在于某个时刻,而在于媒体出版物本身。我给你举个例子。我曾在一次活动上演讲,之后有个人走过来找我,他在华盛顿特区经营着一家小型热狗餐车生意。他说他有几辆餐车,热狗生意做得不错,他想在《创业家杂志》(Entrepreneur Magazine)上获得报道。他问:\"哦,我怎么才能获得专题报道?\"他这种想法的问题在于,他真的把精力用错了地方,因为如果他在华盛顿特区卖热狗,那我明白媒体报道对他意味着什么。媒体报道是为了推动热狗销售。这就是他想要达到的目的。但《创业家杂志》无法为他做到这一点。完全做不到。为什么?因为《创业家杂志》的受众是全国乃至国际性的。\n\n(00:11:52):\n这意味着读到这个人故事的人中,99.5%都没办法去买他的热狗,这意味着那是在浪费精力。好吧,在会议上走过来跟我聊天有那么难吗?不难。但把这个规模扩大来看。他发了多少封类似的邮件?他投入了多少精力去追逐那些最终对他没有直接价值的东西?他需要做的是思考:\"好的,我的目标是让更多人买热狗。我在哪里?在华盛顿特区。我如何接触到我所在市场中对美食感兴趣的人?\"所以别再追逐《创业家杂志》了,开始去追逐当地的美食网站Eater,或者《华盛顿人》杂志的美食专栏之类的。这样一个小小的转变可以让你的努力获得更多回报。\n\nLenny (00:12:38):\n这正好引出了下一个话题,让我们直接深入探讨如何真正获得媒体报道,我知道你——\n\nJason Feifer (00:12:38):\n是的。\n\nLenny (00:12:42):\n——你有一个三步结构来思考这个问题。也许先说说这三个步骤是什么,然后我们再逐一深入探讨。\n\nJason Feifer (00:12:50):\n好的,当然。我的意思是,看,这其实很简单,对吧。第一步是准备。你要思考如何讲述你的故事。你要思考我刚才谈到的那些事情。媒体报道对你来说意味着什么?你需要做的一切都是为了明确这个机会是什么,我为什么要追求它,以及如何最大化利用它。第二步是弄清楚向谁推介。并非所有的媒体报道都是平等的。没有理由随意追逐所有人。热狗的例子就是个好例子。\n\n(00:13:19):\n所以要找到你真正要联系的作家和编辑,那些最可能接受你的人。同时确保因为你做了准备工作,你能找出如何以他们感兴趣的方式讲述你的故事。我们会谈到这一点。然后第三步是实际的推介。向这些人伸出手意味着什么,与作家和编辑互动?你如何找到他们?你给他们发什么?你告诉他们什么?就是这样。\n\n(00:13:42):\n我的意思是,对吧。但你需要理解的是,你正在进入一个可能与你想象的运作方式不同的世界,作为推介的接收者,我经常看到这种情况。人们不理解他们联系的是谁,以及我和我的同事是如何思考的。我们甚至应该从这一点开始,因为要理解的一个非常重要的事情就是,再回到那个——\n\nLenny (00:14:07):\n就这么做吧。是的。\n\nJason Feifer (00:14:08):\n——是的,投资人的比喻,如果你不了解投资人做什么,他们对什么感兴趣,或者他们投资什么类型的公司,你就不会去联系投资人。对待媒体也不能这样。所以我每天都会收到这样的推介:\"我如何在《创业家杂志》上获得报道?我如何在《创业家杂志》上获得专题报道?\"对我来说,这总感觉像是他们在向我点汉堡。就像,\"我如何从创业家汉堡店买一个汉堡,对吧?\"他们把我当成服务提供商。好像我的工作就是提供媒体报道。\n\n(00:14:44):\n我理解,因为当然,如果你是一个创业者,你在寻求媒体报道,那么……那些作家和编辑似乎是在做写人的生意,因此,他们似乎提供某种服务,你试图弄清楚如何获得它。但媒体不是这样看待自己的,对吧。编辑、作家,我就直说吧,他们不关心你。他们不关心你。他们关心的是他们的读者,或听众,或观众。\n\n(00:15:18):\n那才是他们关心的人。那才是他们服务的对象。如果你能对他们有用,帮助他们分享他们想要为受众提供的那种信息,那么你就能得到你想要的,但你不能把他们当成服务提供商,因为他们不是。所以你必须了解他们试图为受众做什么,以及你如何融入其中。因为如果你不这样做,他们对你不感兴趣。\n\nLenny (00:15:49):\n我喜欢这一点。更具体地说,他们试图为受众做什么?我想应该就是提供一些他们想读的有趣内容。一些他们可以学到的东西。一些让他们觉得\"哇,我真的很想读这个\"的东西。\n\nJason Feifer (00:16:00):\n是的。但根据每个出版物的使命,会更具体。例如,我曾在两家不同的商业刊物工作过。我在《快公司》(Fast Company)做了好几年高级编辑,现在我是《创业家杂志》的主编。关于一个故事是否属于某个出版物的决定,在这两个出版物中是完全不同的。所以我现在不能代表《快公司》发言,因为他们经历了几次领导层变动。我不知道他们的使命是什么,但当我在那里工作时,在Bob Safian手下,他是主编,那真的是一本关于商业走向的杂志,杂志里的故事都应该在某种程度上代表商业的演变。\n\n(00:16:50):\n所以当人们推介时,我们真正寻找的是,这个人所做的事情中是否有见解,让其他人能够读到并说:\"啊哈,这帮助我理解了这个行业或那个行业的发展方向,或者它帮助我思考如何塑造自己的公司以匹配当前趋势\",诸如此类的东西。《创业家杂志》,使命完全不同。我对《创业家杂志》的看法是,它甚至不是一本关于商业的杂志。它是一本关于思维的杂志。或者说我想做的是确保每个来到这本杂志的人都能带走关于如何思考他们业务中挑战的精彩见解。\n\n(00:17:29):\n所以当有人联系我时,我寻找的是,他们是否做出了一些有趣的、反直觉的决定,解决了他们业务**中**的问题,我要强调\"中\"这个字。因为通常当人们听到我谈论解决业务中的问题时,他们会想,\"啊哈,但我解决了业务中的一个问题,对吧。我看到世界上没有最好的剃须刀,所以我制造了最好的剃须刀。\"这不是我说的。我说的是……有一个女士叫Joelle Mertzel。她有一家公司叫Kitchen Concepts Unlimited,她制造黄油碟,这是一个非常智能的黄油碟,因为它是建立在铰链上的,对吧。所以这是为了解决一个非常具体的问题而设计的,Lenny,我不知道你是否知道这一点,我不知道,你不需要冷藏黄油。你知道吗?\n\nLenny (00:18:18):\n我在理智上知道这一点,但我仍然冷藏它。我知道有些人不冷藏。\n\nJason Feifer (00:18:22):\n我也是,尽管我已经和这位女士就这个问题进行过多次对话。你不需要冷藏黄油,如果你把它放在外面,它更容易切。更容易涂抹。大问题,黄油碟。所以大多数黄油碟你只是掀起来。所以如果你有温暖的室温黄油,很软,你把黄油碟盖掀起来,你可能会碰到黄油,会搞得一团糟。所以Joelle制造了一个带铰链的黄油碟,对吧。每次都以完全相同的方式打开和关闭。不会弄乱。太棒了,解决了问题。她就这个联系我。这对我们来说不有趣,对吧。也许这对烹饪杂志很有趣,对吧。也许《美食家》(Bon Appétit)对此感兴趣。《创业家杂志》对此不感兴趣,因为这并不能帮助其他创业者思考这个问题。\n\n(00:19:13):\n但后来她告诉我别的事情。她告诉我的是,在这一切的最开始,她试图弄清楚如何回答关于她的受众的一些基本问题,比如他们想要这个黄油碟是什么颜色,他们愿意支付什么价位?她想做一些市场调研。她去了一家市场调研公司。她说:\"研究消费者并回答这些问题要花多少钱?\"他们说,一万美元。她没有一万美元。然后,有一天,她坐在机场等待登机,她环顾四周,意识到机场里到处都是绝对没有比回答关于黄油碟的问题更好的事情可做的人,对吧。没有更好的事情可做,就坐在那里。你可以从一号登机口开始。当你到达八号登机口时,一号登机口的人都是新的。你可以重新再做一遍,你可以买晚上6点的航班,然后早上9点到达。没人会阻止你。你可以在机场做一整天。这就是她开始自己做市场调研的方式。她省下了那一万美元,自己做了。我把这个故事放在杂志上。很小的故事。这是一家微不足道的随机公司和一个随机的决定。但我这样做的原因是,每次我向创业者重复这个故事时,他们都会说,\"呃,对,完全正确。总有其他方法可以做事情。\"他们喜欢这种创造性。这就是我在寻找的。这就是《创业家杂志》的故事。所以回到你提出的观点,这不仅仅是,\"嗯,这是一本叫《创业家》的杂志。他们肯定写创业者,对吧。我是创业者。我属于《创业家杂志》。\"\n\n(00:20:41):\n人们总是这样想。不对。你必须退后一步,阅读这些出版物正在发布的内容,问自己,\"他们在做什么?这里的目的是什么?\"编辑和作家,他们在决定什么进入这本杂志,他们在决定如何构建故事。他们为什么这样做?他们试图接触谁?当你开始从这个角度看待它时,你开始看到模式,你就能真正理解如何向这些出版物推介的说明手册。\n\nLenny (00:21:13):\n这是一个非常有趣的见解。我完全不知道这是你应该考虑的事情。有没有简单的方法来理解出版物的使命?他们经常在\"关于\"页面添加这个吗,还是像你说的,你只是阅读大量内容并试图弄清楚?\n\nJason Feifer (00:21:28):\n没有人会以那种方式发布\"关于\"页面,因为那是编辑团队的内部逻辑。但你当然可以根据出版物试图接触的人群做一些初步假设。每个人都在试图接触某些人。当某些东西变得越来越大众化时,就会变得更加复杂,对吧。《纽约时报》是什么?\n\n(00:21:53):\n使命是什么？这是一个很难回答的问题。你必须把它分成几个部分，对吧。国内新闻部的使命与商业部的使命不同，即使在商业部内部，周日商业版块的使命也不同于周一到周六商业版块的使命。\n\nLenny (00:22:09):\n[听不清 00:22:09]。\n\nJason Feifer (00:22:09):\n所以你必须开始真正地分析它。这就是为什么人们要聘请公关的原因，因为如果他们擅长自己的工作，他们已经了解了很多这些内容。但我确实认为，如果你花时间研究内容，你的出发点是，\"我理解这份出版物试图触达X。他们试图触达这些人，\"那么你就可以开始看到他们正在做什么的模式。他们是如何讲述故事的？这五个故事有什么共同点？它们有一些共同点。它们都在做某件事，你当然可以解读这些迹象并试图弄清楚。\n\nLenny (00:22:48):\n很好。好的。感觉我们已经进入了关于准备工作的第一步。准备获得媒体报道还涉及什么？\n\nJason Feifer (00:22:57):\n如果我们谈论准备工作，你需要做的第一件事就是我之前说的，就是问自己，我需要媒体报道做什么？你需要一个好的答案来回答这个问题。一旦你有了答案，接下来你应该做的是开始思考，\"嗯，我的业务有什么有趣的地方？\"通常，这不一定是你想的那样，你可以在某种程度上被第二步正在发生的事情所引导，你开始思考你试图接触的人是谁。因为，例如，有人可能会告诉我在Entrepreneur的故事会与有人可能告诉Cosmo的故事不同。\n\n(00:23:42):\n一家公司有理由同时出现在Entrepreneur和Cosmo上，对吧。也许这个产品是为年轻女性设计的。所以，Cosmo可能会对某种产品特写感兴趣，或者将该产品纳入某种产品综述中。而Entrepreneur会做以创业者为重点的故事。这位创始人做了什么？他们是如何崛起的？你可以……你可以考虑你的故事，把它分解成一堆不同的小片段，然后弄清楚哪一部分对应哪个媒体。但通常，人们会犯错误，试图反向操作，也就是说，他们决定他们希望在世界上传播什么样的叙事，然后他们就四处向不同的出版物推销这个故事。我经常遇到这种情况。\n\n(00:24:34):\n我收到的很多推销邮件都是来自那些根本没有真正思考过Entrepreneur发布什么内容的人，而只是有一些他们想要传播到世界上的东西。我是说，一个很好的愚蠢例子是，昨天有人给我发了一封关于一家公司刚刚聘请了一位新总裁的电子邮件。我不在乎那个。这对我的受众完全没有用。我确信有一个行业出版物，对吧。假设餐饮行业有一家公司。我确信关注餐饮行业每一个动态的行业出版物可能会对你的新总裁感兴趣。但我不会，因为你聘请那位新总裁对我的受众没有用。Entrepreneur中的故事实际上不是关于我写的人。\n\n(00:25:23):\n它们实际上是关于受众的。它们实际上是我通过我所写的人的故事为受众服务。那没用。我希望他们花点时间想想这个问题，但他们没有。所以一旦你开始思考你试图触达的人是谁，你可以退一步说，\"嗯，我的旅程中哪一部分与他们最相关？我会推动你对此非常有创意。因为如果你回到Butterie的例子，那个黄油碟，关于机场的那个有趣的小故事，我是说，还有谁在写这个？这不是她作为品牌故事的核心。这不是她销售宣传的核心。它是——\n\nJason Feifer (00:26:00):\n……她作为品牌故事的核心，这不是她销售宣传的核心。这只是为我们准备的。我们可能是世界上唯一一个关心这个的出版物,但我真的很关心它。\n\nLenny (00:26:11):\n太棒了。好的,所以总结一下你分享的内容,思考目标。你想从媒体报道中得到什么？目标可能是提高对我们所做事情的认识,一些新东西,投资者的兴趣。你看到的试图获得媒体报道的其他常见目标例子有哪些？\n\nJason Feifer (00:26:27):\n是的,对新事物的认识。但也不一定非要是对新事物的认识,可能只是持续增长,试图进入新市场。这很好。任何与增长或触达新客户群相关的——\n\nLenny (00:26:45):\n酷。\n\nJason Feifer (00:26:45):\n……都是有意义的。\n\nLenny (00:26:45):\n这很有道理。\n\nJason Feifer (00:26:47):\n但也可能是你想在自己的市场中以稍微不同的方式定位自己。例如,我看到很多人,很多大公司,一直敲我的门,因为我们不仅听到创业公司的声音,我们也听到大公司的声音,他们也在推销故事。我知道他们为什么想成为创业者。他们想成为创业者,因为他们试图将自己的品牌定位为也与小企业主相关。拥有这种背景很有帮助,因为创业者的报道可以帮助他们走向市场并说,\"看,我们也在触达X、Y、Z人群。\"\n\n(00:27:25):\n所以有时这甚至不是关于转化,而是关于定位,这也是一个很好的理由来推出你的高管。有时只是为了将你的CEO或创始人确立为特定领域的权威,因为你希望他们更值得信赖,你希望他们被邀请参加更多会议。因为所有这些都会吸引更多对公司的关注,做这些事情有各种各样的原因。然后试图接触投资者,试图接触合作伙伴。看,提高知名度有用的理由有一百万个,但你需要确保你理解你真正想要做什么。\n\nLenny (00:28:07):\n好的,太棒了。这真的很有帮助。所以想想你获得媒体报道的目标是什么,选择一份出版物,了解他们的使命和目标是什么。然后想想一些你可以向他们推销的有趣故事。不只是像我们有一位新总裁,而是你认为他们会很兴奋分享的、与他们的使命相关的东西。\n\nJason Feifer (00:28:25):\n没错。\n\nLenny (00:28:26):\n在这个话题上,我知道我们想谈谈联系谁以及如何找出真正要与谁交谈。我想到了几个问题。这都是大量的工作。创始人真的很忙。\n\nJason Feifer (00:28:35):\n是的,工作量很大。\n\nLenny (00:28:35):\n所以引出了一个问题,公关公司,你对是否建议与公关公司合作有什么看法吗？有没有一个合适和不合适的时机？\n\nJason Feifer (00:28:45):\n是的,我是说这是大量的工作。我描述的一切都是大量的工作。让我明确一点,人们在不做我描述的任何事情的情况下成功获得媒体报道,因为世界上会发生运气好的事。你很可能只是向某个随机编辑发送一封电子邮件,他们可能会喜欢它。这是完全可能的。你可以忽略我刚才说的一切。我真正帮助你做的是尽量优化你的方法。但是的,聘请公关可以省去很多这些工作。现在你不用自己做这些研究,不用自己思考这些挑战。你在与了解如何准确识别你故事中最有趣部分然后将它们转化为好的推销的人合作。那么为什么不是每个人都这样做呢？有几个原因。第一,成本公关可能很昂贵,所以你只需要考虑这一点。第二,公关是并且可能是,我会说可能是,一个非常令人沮丧的旅程,因为很多公关人员在他们的工作中非常糟糕。非常糟糕。\n\n(00:29:52):\n这不仅仅是我在抨击公关人员。我实际上被聘请在公关行业会议上发表主题演讲。我上台说大多数公关人员在他们的工作中很糟糕,每个人都点头。他们都知道这一点。当然,他们中没有人认为自己是糟糕的那一个,但他们都知道。公关界充满了工作糟糕的人。他们为什么工作糟糕？他们工作糟糕是因为他们懒惰,因为他们主要依赖电子邮件群发,只是发送东西,因为他们对传播信息的含义有一个过时的想法。例如,如果你聘请或与一家公关公司交谈,他们建议做的事情之一是你应该花钱做新闻稿,就像传统的新闻稿,尽可能快地逃离那里。我不知道你是否知道这一点。你知道这个吗？新闻稿,发布新闻稿有一些有目的的理由,但新闻稿实际上不再是吸引媒体的主要单位。\n\nLenny (00:31:07):\n是的,我有这种感觉。\n\nJason Feifer (00:31:08):\n是的。但这里有一个有趣的地方。所以我不会推荐的公关公司可能会这样做。他们会告诉你,\"我们将为这个新事物准备一份新闻稿,所以你必须为制作这份新闻稿以及分发这份新闻稿支付一点额外的钱,因为我们要做的是我们将把它发布到线上,\"因为有一大堆新闻稿发布线。所以他们会这样做,你会付钱,它会发布到线上。然后他们会给你发送一份关于这份新闻稿最终出现在所有地方的报告。它出现在Yahoo Finance上,它出现在Market Watch上。它在技术上确实出现了。新闻稿在那里,已经发布了。而全世界零个人会看到它,因为Yahoo Finance有一个部分,他们只是发布所有这些不同发行商发布的每一份该死的新闻稿。没人看到那个。\n\n(00:32:08):\n所以不要把发布新闻稿甚至在非常大的网站上与实际成功混淆。你在实际公关人员身上想要的是一个从事一件事的人,那就是关系。公关人员可以拥有的最重要的东西是与媒体人员的积极关系。为什么？如果公关人员向你保证媒体报道,这是另一个尽可能快地跑出门的理由,因为公关人员无法控制这一点。作家和编辑,他们做他们想做的。这是一个完全主观的行业,非常令人沮丧。我完全理解。那完全是主观的。所以公关人员能做的最好的事情就是塑造你的故事,了解该向谁推销,然后让那个作家或编辑看它,注意它。这个世界上有一些我非常看重的公关人员。我认为他们非常聪明,非常擅长他们所做的事情,他们只在有他们认为我会真正感兴趣的东西时才向我推销。而不是像很多公关人员那样每周或每天给我发送一些随机的东西。\n\n# 播客对话中文翻译\n\n(00:33:21):\n我不会关注那些人。但是，我不知道，只是要说一下，当Jack Taylor PR的John Beer给我发邮件时……John，我在十年前以PR（公关）的身份认识了他，从那以后我们成为了朋友。当他给我发邮件时，我会关注。我不会每次都写相关报道。我不会仅仅因为我喜欢John就写某些内容，但我会关注。说实话，关注就已经成功了一半，因为媒体人每天要收到太多邮件。所以你需要找一个真正了解你、了解你的行业、了解并认识他们应该联系的人的人，以及真正尊重你作为创业者并会给你直接反馈的人。因为有很多人会去雇佣PR，然后他们会说：\"我要你给这个、这个、这个、这个还有这个出版物发邮件。\"\n\n(00:34:16):\n如果PR人员只是照做，如果他们真的觉得这不太有意义的话，他们所做的就只是在打扰他们的联系人。当PR人员对你提出异议并说：\"你知道吗？我不认为你的故事适合那个出版物。原因是这样的。\"你应该喜欢这样的时刻。这样的人才是你应该雇佣的。\n\nLenny (00:34:34):\n还有其他你想点名表扬的PR人员吗，那些你认为很棒的？\n\nJason Feifer (00:34:38):\n这里的挑战是，我会后悔没有提到一大堆没有立即想到的人，但是——\n\nLenny (00:34:44):\n我们可以把其他人放在节目注释里，不管是谁。\n\nJason Feifer (00:34:45):\n好的，当然。好吧，让我想想。脱口而出的话，Jack Taylor的John，他做很多健康养生相关的事情。所以PR公司往往会专业化，你要确保你找的是真正了解你以及你要接触的媒体生态系统的人。所以我认为John真的很聪明。让我看看。Hannah Lee Communications的Hannah Lee在酒店业方面很出色。所以餐厅、酒店、酒类，他们真的很聪明。Jen Sesquila，抱歉Jen，如果我念错了你的名字。Max Borges Agency，在面向消费者的产品方面非常出色。Greg Delman，他在旧金山，他有一个叫G3 Media的精品公司，他做很多科技初创公司的事情，真的很了解那个圈子。Greg，我会通过Greg找作者，因为他认识所有人。我最近给他发短信说：\"我需要一个能写这个非常具体的AI话题的人。\"他当时正好在TechCrunch Disrupt，他找到了一个自由撰稿人并把我们联系起来。这真的很棒。所以这是四个。我会给你更多的，放在节目注释里。\n\nLenny (00:35:55):\n太棒了。好的。这真的很有用。如果在我们聊天时想到任何其他人，随时再次提到他们。类似的问题，当人们考虑要追求哪些出版物时，比如你是一个初创公司创始人。你能分享一个清单吗，就像，这里可能是你应该考虑的前五到十个？显而易见的，你提到了Entrepreneur（创业家杂志），Inc.（公司杂志），TechCrunch显然会想到。还有其他的吗，就像\"这是一个很好的起点清单\"？\n\nJason Feifer (00:36:19):\n老实说，这真的很大程度上取决于你想要做什么。你可能是一个初创公司创始人，Entrepreneur、Inc.和Fast Company（快公司）可能出于某种好的理由不在你的清单顶部，因为你是一个初创公司创始人，但你现在的目标是接触消费者。而这些出版物不接触消费者，也不接触处于购买心态的人。它们接触的是处于创造心态的人。所以我预期，如果你有一个初创公司，而这个初创公司在某种程度上不是B2B（企业对企业）的，那么商业出版物现在可能不是你的目标，这可能是非常合理的。也许Men's Health（男性健康）才是。也许，我不知道，可能是任何东西。我认为人们往往对自己应该出现在哪里的想法太局限了。Lenny，这里有一个真实的交流案例，就是如果有人给我发邮件，我不会回复每个公关人员。\n\n(00:37:23):\n这简直是不可能的。我一天没有足够的时间。我确实尽力回复每个联系我的创业者，因为我觉得他们应该得到回复。有时候有人给我发邮件，发给我一些东西，但就是不相关。我会回复说：\"嘿，谢谢。恭喜你建立的成就。但这不适合Entrepreneur。\"也许每个月会有一次，有人回复得很不客气，他们会说：\"但是你不是写创业者的吗？我是一个很棒的创业者成功故事。\"就像，不，那不是我们做的。是的，创业者会在我们的故事中出现，但不，我们不只是创业者的目录。这里有一个很好的思考方式。如果你有一个初创公司，你想弄清楚应该出现在哪些出版物上，去看看你的竞争对手在哪里被报道过。这是一个很好的起点。他们在接触什么受众，他们是如何做到的？这应该给你一些关于你下一步可能想去哪里的方向。\n\nLenny (00:38:33):\n很棒的建议。关于TechCrunch，你对是否值得投资在TechCrunch上获得报道有什么看法吗？\n\nJason Feifer (00:38:40):\n我会告诉你一个个人新闻报道历程的时刻，然后我认为它会转化为TechCrunch的答案。\n\nLenny (00:38:47):\n太棒了。\n\nJason Feifer (00:38:48):\n好的。到目前为止我们还没有谈到的是，这几乎是跳过了我们列出的所有步骤，到了你获得新闻报道之后会发生什么。但新闻报道的目的有时是为了接触正在阅读它的人。你在Entrepreneur上被报道，创业者会阅读它，也许会有好事发生。但有时它的目的根本不是为了接触正在阅读它的人。可能只有很少的人会阅读它，顺便说一下，这是一个非常真实的可能性。因为尽管我提到的所有这些出版物，Entrepreneur、Forbes（福布斯）、Fortune（财富）、Inc.、Fast Company，等等，这些都在接触数百万人，他们的网站每个月都有数百万的独立访问者。这并不意味着你的故事会被数百万人阅读。\n\n(00:39:40):\n事实上，这里最大的可能性是你的故事会接触到5到1万人，一小部分人，因为这些出版物正在发布大量内容。所以你可能得到这个故事，它可能看起来很棒，它可能不会接触到那么多人。这也可能是可以的。因为也许在你的逻辑中，为什么要获得那种报道的原因根本不是为了接触那个出版物的受众。也许它真正的目的是发推特，然后花钱推广那条推特，因为这样你就可以针对你想让他们注意到你获得报道的人进行定向推广。\n\n(00:40:21):\n我看到很多人这样做。他们会把我们在Entrepreneur上发布的文章基本上变成广告。这真的很聪明，因为他们从Entrepreneur获得的是社会声望。是市场上的验证。然后他们会自己用它做一些事情。这真的很聪明。你也看到有时获得报道的原因只是为了你可以把它放在你的网站上。\"曾被报道\"。\"曾被报道\"可能比实际上有人阅读那个故事更有价值。他们可能甚至不会阅读这个故事。你甚至可能不需要在网站上链接它。但你可以说\"曾被报道\"。因为再次，它给了你那种验证。\n\n(00:40:56):\n就我个人而言，我正在和我的朋友Nicole Lapin建立一个小型播客公司。Nicole Lapin是一位畅销商业理财专家。我们有一家公司，她是创始人，我是顾问。它叫Money News Network（金钱新闻网络）。我们有一个播客叫Help Wanted（招聘中），我们一起主持。我们在Variety（综艺）上获得了报道。那是敲了很多扇门的结果，最终让Variety的某个人产生了兴趣，他们发布了一篇关于我们的文章。我们从Variety的那篇报道中得到了什么吗？答案是没有，什么都没有。但你最好相信，我们发给每个潜在广告商、每个合作伙伴的每封邮件都包含这个链接。Variety报道了我们。我保证，当有人收到那封邮件时，它会让他们更加关注。\n\n(00:41:52):\n我也多次使用它，当我联系人们时。它只是给了你那种验证。所以有时候你寻找的是一个可以到处展示的奖品。我敢打赌TechCrunch也是如此，这是你最初的问题。为什么要在TechCrunch上发布融资公告？可能不是因为有人会在意，因为他们在TechCrunch上读到了它，而是现在你可以用它来实现你自己的目的。有时候这比新闻报道本身更有价值。\n\nLenny (00:42:16):\n这是一个很棒的见解。它也让你意识到，在花了所有时间在Entrepreneur上发布故事后，你可能不会觉得这是一次成功。就像，哦，什么都没发生。但好处可能会在以后出现，比如几周、几个月、几年后，当你开始分享它时。\n\nJason Feifer (00:42:30):\n完全正确。很多时候这取决于你如何利用它。\n\nLenny (00:42:32):\n太棒了。好的。这非常有趣。好的，让我们谈谈第二步。所以最初你做了准备，我们谈到了如何思考要追求谁以及使命和目标。然后你到了第二步，就是弄清楚应该联系出版物的谁。\n\nJason Feifer (00:42:47):\n对。所以很多人犯的错误是给我发邮件。如果他们想在Entrepreneur上获得报道，他们给我发邮件。我理解他们为什么给我发邮件。真的是出于两个原因。一，我是Entrepreneur最显眼的编辑人员。所以很容易找到我，很容易找到我的电子邮件地址。而且他们只是假设，嗯，主编，做所有决定。但不是的。我的意思是，想想看。如果你在亚马逊上购买的东西有问题，你不会给贝索斯发邮件。他太忙了。我不是在把自己和贝索斯比较。但我是Entrepreneur最忙的编辑人员，不管那值什么。我只是不是应该推销的人，因为我的工作实际上并不真的是选择杂志上的故事。我的工作是与编辑合作，他们提出自己的想法，然后我可以说：\"哦，那个很好，\"或者\"哦，让我们完善一下。\"我不会那么多地寻找素材。所以你真的应该从查看谁在写你的主题领域开始。\n\n(00:43:57):\n你可以通过访问网站并浏览来做到这一点。你可以通过谷歌搜索来做到这一点。但你会找到答案。每个出版物的结构都不同。有些人有特定的领域。有些出版物会说：\"这是负责交通领域的人。\"有些出版物没有。Entrepreneur并不一定有一个领域系统。但如果你看，你会弄清楚。\"哦，那个编辑显然对食品感兴趣。那个作者显然对食品感兴趣。他们似乎写了所有的食品故事。\"再次，一个好方法是从出版物开始，然后看看他们如何报道你的竞争对手。所以一个很好的例子是，我曾经为一个有趣的花生酱公司的人做咨询。就像想象花生酱遇到Ben and Jerry's（本杰瑞冰淇淋），所以它就像有很多东西和有趣名字的花生酱。所以他试图弄清楚如何获得新闻报道。最初他的想法，他联系我的原因是因为他说：\"嗯，我是一个创业者。我经营一家企业。我应该出现在Entrepreneur上。\"\n\n(00:45:05):\n我说，\"不，不，不，你不应该这样做，因为我们的读者不会去买你的花生酱。那么你的目标受众是谁？谁在买你的产品？\"他说，\"千禧一代妈妈。\"我说，\"很好。好的，那么Cosmo（时尚杂志）是个接触她们的好地方。那我们来看看Cosmo是如何报道零食的。\"我不知道他们怎么报道零食。我不看Cosmo，但我们可以去了解一下。这并不难。我去了cosmopolitan.com网站，搜索零食。我立即发现很多文章基本上都是合集形式的，并且与一些时效性的事物相关联。比如\"情人节10大零食\"，\"我们最喜欢的10款秋季新零食\"，诸如此类。所以现在我们知道他们不会为你的花生酱公司发一篇一千字的专题报道。相反，你能期待的最好结果就是被列入这些季节性合集中的一个。\n\n(00:45:59):\n那么下一步，谁在写这些文章？我们来看看。我们打开一些文章。署名就在那里。你可以点击署名。你可以看到这个人是做什么的。在很多情况下，也许他们是美食编辑，也许他们是生活方式编辑，等等。你会看到他们报道什么内容。然后你就会很好地理解现在应该如何定位你想要的东西。现在，让我介绍另一个可能的选择。他们根本不为这个出版物工作。他们是自由撰稿人（freelancer）。出版物使用很多自由撰稿人。自由撰稿人基本上是独立承包商。他们是有时工作的作家。有时他们与出版物有长期合作协议。有时只是一次性的。我妻子就是一名自由撰稿人。我妻子是一名自由撰稿人，经常为《纽约时报》、《华盛顿邮报》和《卫报》撰稿。我妻子和我之间有趣的区别在于，我妻子，她的名字叫Jen Miller，我就不一直说\"我妻子\"了。\n\n(00:46:58):\n所以Jen，作为自由撰稿人，日常工作中对故事的渴求比我更强烈，因为Jen必须为了生计而奔波。Jen必须寻找故事，并将这些故事推介给出版物的编辑，这样她才能获得报酬。所以她实际上比我更有动力去寻找故事，因为我是《创业家杂志》（Entrepreneur Magazine）的受薪员工。我的电子邮件地址很容易找到，人们一直给我发东西。我还要补充一点，请注意，一个好的记者、一个好的作家实际上并不会坐在那里想着他们的工作就是等待人们向他们推介，然后他们就可以只写最好的推介内容。他们认为自己的工作是去为受众寻找最有用的东西。他们喜欢自己做很多这样的工作。所以他们不会坐在那里只等你的推介。事实上，你的推介必须克服他们自己去寻找东西的本能。\n\n(00:48:02):\n所以Jen一直在奔波。Jen一直在与人交谈。Jen对世界充满好奇，会花很多时间追踪事物。但如果有人读了她写的一篇文章，然后说，\"啊，我想我知道这个人对什么感兴趣，\"然后找到她的电子邮件地址，再给她发邮件，Jen收到的推介比我少得多，她阅读的可能性接近百分之百。如果这与她为之撰稿的任何出版物相关，她认真对待的可能性比我高得多。所以有时联系正式员工实际上并不是你的最佳选择。找到正在做这项工作的自由撰稿人有时是更好的选择。\n\nLenny (00:48:43):\n你分享了很多有趣的战术性见解。我很喜欢。关于这个自由撰稿人的技巧，你如何知道他们是自由撰稿人？署名里有什么提示吗？\n\nJason Feifer (00:48:51):\n如果你在出版物的网站上找到他们，比如说你去Cosmo，点击作者的简介。如果他们是正式员工，会写\"员工\"（staff）。如果他们不是员工，可能会写其他内容。可能会写\"作家\"（writer），可能会写\"撰稿人\"（contributor）。可能会写\"Jen Miller是纽约布鲁克林的一名作家\"。但你也可以再多走一步，直接谷歌他们的名字，因为任何聪明的自由撰稿人都有一个作品集网站，应该很容易找到。\n\nLenny (00:49:22):\n太棒了。\n\nJason Feifer (00:49:23):\n所以有时只需要输入他们的名字，在谷歌上搜索，你很快就能弄清楚他们是谁。\n\nLenny (00:49:28):\n好的，让我总结一下到目前为止你教给我们的东西。一是考虑那些面向会购买你产品的人的出版物。所以在你的例子中，Cosmo是一个很好的例子，它的读者会购买这种花生酱。二是不要把它想成一个宽泛的事情。要想到这个出版物里的作者。所以不是\"Cosmo会写这个\"，而是\"Cosmo的谁具体会写这个？\"我们通过去他们的网站找到这个人，搜索，你提到搜索你的竞争对手，但我认为甚至更广泛，只是搜索与你领域相关的东西，对吧？\n\nJason Feifer (00:50:01):\n是的，这是个好观点。搜索你的类别。\n\nLenny (00:50:04):\n甚至相邻的东西可能也足够接近。然后关于自由撰稿人的这个建议真的很棒，他们更渴求故事，他们更有可能回应你的推介，而不是在那里工作的人。还有这一点，他们的假设是这不是一个好的推介，他们不想要你的推介。但自由撰稿人有更高的机会感兴趣并会关注。\n\nJason Feifer (00:50:25):\n是的，自由撰稿人要吃饭。\n\nLenny (00:50:28):\n太棒了。在找到出版物的某个人这一步，还有什么你想分享的吗？\n\nJason Feifer (00:50:36):\n嗯，下一步将是如何实际联系他们并推介。所以在这个阶段，我认为我们已经相当全面地涵盖了。我喜欢你的总结。让我再强调一下其中的部分内容，你做这么多工作的原因不仅仅是为了这些繁琐的工作。而是因为你必须理解媒体……让我们回到翻译媒体这个话题。媒体，这个以各种不同方式使用的短语，实际上是理解媒体的一个相当糟糕的方式，因为\"媒体\"让人感觉它是一个统一的实体。在政治中，媒体会被批评为某种方式串通在一起的多个出版物。但我们谈论它的方式只是作为你试图接触的组织。\n\n(00:51:25):\n但真正地，这些只是由个人组成的出版公司。这些个人都在对他们要写什么做出相当主观的决定。而且他们必须通过多层审批。所以没有什么东西能在没有我说同意的情况下进入印刷杂志。但我也信任我的编辑对他们找到的想法充满热情，并说服我同意。所以你真正要做的事情是找到进入出版物的方法——\n\nJason Feifer (00:52:00):\n你真正要做的事情是找到进入出版物的方法。因为在出版物的某个人对你产生足够的兴趣，然后去找另一个人说\"我认为这会是一个好故事\"，而另一个人说同意之前，什么都不会被报道。\n\n(00:52:17):\n所以你必须找到你的入口。因为媒体不是一个协调一致的努力。它是一群人每天出现，试图弄清楚如何为他们的受众制作最好的东西。\n\nLenny (00:52:27):\n太棒了。好的，这是一个很好的过渡到最后一部分，那就是实际上让某人感到兴奋并写你。\n\nJason Feifer (00:52:33):\n那我们怎么做呢？\n\nLenny (00:52:33):\n我们怎么做呢？\n\nJason Feifer (00:52:36):\n这就是橡胶接触路面的地方，好吗？所以不要做的事情，不要给他们打电话，如果你找到了他们的电话号码。这是真实发生的事情。人们打我的个人手机号码。\n\nLenny (00:52:48):\n哦，哇。\n\nJason Feifer (00:52:48):\n这种情况不常发生，但确实发生。我甚至不知道他们从哪里得到的。但我不喜欢这样。\n\n(00:52:53):\n媒体人对于通过社交媒体私信（DM）联系是否是一种可以接受的方式存在分歧。我觉得它们有点烦人。因为，第一，这种格式不太适合，对吧？如果你在私信里写错了什么，它看起来就像我收到的这个无休止的东西。\n\n(00:53:13):\n但同时，我不知道，我的Instagram私信，我只是不认为那是被推介的地方。但其他人不在乎。所以我不知道，你可以试试运气。\n\n(00:53:21):\n电子邮件只是最传统的方式。如果你知道某人将在会议上演讲，那很好，过去，你可以和他们交谈。但问题当然是，你要给他们发什么？这就是你要发给他们的。\n\n(00:53:34):\n你真正发给他们的是你在前两个步骤中所做工作的产物。因为你现在已经花了一些时间思考你的故事，以及你要推介的对象，以及出版物，以及他们如何向受众讲述故事。\n\n(00:53:51):\n然后你要联系的那个人，你现在对他们如何写这个有了一些了解。你要把所有这些汇总起来，试图将它提炼成一个他们会觉得有吸引力的呈现。\n\n(00:54:02):\n再次回到媒体报道与出去融资并没有太大区别这一点，当你去见投资人时，你也在做类似的事情。\n\n(00:54:12):\n如果你与10个投资人开会，你与这10个投资人谈论自己和公司的方式不应该完全相同，因为他们都会有些许不同的方法和不同的理念。\n\n(00:54:25):\n你不是要欺骗任何人，但你只是试图通过整合你对他们做什么、他们的公司做什么的了解，尽可能地定制化。对于媒体也是如此。\n\n(00:54:35):\n所以所有这些在其最传统的意义上，将采取一封简短电子邮件的形式。一封简短的电子邮件推介。那看起来像什么？我的意思是，看，对此真的没有神奇的答案。我希望有，但没有。没有格式。人们总是问我，电子邮件的主题行应该是什么？\n\n(00:55:00):\n这是一个好问题。对此没有一个答案。我能给你的最接近答案的是，想象我。想象我在我的电脑前。我有很多事情要做，我在浏览我的电子邮件，40封新邮件摆在那里。我的本能是尽快删除所有邮件，但我会浏览每一封。\n\n(00:55:23):\n我不会打开每一封，但我会浏览它，这意味着我看到主题行和预览文本，或者只是某人写的第一件事。你想做的是写一些让我很清楚这是针对我的东西。这是第一步。\n\n(00:55:40):\n因为我收件箱里的大多数邮件都不是针对我的。它们是群发邮件，我会删除、删除、删除、删除、删除。那么哪一封实际上是针对我的？有时你可以通过引用我过去写的东西来做到这一点。我看到人们经常这样做。不要伪造。人们一直在伪造。人们给我发邮件说他们是我作品的粉丝，他们从未读过我的作品。这非常明显，对吧？不要这样做。但如果你读过某些东西，或者如果你以某种方式熟悉某些东西，如果你以某种方式熟悉这个出版物，任何这样的信号都是好的。\n\n(00:56:15):\n因为再说一次，你要做的就是把自己从噪音中区分出来，让你的信息是为对方定制的。因为如果你仔细想想，这其实是一个效率问题。我要做的是，我想把时间花在那些最有可能与我相关的事情上。我要过滤掉那些看起来与我无关、浪费我时间的东西。\n\n(00:56:41):\n所以如果我看到有人给我写信，他们了解这个出版物，也了解我，那么他们接下来要告诉我的内容与我相关的可能性就更高。甚至可能发展成一篇报道。\n\n(00:56:53):\n这很好。我喜欢这样的情况。因为坦白说，这能节省我的时间，对吧?这样我就少了一个需要自己去寻找的故事。所以我很乐意接受，但它必须是对的。所以你要构思好……然后你写的邮件不要没完没了，最多三段。\n\n(00:57:09):\n你要讲述的是那个版本，你不是在写一篇文章，而是告诉我你非常确定我会感兴趣的事情。区别在于，回到黄油碟的例子，那位女士给我发了一封三段的邮件，全是关于黄油碟本身的，而另一种方式是，开头稍微介绍一下黄油碟，然后立即转入这个非常聪明的产品市场测试调查的故事。\n\n(00:57:43):\n这就是区别。她告诉我的是会与我的受众相关的故事。她很快切入主题，而且在我看来，这是一个有趣的人，有一个有趣的创业故事要讲，这就是我会参与的原因。\n\nLenny (00:57:57):\n所以那个故事实际上是通过一封冷邮件(cold email)发来的?\n\nJason Feifer (00:58:00):\n那是一封冷邮件。是的。就是有一天突然出现的。\n\nLenny (00:58:02):\n太棒了。\n\n(00:58:04):\n本期节目由Eppo赞助。Eppo是一个下一代AB测试平台，由Airbnb校友为现代增长团队打造。像DraftKings、Zapier、ClickUp、Twitch和Cameo这样的公司都依靠Eppo来支持他们的实验。\n\n(00:58:18):\n无论你在哪里工作，运行实验都变得越来越重要。但是没有商业工具能够与现代增长团队的技术栈集成。这导致浪费时间构建内部工具，或者试图通过笨重的营销工具来运行你自己的实验。\n\n(00:58:30):\n当我在Airbnb工作时，我最喜欢的事情之一就是我们的实验平台，在那里我能够按设备类型、国家、用户阶段来切分数据。Eppo能做到所有这些甚至更多，快速交付结果，避免恼人的漫长分析周期，并帮助你轻松找到你发现的任何问题的根本原因。\n\n(00:58:49):\nEppo让你超越基本的点击率指标，转而使用你的北极星指标(north star metrics)，如激活率、留存率、订阅和支付。Eppo支持前端、后端、电子邮件营销，甚至机器学习客户端的测试。访问Eppo网站geteppo.com。就是geteppo.com，将你的实验速度提升10倍。\n\n(00:59:11):\n还有其他做得好的例子吗?让人们有更多的例子参考，比如这里有……\n\nJason Feifer (00:59:17):\n哦当然。好吧，我们来看看。我们得实时做这件事。但我在收件箱里保留了一个文件夹叫\"糟糕的PR推介\"和一个文件夹叫\"优秀的PR推介\"。我们可以两个都看看。\n\nLenny (00:59:28):\n来吧。\n\nJason Feifer (00:59:29):\n好的，我刚把它调出来。这个，我已经很久没读过了。我一边说一边试着提前读一下，看看是否适合读出来。但我觉得可以。我不知道，管它呢。我们就读一下，看看会发生什么。\n\n(00:59:42):\n好的，所以这封邮件的主题是，\"给企业家和问题解决者的想法：边境关闭如何让我的生意增长。\"这是在2020年9月发给我的。\n\nLenny (00:59:54):\n这是好的还是坏的?\n\nJason Feifer (00:59:56):\n这是好的，这是好的。这最后变成了我为《企业家》做的一个播客节目，我可能还把它转换成了一篇文章，我记不清了。\n\nLenny (01:00:06):\n太棒了。\n\nJason Feifer (01:00:08):\n所以她是这样做的。她的名字，我要为她宣传一下。这是Meg O'Hara。Meg O'Hara是一名画家，一位加拿大风景画家。再次强调，是一个小企业。\n\n(01:00:21):\n她写道，\"嗨Jason，我有一个故事想法，我认为对你、《企业家》杂志和《问题解决者播客》(Problem Solvers Podcast)都会有价值和相关性。\"那是我为《企业家》做的节目。然后她说，\"这是我的生意发生的事情。所有企业家在新冠疫情期间都必须灵活应对。这是一个关于加拿大一位艺术家如何从边境关闭中受益的故事。\"这让我很感兴趣。哦，怎么做到的?\n\n(01:00:42):\n\"当新冠疫情在3月来袭时，北美所有滑雪胜地都提前关闭了。滑雪者是加拿大的高收入人群。他们属于收入前5%。\"\n\n(01:00:53):\n好吧，不管怎样。所以她继续说。她告诉我的，我现在想起来了，她告诉我她的生意过去是被滑雪胜地聘请去为他们的设施绘制风景画。当边境关闭，人们不再去这些度假胜地时，她必须想出一个完全不同的方式来经营她的生意。\n\n(01:01:15):\n所以她开始思考，好吧，我不能再为这些度假胜地工作了。他们不雇我了。但所有那些曾经在度假胜地工作、见过我作品的滑雪者，或者曾经在度假胜地滑雪、可能熟悉我作品的人，他们现在也不滑雪了。他们可能坐在那里，希望自己在滑雪。他们会喜欢看到他们最喜欢的滑雪地点的东西，而且他们也有闲钱，因为他们没有把钱花在滑雪胜地上。\n\n(01:01:39):\n然后她用要点列出了问题和解决方案。我很喜欢这个。因为她听过这个节目，《问题解决者》节目，正是以这种方式组织的。告诉我问题，告诉我你想到的解决方案。所以她列出来了。\n\n(01:01:53):\n问题是:滑雪者不能来了，人们在家里待的时间更多了。\n\n(01:01:56):\n解决方案:我为他们的家创作艺术品，描绘他们最喜欢的滑雪景色。她继续说下去。\n\n(01:02:03):\n我读到这个，我只是想，这个人在一个市场关闭的时候，为了重塑自己的生意所做的事情是有价值的，但它创造了一个新的市场，我认为人们会喜欢听。因为在那个时候，每个人都在思考如何重塑自己和自己的生意。\n\n(01:02:21):\n即使我接触的是那些拥有非常复杂和大型企业的人，有时候听一个做世界上最简单的事情的个人——就是把颜料涂在画布上——谈论她是如何为自己做到这一点的，这真的是一件美好的事情。因为你可以从中提取出这些关于如何重塑自己的美妙小教训，我认为这些教训与非常广泛的受众相关。\n\n(01:02:44):\n所以Meg给我发了那封邮件，我回复说，\"我喜欢。\"然后我们就做了。所以这是一个很好的例子，说明有人花时间了解我的工作，深入到我如何沟通的结构，然后给我发了一个推介，非常快速和清晰地看起来是为我定制的，并以一种我可以想象告诉我的受众的方式告诉我她的故事。\n\n(01:03:12):\n在那种情况下，答应是相当容易的。\n\nLenny (01:03:14):\n这是一个很棒的例子。根据你过去分享的内容，我刚刚记下了她做对的一些事情。\n\n(01:03:19):\n即使只是从主题行或第一句话，就很清楚她了解你。她知道你有这个播客，她知道这本杂志，她甚至明确表达了这一点，你会对此感兴趣。她提到了这个故事。她立即从故事开始。没有公司的价值主张，这是我们做的，这是我们为什么很棒。然后是教训，你谈到的《企业家》的使命，是人们获得的见解和教训，她直接切入到这里是我们学到的。\n\nJason Feifer (01:03:49):\n没错。\n\nLenny (01:03:50):\n所以我能理解为什么会产生共鸣。\n\nJason Feifer (01:03:51):\n是的，这很棒。顺便说一下，接下来让它对她来说真正成功的事情是，一旦我让她接电话，她，我发现这个，这对我来说是成败的关键。因为我可以和某人交谈，然后取消这个故事，或者不播放这个播客。她愿意坦诚面对挑战。\n\n(01:04:17):\n我的意思是，她主动联系就是因为挑战，但不是每个人都这样。我会收到某人的推介，表现得好像，哦，我们在生意上遇到了这个挑战。但是当我和他们交谈时，他们表现得好像没有问题。或者问题真的很小，他们的聪明才智立即让这成为一个非常成功的生意。这对我来说不有趣。\n\n(01:04:42):\n因为成功故事不有趣。对任何人都不有趣。仅仅听到别人成功对你来说没有用。有用的是你听到别人如何面对你面对的挑战。并克服它们，这样你就能看到。啊哈，这是一个对我来说有趣的策略。\n\n(01:05:01):\n我讨厌成功故事。我喜欢问题解决故事。这就是为什么当我和企业家交谈时，我期望他们对这些东西真正开放。如果他们不这样做，我基本上就失去兴趣了。\n\nLenny (01:05:13):\n英雄之旅。我很想听另一个例子。但在那之前，听到这个，显然对于创始人来说，这需要花费大量时间。我想，两个问题。就是，有人应该尝试联系多少地方才能给他们成功的机会?然后你对他们应该在这样的事情上投入多少时间有什么想法吗?我知道这是一个非常宽泛的问题。但是，有什么想法吗?\n\nJason Feifer (01:05:35):\n是的,这是一个非常宽泛的问题。所以再次强调，这在某种程度上，在很大程度上，是为什么很多人雇用PR的原因。因为PR可以推进这个过程。他们可以非常快地接触到很多人，而你作为个人不能。\n\n(01:05:51):\n一种思考方式是，你要去寻找。你要试着让这个工作，你要做几次尝试，希望其中一些能有回报。\n\n(01:06:01):\n另一种思考方式是，这是一个被动的活动。当我在阅读媒体时，我会花一些时间思考这个，有点像发展一个想法。你还可以做的另一件事，在社交媒体上关注一堆作家和编辑。\n\n(01:06:20):\nMeg，我记不清这里的操作顺序了，因为我知道Meg现在在Instagram上关注我，因为她给我发过很多次私信。我会回复每个人。我记不清她之前是否关注我，但她可能关注了。也许她甚至给我发过几次私信。通常是有人在回应Instagram故事之类的。\n\n(01:06:38):\n我看到很多人对我使用这种策略，我认为这是一个非常聪明的策略。基本上就是，在你推介之前，只是让我认识你的名字。只是以一种非常随意的方式在社交媒体上互动，这样当你给我发邮件时，我会想，我知道那个人是谁吗? Meg O'Hara，我想我知道那个人是谁。这只是让我更有可能打开邮件。\n\n(01:07:08):\n我看到很多人都这么做。他们会花很长时间在社交媒体上与我互动，然后才向我推销。我知道他们在做什么，我明白这可能是精心算计的。但我仍然喜欢这样。这很聪明。因为这意味着当他们联系我的时候，我认为你对我的工作已经有了相当好的了解。这意味着你带给我的东西很可能是出于真诚的。因此，我喜欢这样。这是一个很好的筛选方式。\n\n(01:07:36):\n所以如果你一直在听这整个内容，你会想，这是一项巨大的工作量，我有一个新产品发布，或者我有很多预算可以花在这上面，这种个性化的方法可能不适合你。你可能想花大量时间去面试不同的公关公司。找到一家看起来最符合并理解你的故事、你的愿景，并且认识你所在领域的人的公司，这可以省去很多这样的麻烦。\n\n(01:08:06):\n但即便如此，即便如此，我认为听到这些内容真的很有用。因为在某个时候，如果公关人员成功了，你将会与作者或编辑通电话。理解他们的想法非常有用。他们不是来为你服务的。这不是他们为你提供的一项服务。\n\n(01:08:27):\n所以你最好理解他们带着什么进入这个过程，以及他们心中在想什么。当他们向你提问时，他们提问时会想，这是我的受众会好奇的内容。这就是我在这次采访中如何引导这个人朝着我的受众会觉得满意的那种见解方向前进。\n\n(01:08:44):\n所以你越了解你在和谁打交道，就越好。\n\nLenny (01:08:48):\n而且即使你自己做过，你也会更好地理解该问你的团队什么，他们将如何工作，找到改进他们运作方式的机会。关于数量这个问题，假设你在做这件事，假设你在花时间。我真的要投入精力去了解Jason和其他人。\n\n(01:09:05):\n有什么经验法则可以推荐吗?尝试为三家出版物做这件事才能得到一家,还是五家?我不知道。在这方面你有什么可以推荐的吗?\n\nJason Feifer (01:09:14):\n所以这真的取决于你有多容易被报道。我可能只是指出，如果你是某种B2B服务，特别是在某种非常小众或专业的领域，你真的很难获得[听不清 01:09:40]的报道。如此之难，以至于可能实际上甚至不值得尝试。因为还有其他你可以做的事情，或者我们甚至还没有谈到的事情。\n\n(01:09:46):\n你可以说，你知道吗?算了。我不打算试图为我的公司获得报道。为什么我不试着把自己定位为专家呢?对吧?这是一种完全不同的方法。相反，你可能试图做的只是抓住新闻，试图向可能正在写某事的记者提供一个引语或观点。我经常收到这些。\n\n(01:10:07):\n有新闻爆出，一些新闻爆出，人们开始联系我。他们会说，\"新闻中刚刚发生了这件事。我的客户，\"或者有时只是个人，\"我对此有这样的见解，如果你想采访我，我会这么说。\"\n\n(01:10:22):\n这不会是关于你的专题报道，你不会是主题，没有你的照片。你可能会得到一个引语。你可能会在一个故事中得到一个引语。同样，这就是你需要能够在你的网站上说\"曾被报道\"的全部内容。所以这就是人们这样做的原因。\n\n(01:10:33):\n所以有时候是这样的。有时候你可以只是一个作家。你可能会尝试向不同的出版物投稿由你撰写的权威文章。以这种方式让自己出名。有时，你不会容易被报道。有时你会。有时你制造了一些疯狂的技术，每个人都会谈论它，你获得媒体报道会超级容易。\n\n(01:10:56):\n在这种情况下，你的命中率会高得多。这就是为什么进入这个过程时要有非常现实的期望，如果你要与公关合作，拥有能够设定并让你保持这些现实期望的公关，可以为你省去很多心痛。\n\nLenny (01:11:12):\n同样的思路，总是有这种独家的想法，人们想要首先报道一件事。假设你谈到了一项很棒的技术。你有什么建议吗，你是向所有人推销同样的东西并希望他们都报道它吗?你向他们推销不同的故事吗?你会给一家提供独家吗，在这方面有什么建议吗?\n\nJason Feifer (01:11:29):\n每个人对此都有不同的方法。这里的首要规则是，不要以一种让媒体人觉得你在耍他们的方式去做。因为他们不会容忍这种行为。我宁愿放弃这样的事情，也不愿和某人跳一些滑稽的舞蹈。\n\n(01:11:48):\n所以我最喜欢的版本是这样的。实际上，最近有一位创始人，我几年前见过他。所以当他联系我时，我立即认出了这个名字。他联系我说，嘿，我们做了一件非常有趣的事情，我们还没有告诉任何人。我想看看它是否适合《创业家》(Entrepreneur)。\n\n(01:12:10):\n所以我和他通了电话，他告诉了我。我不会告诉你那是什么，因为我们还没有发表这个故事。但是15、20分钟后，我说，是的，你知道吗?这是一个非常有趣的故事。\n\n(01:12:20):\n坦率地说，我知道其他媒体也会对此感兴趣，特别是因为它有金融元素。所以我认为《华尔街日报》(Wall Street Journal)、彭博社(Bloomberg)和那些地方会对此感兴趣。\n\n(01:12:32):\n无论出于什么原因，他想去《创业家》。我的意思是，我认为可能有两个原因。第一，因为他想将自己定位到那个受众。然后第二，有一个信任因素。他以一种不同于他不认识那边编辑的方式认识我。所以他觉得我可能会更谨慎地处理这个故事。\n\n(01:12:49):\n所以我们达成了一个协议，这是他提出的。协议是我们将获得独家报道，我们的故事发表后会有三个小时的窗口期，然后他们将开始回应其他所有人。然后他们将开始与其他人交谈，或者他们甚至可能会安排好并联系一些其他媒体。\n\n(01:13:10):\n我对此没问题。我理解。我们将创建一个小的禁发期窗口。我们将首发，然后他们将与其他所有人交谈。\n\n(01:13:21):\n有时你可以向某人提供独家报道，即你将向所有人发布新闻，但只有一家媒体将获得采访。如果你有一个大人物，这种方式效果非常好。\n\n(01:13:35):\n例如，最近Mark Cuban投资的一家公司向我们提供了这个，对吧?他们说，我们有这个新闻。我们会联系，我们会把新闻发送到各处，但我们会给你与Mark Cuban的独家采访。他将只做一次采访，他会和你做。你可以以任何方式解析它。你只是希望每个人都觉得你对他们很坦诚。\n\nLenny (01:13:57):\n并且他们得到了一些特别的东西，尽可能多。这是有道理的。\n\n(01:14:02):\n你提到了这个关系部分，这是我想问的。感觉在科技领域，很多记者最终会写负面故事，因为很多时候那是人们想读的。为什么这正在摧毁世界?\n\n(01:14:14):\n实际上《快公司》(Fast Company)对我做了一件事，我和记者交谈，我完全不知道。他会完全撕碎我吗，还是他会对我正在做的事情非常友好和积极?我不知道，然后它就出来了。\n\n(01:14:24):\n我不会在它出来之前看它。所以你有什么建议可以帮助判断这是否会变成积极的还是负面的?我知道你不知道\n\nJason Feifer (01:14:34):\n顺便说一下，发生了什么?是积极的还是负面的?\n\nLenny (01:14:35):\n超级积极。\n\nJason Feifer (01:14:35):\n太好了。\n\nLenny (01:14:37):\n我对此很满意，是的。\n\nJason Feifer (01:14:38):\n好的，好，好。我很高兴听到这个。\n\n(01:14:40):\n所以部分原因是出版物本身，对吧?《创业家》，我会说《快公司》，就是不做负面故事的。原因是，它不服务于我们的受众。我的受众来找我是为了学习他们业务的东西。撕碎某人根本不会以任何方式帮助他们。\n\n(01:14:59):\n所以部分原因只是你在处理什么生态系统?你也可以看看作者过去的作品。如果你与公关人员合作，这很有趣，因为偶尔有人会不小心把这个转发给我，我会看到公关机构为我准备的档案。\n\n(01:15:17):\n但是公关机构，如果他们为你安排与某人的采访，他们通常会做一些调查。他们会发现，这个人通常写什么?他们做什么样的故事?他们通常对什么感兴趣?所以你可以有一个感觉，对吧?他们在做什么样的事情?\n\n(01:15:33):\n除此之外，还有一个问题，嗯，你在世界上做什么，对吧?我的意思是，如果你有一些有争议的东西，特别是如果你与一家对那种东西感兴趣的媒体接触，他们至少有相当大的机会会与你一起探讨它，并问你关于它的问题。如果你很奇怪和闪烁其词，他们会认为有更多内容，他们会开始挖掘更多。\n\n(01:16:03):\n但这里的最终答案是，这个过程的每一部分，这已经在我们整个对话中体现出来了，这个过程的每一部分都真的超出了你的控制。有人关注你吗?他们写什么关于你?他们什么时候写?所有这些都在你的控制之外，\n\n(01:16:23):\n再说一次，这就是为什么把媒体报道作为推动增长的主要策略并不明智的原因。这是一个很好的附加项，但这些人会做他们要做的事。你能做的最好的事就是解读茶叶占卜的迹象。\n\nLenny (01:16:37):\n是的。这是一个非常奇怪的...我不经常获得媒体报道，这不像是我追求的东西。但就像，这太疯狂了。我只是要和这个人谈谈，然后会有东西出来。我完全不知道那可能是什么。\n\n(01:16:46):\n他可能会弄错一些事情，因为我没有机会审阅，可能会歪曲事情。但这是一个奇怪的经历。但一切都进展得很好。\n\nJason Feifer (01:16:55):\n是的，确实。这很奇怪。\n\n(01:16:58):\n确实，很奇怪。我发现人们经常不...在商业中，人们理解正在发生的事情的结构。他们明白我们是一本商业杂志，我们将写一个关于企业的故事。它会采取某种形式。\n\n(01:17:14):\n但我做过很多不同的写作，在我的职业生涯中我有过很多次这样的经历，我会花很多时间与人们在一起，他们根本不理解我在做什么。他们无法将其概念化。\n\n(01:17:30):\n然后故事会出来，然后他们总是会联系我，他们会说，哦，现在我终于明白你试图做什么了。这很迷人。\n\n(01:17:40):\n这是一次让人感到脆弱的经历，你必须清楚这一点。你越想控制它，记者就会越对你感到厌烦。实际上，记者可能会因此在报道中对你发起攻击。因为他们觉得你控制欲太强，因为他们觉得你...\n\nJason Feifer (01:18:01):\n他们觉得你控制欲太强，是因为他们觉得你有所隐瞒。这不是一件让人舒服的事。你必须抱着脆弱的心态进入这个过程，你必须知道这有可能会搞砸。这就是你为了接触他们的受众所付出的代价。\n\nLenny (01:18:19):\n很好的建议。我们再举一个你收到的很棒的邮件推介例子，然后进入我们非常激动人心的快问快答环节，怎么样？\n\nJason Feifer (01:18:26):\n我来跟你说一个推介。我不知道我的收件箱里还有没有，有吗？不，很遗憾没有了。我就直接说吧。\n\nLenny (01:18:32):\n好的。\n\nJason Feifer (01:18:33):\n这引出了另一种获得媒体报道的思考方式，我认为这对人们来说非常重要。到目前为止，Lenny，我们大部分时间都在谈论以某种专题报道的形式获得媒体关注，写关于你的内容或以某种突出的方式将你纳入某个故事中，基本上是突出你想要传达的东西，你的产品或关于你业务的某些内容。然后我们稍微谈到了另一种方式，就是把你作为专家和权威推出去。还有另一种思考方式，那就是你可以创造或呈现一个你恰好参与其中的背景。\n\n(01:19:18):\n这是我收到的那个故事推介。这是很多很多年前的事了。我刚开始在Entrepreneur工作。我收到一个叫Fred Ruckel的人的来信。Fred Ruckel有一个猫玩具，叫做Ripple Rug（波纹地毯）。基本上，想象一块地毯，然后另一块地毯铺在上面，但不太合适。地毯是凹凸不平的，有很多凸起的地方和洞。这是让猫在这些空间里爬进爬出、拍打，做猫会做的任何事情。我不知道。我没养猫。他想告诉我这个Ripple Rug的销售情况，以及销售如何飙升，以及所有他认为让它特别的东西。它是用回收瓶子制成的，美国制造，所有这些很酷的东西，但与我无关，因为我们不是《猫玩具月刊》，我们也没有接触到大量的猫主人，据我所知没有。\n\n(01:20:16):\n我回复说，我通常会说的话：\"恭喜你所建立的东西，但它不适合报道。\"现在Fred偶然发现了这个，但他做了一件非常聪明的事情，因为他的回复是：\"完全理解。如果你有兴趣了解亚马逊和eBay上正在发生的一个巨大骗局，而我们被卷入其中，请告诉我。\"我当时想，\"哦，好吧，是的，我想我确实有兴趣听听这个。\"我说，\"告诉我更多。\"他给我发了一封很长的邮件。Fred喜欢发长邮件，我让他打电话来解释，最后我明白了。\n\n(01:20:53):\n这个，可能有人熟悉，但这被称为Amazon到eBay套利（Amazon to eBay arbitrage）。基本上这个想法是，Fred在亚马逊上销售他的Ripple Rug，至少当时是这样，我不知道他现在是否还在卖，但他在亚马逊上销售他的Ripple Rug。有很多人复制他的Ripple Rug的listing（商品列表），并在eBay上制作自己的发布信息。他们以稍高的价格出售。比方说，我是编的，但假设Fred在亚马逊上以30美元的价格出售他的Ripple Rug，那么有人会在eBay上以40美元的价格出售它。然后有人在eBay上买了它，他们找到它，在eBay上购买，支付40美元，那个人得到40美元，拿出30美元，去亚马逊购买Ripple Rug，然后直接发货给买家。这就是套利。\n\n(01:21:47):\n你可能会想，\"那Fred为什么要在意这个？他仍然得到了销售。\"他在意的原因是，Ripple Rug送到顾客家里，它装在亚马逊的盒子里，即使他们是在eBay上买的。他们想，\"为什么会这样？\"然后他们接下来做的就是去亚马逊，发现它在亚马逊上更便宜，现在他们觉得被骗了。他们觉得谁骗了他们？Fred，因为他们不知道套利的事。他们不知道这些套利者的存在。\n\n(01:22:21):\n这个人此时已经打开了猫玩具，可能让他们的猫在里面打滚了，现在把整个东西塞回盒子里退货，Fred被扣分，这就是他不喜欢这样的原因。他试了又试想让亚马逊和eBay停止这种行为，但他说，\"似乎没有人在乎，所有这些小企业因此在退货上损失了大量资金。\"我从未听说过这个。我觉得这很有趣。这就像小企业主正在处理的问题。我说，\"Fred，你知道其他正在处理这个问题的人吗？\"他说，\"是的，我一直在网上和他们聊天。\"他把我介绍过去。\n\n(01:22:54):\n我把整个事情都报道出来了。我写了一篇三四千字的关于这件事的报道，Fred是主角，因为他是理解这个问题的方式。我做了所有的报道，我联系了这些平台，我联系了制作套利软件的人。我做了整个报告，但Fred得到了他的媒体报道，因为有时候，这就是教训，有时候你不是故事本身，但你可以成为故事的一部分。有时这意味着，如果Fred偶然发现了它，但我会收到很多人的联系，也许他们有一个房地产初创公司，房地产领域正在发生一些非常有趣的事情，他们联系我，告诉我房地产领域正在发生的这件非常有趣的事情，以及他们恰好在其中扮演的角色。现在我想，\"哦，好吧，那很有趣。也许有一个关于这个的故事。\"\n\n(01:23:46):\n我的妻子，自由撰稿人Jen Miller，她做过很多次这样的事，她曾经做过一个报道，有一群初创公司都与帮助人们为死亡做准备有关。她不会只写其中一家，但当有人联系并说，\"嘿，这里有一个正在发生的趋势，我们是其中之一。\"好吧，太好了，这是一个有趣的故事。她写了那篇报道，联系她的那家公司得到了相当显著的报道，因为他们是主动联系的。你知道Shark Tank（创智赢家）的Barbara Corcoran吗？\n\nLenny (01:24:14):\n我想是的。我想是的。\n\nJason Feifer (01:24:15):\n是的。她从一开始就是Shark Tank的常驻评委。\n\nLenny (01:24:19):\n嗯-嗯。\n\nJason Feifer (01:24:21):\n她通过建立一家名为Corcoran的房地产公司发了财，房地产经纪人买卖房产。她建立这家公司的方式很有趣。Barbara，在她成为Corcoran Realty的Barbara Corcoran之前，Barbara Corcoran只是来自新泽西的普通纽约市房地产经纪人Barbara。她试图找出一种方法来将自己与大众区分开来。她想出了一个主意，就是把她自己的销售数据，她当时了解曼哈顿房地产市场的唯一窗口就是她的客户在买卖什么，她在促成这些交易。她有这些数据，相对于去年是上涨还是下跌。她将所有这些数据整理成她所谓的Corcoran Report（科科伦报告），她开始将Corcoran Report发送给《纽约时报》、《纽约邮报》等等。\n\n(01:25:18):\n因为当时没有其他人在整理关于曼哈顿房地产市场健康状况的报告，每个人都开始报道Corcoran Report，就好像它是权威的东西。它是由Barbara Corcoran制作的，这立即让她处于这个领域的权威地位。这非常聪明，我经常看到这种情况发生。\n\n(01:25:37):\n我的收件箱也会充满，例如，一家专门从事远程工作咨询的公司。特别是远程工作咨询，你可以雇用他们，这是B2B服务。这很难获得媒体报道，他们是这样做的。他们付钱给一家调查公司去找各种各样的东西。远程工作的顶级州，远程工作的顶级公司，远程工作的顶级什么什么。他们制作所有这些调查，然后把调查发出去。这些调查会被报道，因为现在他们正在创造一条新闻。他们正在创造一个他们恰好存在于其中的背景。很难写关于他们这家普通公司的报道，但你写关于调查的报道，那是有趣的东西。哦，原来犹他州是，我不知道这是不是真的，是远程工作的顶级州，这是人们会写的东西。你在给人们提供可以写的东西。然后一旦他们这样做，你就成为故事的一部分。我一直收到这样的推介。我偶尔会接受它们，Fred从Ripple Rug因此得到了一个大专题报道。\n\nLenny (01:26:38):\n这是另一个很棒的策略。我想如果我是创始人，我会想，\"嗯，我能想到什么趋势可以利用？\"\n\nJason Feifer (01:26:44):\n是的。有时候你自己的数据里就有。如果你有很多数据，你可能，Zapier。Zapier是一个很好的例子。我每年都会收到Zapier关于基于Zapier数据的年度增长最快的商业应用程序的推介，因为他们看到人们在使用什么，他们只是将其编译成一个前10名列表，人们会发布它。这非常聪明。\n\nLenny (01:27:09):\n太棒了。我们已经完成了所有三个步骤。还有什么你想谈的我们还没有谈到的吗？还有什么你认为对试图获得媒体报道的创始人或产品负责人非常有价值的东西，我们还没有分享的吗？\n\nJason Feifer (01:27:23):\n这在不同的方面都有提到，但我只想强调一下，作为思考这个问题的最后方式。做人，做人。新闻稿不起作用，因为它们不人性化。我不喜欢采访那些在谈话要点上的人，因为那不人性化。你最终是在从事人类的业务。一个主观的决定正在被做出，关于如何服务人类受众。没有对错。没有办法知道。媒体是一个某种程度上几乎不依赖数据驱动的行业，因为每个故事都有点不同。这就像很难。很难优化产品，因为产品每分钟都在变化。你在与人打交道，在这个过程的每一步中，你越能人性化，当你推介时，写一封人性化的邮件，不要写看起来像是从某些营销文案中来的东西。给另一个人写一封人性化的邮件，然后当那个人与你互动时，对他们非常人性化。\n\n(01:28:26):\n我的意思是，Lenny，那个Fast Company记者喜欢你的原因，我非常确定是因为当他们和你通电话时，你就像一个正常的好人。如果你以不同的方式展示自己，因为你只是想以某种方式塑造自己，或者你感到防备或什么的，记者会想，\"这家伙是个混蛋\"，他会写一个完全不同的故事。\n\nLenny (01:28:53):\n嗯-嗯。\n\nJason Feifer (01:28:54):\n尽可能人性化，你将与一个会接受这一点的人打交道。\n\nLenny (01:28:59):\n很棒的建议。说到这里，我们已经到了非常激动人心的快问快答环节。\n\nJason Feifer (01:29:04):\n好的。\n\nLenny (01:29:05):\n你准备好了吗？\n\nJason Feifer (01:29:06):\n来吧。\n\nLenny (01:29:07):\n来吧。你最常向别人推荐的两到三本书是什么？\n\nJason Feifer (01:29:12):\nAndrew Chen 的《冷启动问题》(The Cold Start Problem) 对我来说反复出现，因为书中关于网络效应 (network effects) 的内容确实非常精彩。最近我和很多创业者讨论焦虑和完美主义的话题，心理治疗师 Katherine Morgan Schafler 写的《完美主义者失控指南》(The Perfectionist's Guide to Losing Control) 这本书，我认为真的非常值得一读。\n\nLenny (01:29:34):\n非常棒。最近有什么喜欢的电影或电视剧吗？\n\nJason Feifer (01:29:38):\n电影？我最近没怎么看电影。我有两个小孩，但我带我八岁的孩子去看了新版的《忍者神龟》(Teenage Mutant Ninja Turtles)，非常棒，这是一次很美好的体验。我小时候很喜欢他们，所以能看到现代版本很酷。然后我和我妻子刚看完《风骚律师》(Better Call Saul)，虽然晚了好几年，但真的很完美。\n\nLenny (01:29:56):\n我还没看那部剧。我很喜欢《绝命毒师》(Breaking Bad)。\n\nJason Feifer (01:29:59):\n哦，值得看。你一定要看。\n\nLenny (01:30:01):\n好的。又一部我要开始看的剧。\n\nJason Feifer (01:30:03):\n我知道，电视剧太多了，太多了。\n\nLenny (01:30:05):\n我通常也会问产品负责人和增长专家下一个问题，但我很好奇你的答案会是什么。你有没有最喜欢的面试问题，用来问你面试的人？通常是指你招聘的人。\n\nJason Feifer (01:30:16):\n面试求职者吗？\n\nLenny (01:30:16):\n是的，那是理想情况，但你可以任意理解。\n\nJason Feifer (01:30:19):\n我会换个角度来说，因为我们一直在谈论媒体公关。这是一个非常好的采访策略，我要告诉你，因为我认为它在其他任何场合也很有用，而且这可能也是别人在面试中会对你用的方法。我最喜欢的采访策略是向他们抛出一个理论，我不是指关于世界的理论。我的意思是，也许在采访进行到十分钟后，在他们告诉我几件不同的事情并回答了一些不同的问题之后，我会在脑海中建立一个联系，然后我会说：\"我想跟你分享一个理论。你认为你真正对这个感兴趣的原因，或者你做那个决定的原因，实际上是因为你之前告诉我的另一件事吗？\"\n\n(01:30:59):\n你在倾听。这是真正的积极倾听，你把不同的东西结合在一起形成某种理论。这个理论之所以有效，是因为它迫使人们在你面前实时思考。我喜欢这样做，因为我经常采访那些已经被采访过无数次的人。我采访过 Jimmy Fallon 和巨石强森 (The Rock) 等等。他们已经被采访过无数次了，那么你如何让他们在你面前思考呢？答案是问他们没有被问过的问题。我喜欢这个理论的地方在于，它向他们展示了你真的在倾听，并试图理解他们。\"你做那件事很有趣。我想知道是不是因为\"某某某事情。这让他们以一种非常真诚诚实的方式做出反应。\n\n(01:31:49):\n我想说的是，作为求职策略，这也不错。我作为求职者参加过的最喜欢的面试是多年前，我去《纽约杂志》(New York Magazine) 面试。我和 Adam Moss 面试，他现在已经不在那里了，但他是传奇的主编。他让我当场深入探讨一个想法。他说：\"你最喜欢《策略家》(Strategists) 的哪个版块？\"那是杂志的一个栏目。我说：\"我真的很喜欢房地产版块。\"他说：\"好的，我们应该在房地产版块推荐哪个好社区？\"我说：\"哦，我不知道，\"然后我说了一个社区。他说：\"那个社区有哪三个好的元素？\"他就这样不断推进，深入，深入，深入。没有对错答案。他只是想看看我是如何思考的。我发现这非常有力量，当我采访别人时，我也会用这种方法的变体。\n\nLenny (01:32:48):\n太棒了。我喜欢这个。最近你发现了什么很喜欢的产品吗？\n\nJason Feifer (01:32:54):\n我一直在用 BIGVU，我甚至不知道怎么发音，BIGVU，B-I-G-V-U。这是一个提词器应用。我花了大概 150 美元买了一个实体提词器，因为我制作很多视频，而那个提词器，对于只是在听这个播客的人，我现在指着我房间另一边的另一张桌子，它就放在那里，我从来没用过。原因是后来我发现了 BIGVU，这只是一个应用程序，它在非常靠近相机的地方运行提词器，无论是横向还是纵向模式。我用无数种不同的方式测试过它，它真的很有效，就像你在阅读它，真的看起来像你在直视相机。我很喜欢它。它为我节省了很多时间。\n\nLenny (01:33:33):\n这很酷。你基本上是把手机放在屏幕上，放在相机旁边或者相机在的地方？\n\nJason Feifer (01:33:39):\n不，不，不。这是用于录制的，如果你在手机上录制的话。\n\nLenny (01:33:44):\n明白了。你盯着手机，它告诉你该说什么。我懂了。\n\nJason Feifer (01:33:44):\n是的。是的。\n\nLenny (01:33:44):\n太棒了。\n\nJason Feifer (01:33:47):\n你写一个脚本，然后导入脚本，然后你选择速度，你可以调整它，每分钟多少字，然后它会在非常靠近相机镜头的地方滚动文本。\n\nLenny (01:34:01):\n太棒了。好的。\n\nJason Feifer (01:34:02):\n是的。\n\nLenny (01:34:02):\n我会去看看的。你最喜欢的人生格言是什么，经常对自己重复、与朋友分享的，经常出现的？\n\nJason Feifer (01:34:10):\n我最近经常对别人重复的一句话是我听来的，所以我推荐了 Katherine 的书《完美主义者失控指南》。我认识 Katherine 是因为我采访了她，我们后来成为了朋友，但最初是在她的书出版时我为播客采访她。我们在谈论感到工作过度和负担过重的问题，她给了我这个问题，我几乎每天都在思考，并且一直重复给别人听，那就是：\"如果你无法维持它，那么建立它的意义是什么？\"我喜欢这个问题，因为我，可能和听这个节目的每个人一样，非常努力地推动自己，在某个时刻你必须退后一步思考，\"我在建立的东西，在某个时刻对我来说是可持续的吗，还是这是不可持续的？如果你无法维持它，那么建立它的意义是什么？\"这是一个很好的提醒，提醒你为什么要建立某样东西以及如何建立它。\n\nLenny (01:35:03):\n我有一句非常相似的话，是我姐姐的伴侣曾经说过的，一直让我印象深刻，那就是：\"生活就是维护。基本上你买的或带入生活的所有东西，你都必须维护。\"\n\nJason Feifer (01:35:16):\n是的。\n\nLenny (01:35:17):\n我们买了一个新空调。现在，每年都有人来检查它。你有一个发电机，有人必须一直检查那个东西。我们买了一个玩具，现在我得考虑它放在哪里，我们是扔掉它还是保留它？你带入生活的每一样东西，基本上你都要维护它一辈子。\n\nJason Feifer (01:35:17):\n是的，这是真的。\n\nLenny (01:35:33):\n是的，所以我认为特别是对于工作来说，就像你开始一个新项目，你将不得不——\n\nJason Feifer (01:35:39):\n你将不得不维护它。\n\nLenny (01:35:40):\n——维护它，就像这个播客，对吧？就像，你想开始一个播客并永远做下去吗？\n\nJason Feifer (01:35:45):\n是的。\n\nLenny (01:35:46):\n这是其中的一部分。开始某件事的一部分就是你必须维护它。\n\nJason Feifer (01:35:49):\n是的。\n\nLenny (01:35:49):\n是的。\n\nJason Feifer (01:35:50):\n我知道我们在快问快答环节，我们已经违背了快问快答的逻辑，但我还要补充一点，就是我为杂志封面采访了 Michelle Pfeiffer，我认为最令人着迷的事情之一是她创办了这家香水公司，叫做 Henry Rose。她说拍电影和创建公司之间最大的区别是，当你拍电影时，所有的工作都发生在开始阶段。你拍完电影，然后电影上映，然后你就完成了。你永远不必再为这部电影工作了。她并没有真正为公司完全相反的情况做好心理准备，公司的推出实际上是工作的开始，而且是无止境的。她说她花了整整一年时间来适应这个现实，然后它变得有趣了。我认为这是人们忘记的事情。\n\nLenny (01:36:42):\n嗯，这个故事很酷，你能采访 Michelle Pfeiffer。\n\nJason Feifer (01:36:45):\n是的，她很棒。\n\nLenny (01:36:46):\n最后一个问题。我在读你的个人简介，你说你能够取得今天的成就，达到今天的位置，唯一的原因是你所说的机会集合 B (opportunity set B)。\n\nJason Feifer (01:36:57):\n哦，是的。\n\nLenny (01:36:58):\n你能解释一下那是什么，以及为什么它对你如此重要吗？\n\nJason Feifer (01:37:02):\n哦，是的，当然。现在在你面前，你，Lenny，你们所有在听、在看的人，有两组机会。机会集合 A 和机会集合 B。机会集合 A 是所有对你提出要求的事情。如果你有工作，那就是你老板对你的期望。如果你有自己的公司，那就是每个人对你的期望。把这些事情做好非常重要。这是衡量成功的标准。这就是机会集合 A，所有对你提出要求的事情。然后是机会集合 B，机会集合 B 是可供你选择的，即使没有人要求你去做。这可能是，如果你有工作，可能是承担新的责任或加入新团队之类的。就个人而言，可能是追求一个爱好。可能是因为你喜欢听播客而开始一个播客，任何事情。\n\n(01:38:01):\n我在自己的职业生涯中发现，机会集合 B 总是更重要，无限重要。问题是，如果你只专注于机会集合 A，那么你只具备做你已经在做的事情的资格。机会集合 B 是成长发生的地方，是你在不同方向推动自己的地方。我很久以前就发现，考虑这两件事真的很有帮助。很多时候，也许我们不做机会集合 B，因为我们不知道它会如何回报，或者我们不知道在哪里找到时间。我一直发现，一直都是，参与这些对我可用的事情，现在在我周围可用的事情，没有人要求我做的事情，会带来下一次成长，要么是因为它变成了一个实际的机会，要么是因为它为未来的某个机会提供了信息。\n\n(01:38:58):\n当我成为《企业家杂志》(Entrepreneur Magazine)的主编时，零个人，零个人对我说：\"你应该去演讲巡回。你应该擅长接受播客采访。你应该写本书。\"没有人说过这些。我的工作是做好一本杂志，指导品牌的编辑方向，但所有这些机会都摆在我面前。一旦我意识到这点，我就明白了我可以去追求它们，而且在这样做的过程中，也能以不同的方式思考我是谁。我是一名杂志编辑吗?其实已经不是了。那只是我现在做的事情之一。我把自己看作是一名企业家，一个现在从事帮助他人的人。我是一名帮助企业家的企业家。这就是我对自己的看法。我能走到这一步，是因为我在思考：我现在在这里，因此我可以到达那里。永远不会有人要求我去做这些。我必须自己去做。这是我一直在思考的事情，也是让我夜不能寐的事情。我现在做的什么事情正在引导我走向别的方向?只有我自己能够找到答案。\n\nLenny (01:39:59):\n说得真好。这让我想起最近一位播客嘉宾的建议，追踪你在职业生涯和生活中进步的最好方法就是衡量你有多少\"哦，该死\"的时刻，因为那些正是你成长的时刻，你在做某些事情。我想这也许就是机会集B的一个例子，它不是默认路径，而是\"哦，我觉得我应该做这个，尽管它真的很难。\"\n\nJason Feifer (01:40:20):\n是的。\n\nLenny (01:40:22):\n这真是一个完美的结束方式。Jason，我不仅想开始着手媒体工作，现在感觉获得媒体报道变得非常可行。这真的很振奋人心，就像\"天哪，我能做到这个。我可以找一些人，向他们推介。我知道该怎么做了。\"\n\nJason Feifer (01:40:33):\n是的。\n\nLenny (01:40:34):\n不仅如此，我也要为自己寻找一些机会集B路线。非常感谢你的到来。最后两个问题。如果人们想在网上找到你，也许向你推介他们的故事，他们可以去哪里找你?听众如何能帮到你?\n\nJason Feifer (01:40:47):\n哦，Lenny，感谢你所做的所有工作，我真的很喜欢，也感谢你创造这个空间让我分享所有这些见解。如何找到我?好的，我提供两个方式。机会集B，一个很好的切入点，我写了一本书，叫做《为明天而建》(Build for Tomorrow)。它适合任何在生活或工作中经历某种变化的人。有我自己朗读的有声书版本，也有精装本和电子书，在任何买书的地方都能找到。再次强调，书名是《为明天而建》(Build for Tomorrow)。机会集B，整个概念实际上是书中的一个章节，所以我在那里会详细得多。\n\n(01:41:20):\n如果你想保持联系并获得这类内容，我有一份时事通讯，叫做《每周一件更好的事》(One Thing Better)。每周一种改善工作、打造你热爱的职业或公司的方法。同样，机会集B之类的内容，这就是我发布的东西。它非常关注工作的个人和情感方面。你可以通过访问网址onethingbetter找到它，就是one，O-N-E，onethingbetter.email。直接输入就行。Onethingbetter.email。我说这是联系我的好方法，因为如果你订阅了时事通讯并回复它，邮件会直接到我的收件箱。我保证会回复你。\n\nLenny (01:41:56):\n内部通道。Jason，再次非常感谢你的到来。\n\nJason Feifer (01:42:01):\n哦，谢谢Lenny。这太有趣了。\n\nLenny (01:42:03):\n大家再见。\n\n(01:42:05):\n非常感谢收听。如果你觉得这期节目有价值，可以在Apple Podcasts、Spotify或你最喜欢的播客应用上订阅节目。另外，也请考虑给我们评分或留下评论，因为这真的能帮助其他听众找到这个播客。你可以在lennyspodcast.com找到所有过往剧集或了解更多关于节目的信息。下期节目见。",
  "chunks_count": 10
}