{
  "guest": "Matt LeMay",
  "en": "Matt LeMay (00:00:00):\nMore product managers and teams are getting laid off. The problem is the message that Daniel Ek from Spotify sent out with their layoffs in 2024, we still have too many teams doing work around the work.\n\nLenny Rachitsky (00:00:11):\nEven if you are told to build the thing that the execs are really excited about, you're still going to get fired eventually.\n\nMatt LeMay (00:00:15):\nIf you were the CEO of this company, would you fully fund your own team? Frankly, most of the people I ask that question to don't know the answer right away.\n\nLenny Rachitsky (00:00:24):\nWhich is something you call the low impact PM Death Spiral.\n\nMatt LeMay (00:00:26):\nIs the dynamic in which every medium to large company I've ever worked with finds itself in, one way or another.\n\n(00:00:33):\nIt starts with adding little features here and there, making little cosmetic improvements until the next round of layoffs.\n\nLenny Rachitsky (00:00:39):\nYou have three steps to become more of an impact first product team.\n\nMatt LeMay (00:00:42):\nSo the first is in setting team goals, no more than one step away from company goals. Don't let it get cascaded into oblivion.\n\nLenny Rachitsky (00:00:50):\nYou're an ICPM. It's up to you. No excuses.\n\nMatt LeMay (00:00:52):\nYou can follow all the best practices, but if your company goes out of business, they're not going to keep writing your paycheck for two years because all of your OKRs were a 0. 6 or a 0.7.\n\nLenny Rachitsky (00:01:02):\nToday my guest is Matt Lameé. Matt is a longtime product leader, author of one of the most popular and practical books in the field of product management called Product Management in Practice.\n\n(00:01:12):\nOver the course of his consulting practice, he's worked with hundreds of product teams, helping them improve how they operate and drive more impact, more consistently.\n\n(00:01:20):\nFrom that experience, he wrote and recently published a new book called Impact First Product Teams, that I could not agree more with.\n\n(00:01:26):\nIn our conversation, Matt shares why it is so essential to align all of your work with business critical outcomes, especially if you fear layoffs at your company.\n\n(00:01:35):\nWe talk about the low impact death spiral that many product teams fall into. What steps an individual product team can take to align their work to business critical outcomes, regardless of how their organization approaches product development. Tips for how to push back on stupid ideas that execs ask you to build, and so much more.\n\n(00:01:52):\nThe message in this episode is one that I believe every product manager needs to hear, especially if you don't work at a high-flying Silicon Valley tech company.\n\n(00:02:00):\nA huge thank you to Martin Erickson, Adrian Joselow, and Dan Corbin for suggesting topics and questions for this conversation.\n\n(00:02:07):\nIf you enjoy this podcast, don't forget to subscribe and follow it in your favorite podcasting app or YouTube. Also, if you become an annual subscriber of my newsletter, you get a year free of a bunch of incredible products, including Replit, Lovable, Bolt, NNN, Linear Superhuman, Descript, Wispr Flow, Gamma Perplexity, Warp, Granola, Magic Patterns, Raycast, JetPRD, Mobbin, and more. Check it out at Lenny'snewsletter.com and click bundle.\n\n(00:02:29):\nWith that, I bring you Matt Lameé. This episode is brought to you by Enterpret. Enterpret is a customer intelligence platform used by a leading CXN product orgs like Canva, Notion, Perplexity, Strava, Hinge, and Linear to leverage the voice of the customer and build best-in-class products. Enterpret unifies all customer conversations in real time, from Gong recordings to Zendesk tickets to Twitter threads, and makes it available for your team for analysis and for action.\n\n(00:02:57):\nWhat makes Enterpret unique is its ability to build and update a customer-specific knowledge graph that provides the most granular and accurate categorization of all customer feedback, and connects that customer feedback to critical metrics like Revenue and CSAT.\n\n(00:03:12):\nIf modernizing your voice of customer program to a generational upgrade is a 2025 priority, like customer-centric industry leaders like Canva, Notion, Perplexity, and Linear, reach out to the team at interpret.com/Lenny. That's E-N-T-E-R-P-R-E-T dot com slash Lenny.\n\n(00:03:32):\nThis episode is brought to you by Pragmatic Institute, a trusted leader in product training and the go-to source for teams driving real results.\n\n(00:03:39):\nThis fall, they're back with the biggest event of the year: the Future of Product Management Summit. On October 16th, join thousands of product managers, marketers, and leaders for free virtual experience built to tackle today's toughest challenges and explore the future of product.\n\n(00:03:54):\nYou'll hear from trusted Voices like Teresa Torres and Matt Lameé, along with Pragmatic's expert instructors and other innovators who are transforming how teams tackle AI, prioritization and product strategy.\n\n(00:04:05):\nWhether you're building products, leading teams, or leveling up your career, this summit delivers practical insights designed to move your team forward.\n\n(00:04:12):\nRegistration is open, but spots are limited. Save your seat at pragmaticinstitute.com /Lenny, that's pragmaticinstitute.com/Lenny.\n\n(00:04:26):\nMatt, thank you so much for being here and welcome to the podcast.\n\nMatt LeMay (00:04:29):\nThank you so much for having me. I'm really, really excited to be here.\n\nLenny Rachitsky (00:04:32):\nI'm even more excited. You have a really interesting background. I usually don't spend time on background, but I thought this would be fun.\n\n(00:04:38):\nI was looking at your LinkedIn and your background. The beginning of your career you spent 13 years at Pitchfork reviewing music.\n\nMatt LeMay (00:04:46):\nYes.\n\nLenny Rachitsky (00:04:46):\nReviewing artists. Pitchfork was a massive deal. I don't know where it is today, but it was the most influential music review site. Is it still a big deal or is it less so?\n\nMatt LeMay (00:04:55):\nIt is still a big deal. It was much less of a big deal when I started working for them and I was a 16-year-old music nerd, writing record reviews in my bedroom at my parents' apartment.\n\nLenny Rachitsky (00:05:06):\nOkay, so what I'm hearing is you helped make them a big deal. Excellent. That's impacts. We're going to talk all about impact.\n\nMatt LeMay (00:05:11):\nIf I were better at telling my own story, that's exactly what I'd be saying, is that before I started, I was product manager number one at Pitchfork.\n\nLenny Rachitsky (00:05:17):\nFunny enough, you look at your resume, you went into product management from Pitchfork. Very typical career path.\n\n(00:05:23):\nBy the way, if you're on YouTube watching, there's a lot of musical paraphernalia behind you, an awesome guitar, so clearly there's a thread of music throughout your background.\n\nMatt LeMay (00:05:31):\nYes.\n\nLenny Rachitsky (00:05:31):\nLet me ask you this question: what is most similar about making music, and even critiquing music, and building great product?\n\nMatt LeMay (00:05:39):\nThe magic lies in the way people work together. That's really what I think has been the consistent thread between all the work that I've done.\n\n(00:05:47):\nI spent years as a touring musician. I still occasionally tour in my friend Will Chef's band. And it's that magic of people with different perspectives, different ideas, building into something that is somehow greater than the sum of its individual parts and perspectives.\n\n(00:06:03):\nThat's what makes this interesting. That's what makes music magical. That's what makes product development interesting, especially in the age of AI.\n\n(00:06:13):\nWhen people have the opportunity to, I think, close themselves off from the messier parts of human interaction, from those moments where you realize that your perspective might be limited, that somebody else might be able to expose you to something, show you a way of working, show you a way of seeing that you haven't seen before, I think that those interactions, that ability to learn from and build with each other, is only going to become more valuable and more precious, frankly, as technology continues to do what technology does.\n\nLenny Rachitsky (00:06:44):\nWow, what a beautiful answer.\n\nMatt LeMay (00:06:45):\nThank you.\n\nLenny Rachitsky (00:06:47):\nI love that. So let's get to the task at hand.\n\nMatt LeMay (00:06:50):\nYes.\n\nLenny Rachitsky (00:06:51):\nSo you're known for writing one of the most popular books in the field of product management called Product Management in Practice.\n\nMatt LeMay (00:06:58):\nI suppose I am.\n\nLenny Rachitsky (00:06:59):\nYes. Basically describes the job of a product manager very practically, very specifically, better than any other book out there.\n\n(00:07:09):\nYou have a new book out called Impact First Product Teams. I asked you what the goal of this book was and you said the goal was what are the steps that individual product teams can take to align their work to business critical outcomes, regardless of how their organizations approach product development?\n\n(00:07:25):\nAnd I thought this was a really nice way of framing this conversation. There's two important parts to the sentence that you gave me.\n\n(00:07:32):\nOne is aligning your work to business critical outcomes, and the other is steps an individual product team can take, regardless of other business functions.\n\n(00:07:40):\nSo let me start with this first part. This is kind of you named your book after this concept of impact, first: Why is aligning work to impact and to business critical outcomes so important?\n\nMatt LeMay (00:07:51):\nIt's important because at the end of the day, it is those business critical outcomes against which you and your team will be evaluated. That's the reality of working for a business, right?\n\n(00:08:02):\nIf you are contributing to the business in a way that the business at large can understand, that the CEO can understand, that the CFO can understand, if your team is a good investment for the business, then the business will continue making that investment.\n\n(00:08:16):\nIf your team is not a good investment for the business or you don't really know if your team is a good investment for the business, but you figure you're showing up, so probably it's fine, you guess, then that puts you in a really tenuous position, and a position that I think we've all seen not work out terribly well for everybody in recent history.\n\nLenny Rachitsky (00:08:36):\nAnd so, what is this a reaction to? Because I imagine many people hearing this are, like, \"Of course, PMs, product teams we're driving business impact, well, that's why we're here.\"\n\n(00:08:44):\nThat's not actually the case in most cases. So first of all, just what is this reaction to? Is this the reaction to people being, like, \"Oh, we're just going to build great products, we're going to listen to customers,\"? Talk about the flip side of this.\n\nMatt LeMay (00:08:55):\nI mean, there's a couple of things. I think the main one is just more product managers and teams are getting laid off. That's a really scary reality right now.\n\n(00:09:05):\nAnd if you look at the messages that are being conveyed by CEOs when they lay off these teams, some of them are pretty clear.\n\n(00:09:13):\nThe message that Daniel Ek from Spotify sent out with their layoffs in 2024 said, \"We still have too many teams doing work around the work and supporting work, rather than focusing on opportunities with real impact.\"\n\n(00:09:25):\nAnd that really struck a nerve because I've been on those supporting teams before. I've done the work around the work. And I've assumed that if I was given work around the work to do, that surely it must be critical to the business, otherwise they wouldn't have hired me to do it.\n\n(00:09:40):\nI don't think that is a safe assumption to make. I think especially given that we are no longer in a zero interest rate environment, given that hiring and retaining employees is expensive, given that companies are looking at cost savings, I think we are in a moment where it is really incumbent upon each product team and each member of each product team to be able to understand, articulate, and work towards the top line business impact of their own work.\n\nLenny Rachitsky (00:10:12):\nAwesome. So where this comes from is, one, if you are not driving something that is directly driving business growth, you're not as valuable to the company. You're the kind of person that they'd lay off.\n\nMatt LeMay (00:10:12):\nYeah.\n\nLenny Rachitsky (00:10:23):\nThere's also a flip side of finding a job. It feels like if you have shown impact in your resume, \"Here's all the impact I've driven,\" this also helps you get hired. True?\n\nMatt LeMay (00:10:31):\nAbsolutely. Yeah. I mean, it's the most common resume advice I see, is show the number, show the impact, say what you did.\n\n(00:10:40):\nI have a friend who does resume coaching, and I showed her my resume a couple of years ago. And she said, \"I love your resume except for one thing. Why do you write like a little girl? Say what you did, say what your contributions were. Don't say 'I helped. I may have maybe helped people do this'. Say the impact. Put the number on it.\" And I think I needed to hear that from her because I think there is a tendency, especially for those of us who do really thrive in that collaborative environment, who our nature is to not want to take credit for work that could only exist via the contributions of many people with diverse experiences and perspectives.\n\n(00:11:22):\nIt's really hard to say, \"Well, I did this and I contributed to that,\" but that's part of why I wrote this book at the team level, because I think for folks, like myself, who really enjoy and thrive in that team environment, if you can look at the product team as the foundational unit of impact and say, \"We delivered this. We were able to work together to have this impact for the business,\" that feels really good and also speaks directly to the work that that team did together.\n\nLenny Rachitsky (00:11:49):\nThat's a really interesting insight. I think a lot of this comes from just PMs naturally are trained to deflect credit and to include, say 'we' in everything and just this person did that. So I get where that comes from. So most listeners will probably still be thinking, \"Yes, I'm driving impact, I'm great. I don't have a problem here. I don't to change, need to change anything.\" What are some ways to stress test your thinking? Maybe some questions to ask yourself or maybe your team of just, like, \"Okay, maybe I'm not?\"\n\nMatt LeMay (00:12:17):\nSo the first question I ask most of the teams I work with is if you were the CEO of this company, would you fully fund your own team?\n\n(00:12:29):\nAnd that is a small question that can provoke some big reactions. Because, for me, when I was working as a product manager, I truly believed that my job was to find the next most defensible thing to build, build it, celebrate it, find the next most defensible thing to build, and so on and so forth. Rinse and repeat forever and ever.\n\n(00:12:53):\nI kind of assumed that the existence of my team was this righteous fact of the universe, right? My team would always be there for all time, and it was just a matter of us finding the next thing to work on, which meant doing discovery and making concessions to what leadership wanted and doing all that stakeholder management.\n\n(00:13:13):\nBut the idea that my team came at a cost to the business, that at some point somebody might look at my team on a spreadsheet and say, \"Who are these very expensive people? Why do we need them? Do we actually need them?\" It just wasn't something that crossed my mind because I wasn't in the room for those conversations. That wasn't how I was thinking about my team's work.\n\n(00:13:34):\nSo I like asking this question because it's a perspective shift. It gets you thinking if you were personally accountable for the existential market-level success of this business, would you invest in your team?\n\n(00:13:52):\nAnd frankly, most of the people I ask that question to don't know the answer right away. They're not sure. They say, \"I think so,\" or, \"Yeah, yeah. Yeah, because... \" And then you can see the gears turning.\n\n(00:14:05):\nAnd again, to me that is a risky situation to be in because if you can't answer that question as a member of the team, nobody else in the organization is going to be as well-equipped to answer that question as you are.\n\n(00:14:19):\nSo bringing that question to the team, asking it and answering it proactively and collaboratively and being ready to say, \"Okay, if we can't answer this confidently, what are the changes we need to make? Do we need to change our purview? Do we need to change our goals? Who do we need to talk to? What do we need to do in order to make this happen, in order to answer that question confidently?\" We are much better off having that conversation at the team level than waiting for someone else to have it for us, or at us.\n\nLenny Rachitsky (00:14:50):\nSo is kind of the signal here is if you can't confidently say yes, asking yourself this question or your team talking through this and having a clear answer, there's maybe a potential problem that you need to work on?\n\nMatt LeMay (00:15:01):\nAbsolutely. I think that's exactly it, yeah.\n\nLenny Rachitsky (00:15:04):\nAnd we'll talk about what to actually do and the steps you recommend to fix this problem, but I want to keep talking about impact because sometimes it takes a while for people to be convinced, \"Okay, I need to really do this,\" versus, \"Okay, here's the ways to do this.\"\n\nMatt LeMay (00:15:15):\nYeah. It has taken me until now, until writing this book to be convinced, and I still feel like I need to be convinced a little bit sometimes.\n\nLenny Rachitsky (00:15:22):\nI think the layoffs are a really good convincing function for people.\n\nMatt LeMay (00:15:26):\nYes.\n\nLenny Rachitsky (00:15:26):\nWhere they're seeing all these PMs being laid off and just, like, \"How do I avoid that?\" And this is basically the answer to that, is here's how you avoid getting laid off.\n\n(00:15:33):\nThere's an interesting implication in what you describe here where you encourage the PM and the product team to think like the CEO.\n\n(00:15:39):\nThis touches on something I've been meaning to write about, but I haven't, which is a lot of people, there's this argument are PMs the mini CEO?\n\n(00:15:46):\nIn my mind, the PM is 100% the mini CEO, in terms of they think like the CE or they should within the team. They're the same; their job is to think about the business like a CEO within the team.\n\n(00:16:03):\nObviously they're not in charge of everyone. They can't let get anyone go. The reporting lines are not the same. But I feel like that's a really good lens for the job of a PM, is just you're like the mini CEO on a team, making sure you're building the right things, thinking about the business, solving real problems that matter.\n\nMatt LeMay (00:16:19):\nI think the way I've come to think about it is that the product manager is responsible for the whole team thinking like a CEO, if that makes sense.\n\nLenny Rachitsky (00:16:26):\nI love that.\n\nMatt LeMay (00:16:27):\nSo if the product manager takes that on as their sole responsibility and says, \"I'm the mini CEO. I think about the business,\" that's a missed opportunity.\n\n(00:16:35):\nIn my consulting work, it's more often than not been an engineer who's actually able to get to that specific impact-level goal for the team, sometimes before the product manager does, because the engineer is thinking in systems, is thinking about, \"Okay, I know this system, I know this other system. I've had this conversation with this person. I think I see how this can all fit together.\"\n\n(00:16:55):\nSometimes it's a designer or a UX researcher who understands what customers need and who has that direct firsthand knowledge.\n\n(00:17:02):\nSo I think the way that I certainly initially misinterpreted the mini CEO thing was you are solely in charge of this, as opposed to you are the person who brings that kind of CEO-level commercial thinking to the team. And I've been much more inclined of late to see the product manager's job as to bring in and facilitate that conversation, rather than to be the sole owner of that conversation.\n\nLenny Rachitsky (00:17:29):\nThat is a really good Nuance to what I said, and it makes all the sense in the world.\n\n(00:17:34):\nFollowing these lines of what is the job for product manager, you have a really nice way of just thinking about it. What does a business expect from a product manager?\n\nMatt LeMay (00:17:42):\nYeah. My favorite definition of product management comes from Melissa Perry's book Escaping the Build Trap, where she describes product management as facilitating a value exchange.You're facilitating a value exchange between a business and its customers.\n\n(00:17:57):\nThe actual shape and nature of that value exchange depends on so many things. It depends on your funding model, it depends on your business model, it depends on whether you're B2B or B2C, it depends on whether you're publicly traded or privately held. There are so many different variables that go into what a business expects from product teams.\n\n(00:18:19):\nAnd one thing I've come to is that I'm probably too hesitant to generalize in general, aside from that generalization I just made, but I think that the best product managers and teams I've worked with are really curious to understand what success means to their particular business.\n\n(00:18:38):\nSo if that's a startup, how much runway do we have? What do we need to raise that next round? Are our investors looking for growth? Are they looking for profitability? What are they looking for in order for us to reach that next existential milestone?\n\n(00:18:52):\nIf we're a publicly traded company, what are investors looking for? What have we told shareholders? What's in our next prospectus? What are we saying we're going to deliver to the market at large?\n\n(00:19:01):\nThis information usually exists somewhere, but it's really easy to get disconnected from it as we go about the day-to-day work of doing product management.\n\n(00:19:11):\nI've been in a lot of rooms having workshops and sessions with teams I work with, where they're pulling up the last town hall meeting to look for slides from their CEO because they're so busy, they have so many day-to-day things to deal with, that for them that town hall day is, like, \"Okay, finally I can just not have to deal with people emailing me every 10 seconds.\" It's a chance to take a deep breath and then get back to the stuff that really matters.\n\n(00:19:38):\nBut those top-level things, those promises that have been made to the market at large, to the board, to the shareholders, those are often a great place to start for understanding what exactly your business is looking for, so you can figure out how your team's work helps contribute to success in the terms that matter most to the business.\n\nLenny Rachitsky (00:20:01):\nThat's an amazing segue to exactly where I'd wanted to go, which is this quote that is exactly what you just said, the question you should be asking, it's kind of a different version of the one you shared earlier, which is what are we doing to contribute to the success of the business?\n\nMatt LeMay (00:20:14):\nYeah.\n\nLenny Rachitsky (00:20:15):\nSo what is it that you think people are thinking instead most often?\n\nMatt LeMay (00:20:21):\nIt's interesting. We live in a world where for the last 20 years of product development, we've been all about best practices. We love best practices.\n\n(00:20:30):\nAnd I love best practices too. I think best practices can be really valuable, can be really useful. I love how much knowledge sharing there is out there. When I started 15 years ago, it was so much harder to get any sense of how anybody was doing anything.\n\n(00:20:44):\nBut I think the downside of this is that there are a lot of folks who are really, really fixated on doing things the right way. And a lot of the writing and thinking about doing things the right way exists in kind of this middle layer, between impact and day-to-day work.\n\n(00:21:03):\nSo if you have impact, the overall success of the business, revenue, growth, profits. Then from there you set objectives and you do initiatives, and then you do bets, and then you make a strategy, and then you do your day-to-day work.\n\n(00:21:15):\nI think the tendency among a lot of product teams is to key to those middle pieces, to say, \"Okay, what we're doing is on strategy. What we're doing is part of objectives. We did OKRs, right? We spent three weeks coming up with our OKRs for three months. It's OKR season, everybody. We have to pretend to care about our goals, and I read a book that says we have to have five to seven objectives with five to seven key results, and we want the score of each one to be a 0.6 or a 0.7.\"\n\n(00:21:41):\nAnd at the end of the day, you've actually spent so much time and energy being really clever and cascading these things into these intermediate steps, that each step has incurred more and more risk that we might not achieve that impact we seek to drive.\n\n(00:21:59):\nEach time we abstract things out, each time we cascade things from impact to something else until we wind up with a checklist of features to build, we're assuming that if we then build that checklist of features... We will have a successful business.\n\n(00:22:14):\nBut honestly, most of the companies and teams I work with, if I ask them how their lowest-level goals add up to their highest-level goals, they look at me like I just asked them the most impossible question in the world.\n\n(00:22:27):\nBecause by the time you get things down to that level, maybe it's going to work, maybe it's not going to work. There are assumptions baked into each of those levels.\n\n(00:22:37):\nYou might go through the motions of doing OKRs the right way or doing strategy the right way, but that doesn't guarantee that your strategy is going to work. It doesn't mean that your OKRs are going to add up to what your investors or your shareholders need to see.\n\n(00:22:52):\nSo I think there's a tendency among product teams to really sweat the middle, and to get really stressed out if the middle is not in perfect theoretical harmony with itself. If the objectives are a little out of line with the initiatives, are a little out of line with the bets, are a little out of line with the domains.\n\n(00:23:14):\nBut at the end of the day, I don't think I've ever worked for a company where these things add up to a perfect breadcrumb trail you can trace back from, \"We prioritized these bits of work in this sprint because it adds up to this objective, which is part of this strategy, which adds up to this initiative, which is part of this bet, which will deliver this much impact.\" It's just not how things work in the real world.\n\nLenny Rachitsky (00:23:37):\nI feel like a lot of listeners are, like, \"That sounds very familiar,\" exactly what you just described. Again, we're going to talk about what to change and how to make work better to actually align your teams with impact. But I want to first talk about something that follows this thread you're on, which is something you call the Low Impact PM Death Spiral. Talk about what that looks like.\n\nMatt LeMay (00:23:55):\nThe Death Spiral.\n\nLenny Rachitsky (00:23:56):\nI love the hands.\n\nMatt LeMay (00:23:59):\nThe Low Impact Death Spiral is the dynamic in which every-\n\nMatt LeMay (00:24:00):\n... impact death spiral is the dynamic in which every medium to large company I've ever worked with finds itself in one way or another. And honestly, a lot of small product companies do as well, and it goes something like this. It starts with teams taking on low impact work. Adding little features here and there, making little cosmetic improvements because it's easier, it invites less scrutiny and you're less likely to mess up something important, right? The analogy I use sometimes is if you're working on a car, if you put your hands in the engine, you might make the car run really well or you might make it so that the car doesn't run at all. If you have the option of doing that or decking out the car with a paint job and rhinestones and making it look really, really cool, what are you going to choose to do? I know for me, I would choose the rhinestones every time because then the car runs however it runs. Whoever else is the expert in engines can fix the engine, but I'm going to do this thing which everyone can see. All the executives can look at it and say, \"Wow, look at how cool this car looks,\" and it's not going to do any harm, right? What's the worst that could happen? We can always take the paint off.\n\n(00:25:15):\nThe problem is if you have 10 teams adding rhinestones to a car, eventually the hood of the car is going to be so heavy that you can't lift it to get to the engine anymore, and that's exactly what happens in most product organizations. As you have more and more teams adding in these little features, making little enhancements, adding features, which might get some usage, but they're not going to take away anything meaningful, they're not going to mess with the commercial engine of the business. You have more folks building in and the hood of the car gets heavier and heavier, the product gets more and more complicated.\n\n(00:25:50):\nYou have all these little bits that have little dependencies on each other and the product becomes as, I think most modern products are a collection of loosely connected features rather than a single guided experience. What does that mean? That means internally, building anything becomes a lot harder, right? Because there's 10 product teams that have to manage dependencies whenever you want to build something, so companies start adding program management layers. They're like, \"We have too many meetings. We need to reorg for program management because reorgs fix everything and we need to make sure that we have all these layers and people are connected and we're doing dependency management.\" But as you add more of those things, it becomes harder and harder to do high-impact work.\n\n(00:26:33):\nThe hood just gets heavier and heavier and heavier, which in turn sends teams deeper and deeper down the rabbit hole of low-impact work. Low-impact work begets low-impact work. The more low-impact work you do, the harder it is to do high-impact work, the more likely you are to do low-impact work and so on and so forth. It goes and goes and goes until the next round of layoffs, and this is a real problem.\n\n(00:27:01):\nI've experienced this at again, pretty much every company I've worked with, and it's been really interesting to see how often the breaking of that cycle comes down to individual product teams being brave enough to look at their own work and look at what matters to the business and say, \"You know what? We are not going to incur the risk of being a low-impact team anymore. We are going to proactively seek out high- impact work and we're going to deliver, even if it means we have to coordinate with a lot of other teams. Even if it means that suddenly the executive team takes a really big interest in the work that we're doing. We're going to see that as signs that the work we're doing matters not as things that are going to be an impediment to getting the work done.\"\n\nLenny Rachitsky (00:27:47):\nAs you just kind of alluded to, there's a big implication here of even if you are told to build a thing that the execs are really excited about, that is low impact in your opinion, that's no excuse. You're still going to get fired eventually, even though they're telling you to build it. It sucks, but that's how it goes.\n\nMatt LeMay (00:28:04):\nIt's funny, I worked with MailChimp for three years leading up to their acquisition by Intuit, when they were on this really interesting journey of going from a single product company to a platform company, which is a journey that a lot of companies are on. Where they've found success in one part of the market and they say, \"You know what? We recognize that there's a value add in working more horizontally and giving people a suite of tools they can use. We want to build these tools and really make sure that we are meeting the needs of our small and medium business customers.\"\n\n(00:28:34):\nSo I was brought on shortly after they did a reorg. They went into a domains model. They had different teams that were supposed to be experts on different parts of this marketing platform that were building in new features and their VP product, Natalia Williams, who then became their CPO, she said, \"This is great that we're doing this, but I'm worried that we're going to lose sight of the commercial fundamentals. We have these teams building this really cool stuff and we've been so clear that we're excited about the teams that are working on initiative, that are building these new things, that are building out this platform, but let's make sure we stay focused on making sure that the entire platform grows in a healthy and sustainable way. And that as we are adding in these new features and functionalities, we're not making this so crowded and complicated that it's harder for people to get value out of it.\"\n\n(00:29:31):\nSo she set a very clear goal for the product team. She wanted a specific change in the rate of users who successfully send their first email. She was like, \"As we build these new things, email is still where people are coming in. We want to make sure that they can do this successfully.\" And she set a really ambitious goal for the entire product organization. And she put it forth to the product teams and a lot of product teams were understandably hesitant to take this on, for a number of reasons. They said, \"If we mess this up, that's the entire commercial heart of the business. That's really risky.\"\n\n(00:30:12):\nOther ones said, \"That's great, but we're building out these new parts of the platform that are really important. We don't want to risk slowing those things down.\" There was one product manager I worked with who really understood how important this was. She had worked on enough different parts of the app at that point. She had been on a growth team, so she really had that kind of user-centric, how do we hit the metrics we need to hit mindset? And she came to me and she was like, \"I want to make sure we do this because I'm worried about what'll happen if we don't do this, right? I don't want to be on the product team that failed to deliver what matters most to the business.\"\n\n(00:30:53):\nSo she went and worked with some user researchers and found where people were getting stuck. She did this amazing study finding where people were getting stuck before they sent that first email and she gathered together a group of product managers. I'll never forget this. I was on site in Atlanta and she gathered together a group of product managers and she was like, \"Look, these are the things we need to fix if we're going to hit this, but if we fix these things, I think we can do it. I think we can get there.\" And there was a moment of silence where again, for totally understandable reasons, people were like, \"Okay, this is great. I see it, but I'm kind of afraid that if we do this,\" and this product manager, I will never forget that.\n\n(00:31:34):\nShe looks around the room and she says, \"You know what? I'm going to haunt all of you in your dreams if you do not take this on. This is the most important thing for the business.\" And everyone laughed. It was a strong comment, but it was a strong comment made in really good faith that in its own way, I think acknowledged the fear that people had about taking this on. She was like, \"Look, this is really important and if we work together, if we care less about the constraints and parameters and borders of our domains and care more about how we work together to deliver the thing that our leader has told us is the most important thing for the business, we can get this done.\"\n\n(00:32:15):\nAnd they did get it done, and they got it done through subtracting. They streamlined the experience. They took out steps that people were getting stuck on. They made things easier. They did the kinds of things that are rarely celebrated in the way that traditional feature launches were celebrated, but because they had this clear, impactful, specific sense of what success looks like, they were able to take on that work themselves and it made the product better, made the business better, and it was just a great moment of working with a great team.\n\nLenny Rachitsky (00:32:48):\nThat was an awesome example. I love just how much of a hero's journey this example is. Along those lines, it's interesting how much courage it takes to do this. Because to your point, the easy thing is just, \"Okay, everyone's just telling us to do this thing. We're going to build this feature. Great, easy. I don't have to put myself out there.\" And what you're pointing out there is it's up to you to recognize what you're doing is not high impact and to have courage to push back and suggest something else.\n\nMatt LeMay (00:33:15):\nThe funny thing is, it's courage, but it's also a kind of radical acceptance of reality. There's a very kind of emotional philosophical dimension to this conversation because I think it is in human nature to not want to be accountable for things outside of our control. Impact is not something we can just check off a list. If we're really working towards business impact, that means that there are things that might happen in the market that are going to affect us, right? Our competitors might launch something, there might be a pandemic or a war or something we didn't expect. We're reliant upon customers to change their behavior, to convert or to upgrade or to do whatever it is we hope they will do.\n\n(00:33:58):\nI use the word hope because again, we can do our best to influence that behavior, but we can't just check a box. And I think there is this very understandable human fear of being accountable for things that are beyond our control. I get that so hard, but what I think the last couple of years have shown us is that we are accountable for things outside of our control. The success of the businesses we work for is ultimately beyond our immediate control.\n\n(00:34:26):\nAnd you can follow all the best practices and have the highest velocity and do everything quote-unquote \"right\", but if your company goes out of business, they're not going to say, \"Yeah, we're going out of business, but we're going to keep writing your paycheck for two years because all of your OKRs were a 0.6 or a 0.7.\" That's not how it works. The reality is that things outside of our control affect us, and I think that if we can internalize that, there's a real freedom in it. The thing that surprised me most when I was researching this book is that the commercially minded PMs I interviewed were also the happiest, which I did not expect at all.\n\n(00:35:06):\nAs you said, I come from a music background. I was expecting the business people to be really stressed out, and like, \"I have to show up at work 92 hours a day to crush it and make sure that we hit the metrics and crush the numbers.\" But they were just like, \"Yeah, I work for a business and I do the best I can, and then I go home. When I'm at work, my job is to help the business succeed. And I do that by understanding our business model, by trying to do work that contributes to what the business wants. In order to do that, if my goals are really impact level goals, I have to learn about our customers. I have to do discovery, I have to do all these things that we're supposed to do, not because they're abstract best practices, but because that's how you build a successful product.\"\n\n(00:35:49):\nAnd then at the end of the day, I'm not fighting my company to do product the right way, and if they can't do it the right way, I'm willing to die on this hill. It's like, \" I work for a company. I don't get to make every decision. There are things outside of my control. I'll do the best I can, and I get to free up a little bit of energy to live the rest of my life.\"\n\nLenny Rachitsky (00:36:12):\nTo make this even less scary, hopefully, I'm curious what your answer is going to be here. Do you find that people who take this leap and push back and try to change the way their teams are thinking and what they take on, do you find that even if they fail, even if they impact wasn't there and the project fails, they're seen more favorably and their career ends up doing better and they end up doing better even if the project fails?\n\nMatt LeMay (00:36:36):\nI hope so. I'm always super, again, it's outside of my control. I can't say, if you do these things, then you will be looked upon favorably by the people who manage you because I don't know those people, and maybe they're not going to react well. Maybe they're not actually... People are not always rational, and these things don't always play out the way you hope they will. What I will say is there's a story in the book, in Impact-First Product Teams about somebody who worked for a dating app, and they were given a project to work on, which had a very specific ambitious revenue goal. And at a certain point, it became clear that they were probably not going to be able to hit this because of other things they needed to do.\n\n(00:37:15):\nSo they went to the finance team and said, \"Hey, we have to adjust this down.\" And the finance team said, \"Yeah, of course you do. That makes sense. Let's adjust it down together.\" Would that conversation have played out the same way if they had not taken that step of saying proactively, \" Based on what is happening in the broader world in the market, our product, we no longer believe we are on track to hit this, but we want to adjust so that the company at large can make better predictions and resource things accordingly\"?\n\n(00:37:42):\nI don't know. But I think again, if you are embracing that mindset that there are things outside of your control and your job is to do what you can from where you sit to contribute to the success of the business, I think you're certainly doing so much more by telling the business honestly what you think is possible and what's going to happen, as opposed to stepping back from it and saying like, \"Oh, well, if we talk about it, we're going to get in trouble and nobody's going to believe us.\" And just that simple withholding of information does its own kind of harm. So I can't guarantee any kind of outcomes. I can't say, \"Yes, this will be received with generosity and grace,\" in all cases, but I think it's the right thing to do.\n\nLenny Rachitsky (00:38:29):\nMy sense is either you will be respected more highly because you are kind of solving problems for people, like higher ups that you're seeing, things that they should be seeing, and you're right, and they're like, \"Oh, wow, Matt's amazing. He saw all this stuff and changed.\" Or you realize this is not the company for me. They don't value this. They just want me to ship this widget and that's all they want from me. I could do more somewhere else.\n\nMatt LeMay (00:38:56):\nWell, I think you touched on something really important there, which is that when you understand the business model, you understand the real world ethics and priorities of the company you work for, right? If you understand what the company's optimizing for, what they really care about, what trade-offs and sacrifices they're willing to make in order to achieve those goals, that tells you a lot more than the mission statement. Which usually sounds great, but if you follow the money, if you follow the decision-making, sometimes it paints a different picture.\n\n(00:39:28):\nAnd I think the more you can understand how the business model works, what that value exchange is, what value is being delivered, what value is being extracted, that I think puts you in a better position to decide, if I were to help the company achieve success, do I feel good about that? Do I feel like this is a company that if it achieves its goals has made the world a better place or not? And the more you understand the business model, the better equipped you are to make those decisions with all the information available to you, I think.\n\nLenny Rachitsky (00:40:05):\nThat's such an important point.\n\n(00:40:07):\nToday's episode is brought to you by Anthropic, the team behind Claude. I use Claude at least 10 times a day. I use it for researching my podcast guests, for brainstorming title ideas for both my podcast and my newsletter, for getting feedback on my writing and all kinds of stuff. Just last week, I was preparing for an interview with a very fancy guest, and I had Claude tell me, what are all the questions that other podcast hosts have asked this guest so that I don't ask them these questions? How much time do you spend every week trying to synthesize all of your research insights, support tickets, sales calls, experiment, results, and competitive intel?\n\n(00:40:43):\nClaude can handle incredibly complex multi-step work. You can throw 100-page strategy document at it and ask it for insights, or you can dump all your user research and ask it to find patterns. With Claude 4 and the new integrations, including Claude 4 Opus, the world's best coding model, you get voice conversations, advanced research capabilities, direct Google Workspace integration, and now MCP connections to your custom tools and data sources. Claude just becomes part of your workflow. If you want to try it out, get started at claude.ai/lenny and using this link, you get an incredible 50% off your first three months of the pro plan. That's claude.ai/lenny.\n\n(00:41:24):\nOkay, so let's shift to talking about how to actually, what to do. This concept of actions you can take regardless of how your company operates. And that first part is really important. Something that I've seen you big on is you don't let people have an excuse for not pushing on this. And we've talked about this in other ways, but just maybe share more of just like you don't have an excuse no matter how your company operates, to not think deeply about this and try to make change.\n\nMatt LeMay (00:41:51):\nYeah, I mean, the reality is that most companies that product managers work at aren't big tech companies. And when I worked with product teams at those companies, at insurance companies or at banks or at CPG companies, or I worked with a company a while ago that makes audio equipment, which was obviously really fun for me, the first thing they usually tell me is, \"Well, we can't do product the right way because we're a regulated industry,\" or, \"because we're B2B,\" or, \"because we have these quarterly earnings targets we need to hit.\"\n\n(00:42:22):\nAnd that always makes me a little sad because yes, there's a way of looking at it where you can say, \"All right, if these five famous companies do product management the right way, then anything that puts us in a different situation from those companies must mean that we're doing product management the wrong way,\" which is demoralizing and distressing, and again, leads people to these kind of quixotic battles of like, \"I have to turn a bank into a search engine,\" which is not going to happen.\n\n(00:42:49):\nBut the other way of looking at it is that those constraints are how you do product management. Those are what guides you to the commercial decisions you should be making. If you're regulated, your competitors are regulated too. If you can really understand those constraints, figure out how to work well within them, that's a huge commercial advantage for your business. If you're B2B, I honestly prefer working with B2B companies in a lot of situations because they have such immediate access to their customers and they can understand the whole system of their customers and their users and how these things connect in a way that's really immediate and actionable.\n\n(00:43:24):\nSimilarly, if your company has quarterly financial targets to hit, congratulations, you know what the business really cares about. You don't have to go looking much farther than that. You don't necessarily need to cascade that 10 different levels into 45 OKRs if you can do work that you know feeds directly into what the company cares about the most.\n\n(00:43:47):\nSo yes, these things are constraints, but they're the constraints that shape the work that we do. And if we embrace them as such, if we treat them as guides, not restrictions, if we say we're working with not against the commercial realities of our business, there's so much we can do. There's so much that product managers and product owners and project managers that everybody working on product at every organization can do if we again work with, not against the realities of the companies we work for.\n\nLenny Rachitsky (00:44:23):\nOkay. So I think that's really empowering. You're not saying, \"You need to change the way product is built at your company. It's up to you. You're an ICPM, it's up to you. No excuses.\" What's a simple way to describe what you're actually saying, which I think is going to make people feel a lot better?\n\nMatt LeMay (00:44:38):\nWhat I'm actually saying is that the things you think you're fighting against are usually the things that are giving your work shape, if you let them be.\n\nLenny Rachitsky (00:44:50):\nAwesome. Let's talk about, you have three steps, three handy steps to become more of an impact-first product team. So let's talk through them. What is step one?\n\nMatt LeMay (00:44:59):\nYeah, so the first step, and I think the most important and where a lot of my work plays out is in setting team goals, close to company goals. No more than one step away from company goals. This idea comes from Christina Wodtke's book Radical Focus. She had a great episode on your podcast that I just re-watched for inspiration before I came on here.\n\nLenny Rachitsky (00:45:22):\nNice move.\n\nMatt LeMay (00:45:24):\nBut in that book, she has this visual where she says that most companies approach cascading OKR as kind of this multi-level, like at the top is company goals, then department goals, then big team goals, then small team goals, and smaller team goals. Which leads to the very situation I described where you can't add those small team goals back up to the company goals. She has a visual that she compares that to, which is the company goal as a center of gravity, and then every other team goal orbiting one level around it. And this blew my mind when I saw it for the first time, because whether you're doing OKRs or KPIs or north star metrics, whatever framework you're ostensibly using, if you use it well, it looks like that.\n\n(00:46:09):\nI worked with a team a while ago that was a traditional feature team at a FinTech company. They were the team that was kind of like the team I worked with at MailChimp, kind of given new features to build to take this product and build it more into a multi-product platform. And the business would say, \"Go build this.\" They'd build it, they'd celebrate, they'd say, \"Go build this.\" They'd build it, they'd celebrate. And then the business said, \"Okay, we're going to do things a little bit differently. Now we have this top line revenue target. We want to make this much more money next year, and we want you to tell us how you're going to contribute to this.\"\n\n(00:46:42):\nAnd this was a really challenging conversation for this team because as much as people complain about being feature factories, again, it feels safer, right? There's more control over that. If you're told what to build, you have a lot more control over whether or not you build it than you do over whether or not it generates revenue. So we started having this conversation, what framework should we use? How should we do this? And I was not asking very good questions. I was kind of panicking too, to be honest. And then I asked them, I was like, \"Okay, why does this team exist, right? Why are we doing this at all? Why is the business investing in this big team to build all these features? Why do we care if we're a single-product company or a multi-product platform company?\"\n\n(00:47:26):\nAnd one of the team leaders said, \"Oh, well actually, the customer lifetime value of a multi-product user is much higher than that of a single-product user.\" I was like, \"Oh, do we know how much higher?\" And they said, \"Yeah, we actually have a number on that.\" And I was like, \"Wow. So if we had a goal of converting a certain number of single-product users to multi-product users, we know exactly how much revenue is on the line.\" They were like, \"Yeah, I guess so.\" So we were able to set a goal, and from there we had this conversation about what's the number we would need to hit to make this team feel like a good investment? And we came to a specific number and-\n\nMatt LeMay (00:48:00):\nTo make this team feel like a good investment. And we came to a specific number and that number informed every decision that was made by that team for the rest of the year. We said, \"By the end of the year, we need to convert this many single product users to multi-product users because if we do that, there's this much additional revenue which contributes this much to the company's top line revenue goal.\" It's one step away.\n\n(00:48:22):\nAnd when they went and shared that goal with company leadership, they got it right away. They didn't have to say, \"Well, why is this valuable?\" They didn't have to say, \"What are your other OKRs? Show us the deck.\" They got it. And that gave them so much leeway to make bolder decisions, to work more closely with other teams to ask for the resources they needed. And that process of arriving at that goal, that goal that is impactful and specific and one step away from what the company cares about the most, is probably the most valuable way I have spent my time with teams of late. Because once you get to that, you see how everything else flows from there.\n\nLenny Rachitsky (00:49:01):\nAnd the implication here is that if it's too far away from people understanding what the hell are you guys even doing to help the business? That's the problem you want to avoid.\n\nMatt LeMay (00:49:10):\nExactly.\n\nLenny Rachitsky (00:49:11):\nSo one extreme is, I don't know, it probably doesn't make sense for your team to have exactly the same goal as the company. Say your company's trying to grow a hundred million revenue rate, that's not going to be your team's goal. So it's almost like that extreme is what's one step away from that? What's your contribution to that company goal?\n\n(00:49:29):\nThe other end is just some 10 level deep, we're going to improve conversion of this random step, which is going to grow this thing which grows that, and then that grows revenue.\n\nMatt LeMay (00:49:37):\nExactly.\n\nLenny Rachitsky (00:49:38):\nWhat is your guidance on revenue-based goals as goals for teams?\n\nMatt LeMay (00:49:43):\nI think, again, it depends. I know people have very strong opinions about teams should always or should never have revenue-based goals. I don't think it's that simple. I think sometimes yes, if your company is working towards revenue, having a revenue-based goal makes sense, or at least being able to put some value in terms of revenue on the work that your team is doing. I've worked with some startups where they actively are not going after revenue because right now the name of the game is growth, right? They want to show that they have enough users to raise that next round of investment. I actually worked with one startup where their revenue was going up, and their number of users was going up, and we had to have a really interesting conversation around which one actually matters to our investors. And we kind of wound up developing these two scenarios, the high growth scenario and the low growth scenario.\n\n(00:50:33):\nAnd talking to the product team, it was really clear that there was no way they were going to hit the high growth scenario. So they pivoted to focus on profitability so they could build more runway and raise that next round as a smaller business with a sustainable revenue base.\n\n(00:50:46):\nSo I get why people are hesitant to commit to revenue goals. I think that there are certainly situations where revenue goals would be too broad or not exactly what the business needs, but at the end of the day, money is how the impact of most teams is going to be measured. And if you don't have a point of view on why your team is a good investment, either in the money return it brings, or in another return that is equally or more important to the business, then again, that feels like a tenuous and risky position to be in.\n\nLenny Rachitsky (00:51:25):\nTo kind of get people's brains noodling in the right direction. What are some examples of good goals, like specific goals that your teams have set that are one step away from a company goal? What are just some examples without naming companies?\n\nMatt LeMay (00:51:38):\nI have a story to tell to that effect, which also sets up the second step here, which is to keep impact first at every step.\n\n(00:51:47):\nSo, I worked with a growth team at a tech company that is beloved by many the people. And I was brought on to help them set OKRs, right? The company was doing OKRs across the board, and this team was going to set its growth OKRs. So they had done a lot of reading, a lot of research into how to do OKRs the right way. They had read, unfortunately, they had not read Radical Focus or they hopefully would've done things differently, they had read a lot of other books. They had printed out a lot of articles and they said, \"We're going to make sure we get this right. We're going to put together a slide deck that has five to seven objectives with five to seven key results each, and each key result is going to have an owner and we're going to make sure that people are accountable for it. And we're going to really, really do this the right way. We're going to get that middle piece perfect.\"\n\n(00:52:39):\nSo they spent a long time working on these OKRs, OKR season ends. They file away the OKR deck not to be seen until the next OKR season. We reconvene, and spend a whole day scoring all of the OKRs. And there are heated conversations about what's a 0.6 versus a 0.7? Is this a 0.9? Who really should be the owner of this key result? Who contributed the most to it? And we get through this whole conversation, everyone's tired. And I'm like, \"There's just one question I need to ask. I'm so sorry to do this to y'all, but how does this all add up to the company level growth goals?\"\n\n(00:53:23):\nPeople look around and they're like, \"Well, that wasn't what we did. We set our team level OKRs and we went through the process and we made sure, and we followed the OKRs, we thought about the OKRs,\" and I said, \"Yeah, but the company has a goal of let's call it bringing on a million new users in this year. We're a growth team. How many users did we bring on?\"\n\n(00:53:50):\nAnd there's a moment of silence. And the leader of this team's a really, really good leader. She stands and she's like, \"Okay, we're going to do things differently.\" She steps up to the whiteboard, puts 1 million on the right end of the whiteboard, draws a line, \"This is the year,\" draws a little tick on the line. \"This is where we are now. It's a smaller number than a million. This is where we need to get to. If our conversation doesn't start with this, I don't want to have the conversation. And if you are 51% sure that a different approach is going to get us 1% closer, I expect you to advocate for that approach. And this is now how we are going to do everything.\"\n\n(00:54:34):\nAnd I think about that all the time, because it's subtracting steps. It's making things less complicated. It actually is doing exactly what you described. It's saying, \"This is what the company cares about. We're the growth team. We need to figure out how everything we're doing contributes to this.\"\n\n(00:54:55):\nThat story really stuck with me because it seems like it should be obvious, right? If you're the growth team at a company with a growth goal, obviously that's going to be something you care about. But it's so easy in the day-to-day work of setting these intermediate goals, of doing strategy, of doing the things we do to make things just a little bit more complicated than they need to be. So for this particular team and this particular moment, a good goal was looking at the company level goal and saying, \"If we're the team that's driving growth, we're accountable for this. We're going to step up and we're going to do everything we can to make sure, the company meets its ambition.\"\n\nLenny Rachitsky (00:55:38):\nAnd it's so obvious if you come at it from the perspective you shared earlier. If you're the CEO, would you fund this team? If you see our goal is a million users, this team will drive us a hundred thousand users. Assuming that's a lot for you. Obviously we want that team to do great and we're going to give them the resources to do that. They're going to contribute meaningfully to this goal. It's very obvious as you see it. The trick is a lot of people think they're doing that and they're not. Maybe one heuristic I think about as you're talking is just like, how do you know if you're doing this? There should be a very simple spreadsheet formula of just here's the company goal, here's your goal. There should be one simple formula that translates up that adds to it.\n\nMatt LeMay (00:56:20):\nOne Y statement and or one mathematical operator is usually the way I think about it.\n\nLenny Rachitsky (00:56:24):\nThere we go.\n\nMatt LeMay (00:56:26):\nIn some cases, like the story I told about that FinTech company, it's something like upgraded users. That's one step, right? You multiply that by the increased customer lifetime value. In some cases, it's a smaller unit of the same thing. So it's a subset of the revenue or growth that the company's trying to deliver.\n\n(00:56:47):\nI worked with a company recently that had a team rebuilding their ad tech platform. This is a big company that does a lot of different things, and at the heart of all of their different offerings is this ad tech platform. And I was brought on to do a day long workshop with this company because this was a really important team and they were struggling to figure out what success looked like.\n\n(00:57:06):\nSo I said, \"Okay, what are your goals?\" And they said, \"Here's the deck with our goals.\" I said, \"That's a lot of goals. I wouldn't be able to make decisions with those goals.\" They said, \"Oh wait, wait, wait, no, we also have a Miro board. We went through this and we decided the deck was too much. So we also have a Miro board,\" but as Miro boards tend to do, it kind of grew and grew and grew in all directions. So now it's a big board. Turned out they had two Miro boards because they had tried to do this twice.\n\n(00:57:33):\nSo we sat down and we did this really interesting kind of subtractive exercise, where everybody got a post-it note to write down what they think the most important goal of the team is. And then they would pair up and they would have to make it smaller each time, make it more concise. If there were two things, get it down to one thing. If there were 10 words, bring it down to eight words, make it smaller and more concise each time.\n\n(00:57:56):\nAnd we came up with two options. One was build a fantastic, wonderful, magical, beautiful platform to increase our team's profits by 20%. Fair enough. The other one was, build a stupendous, wonderful, fantastic platform to increase our team's profits in the next financial year from 20 million pounds to a hundred million pounds.\n\n(00:58:18):\nAnd I'm looking at these and I'm like, \"Okay, so we know that there is an expectation of revenue here. There's an expectation that we will drive profitability, but one of these is 20% and the other is 500%. Where do these numbers come from?\" And the folks who had said 20%, they were like, \"That feels like a good return.\" And what's interesting was when I was telling the story, when I was giving some talks recently, and people would kind of laugh like, \"Oh, they named the wrong number.\" But they were so brave to do that, and them saying 20% is what actually unlocked the conversation at the team level, because somebody else in the room heard that and said, \"Wait, I do remember something about profits. There was some target we were supposed to hit, but I think I remember it being a lot bigger than that.\" And they actually went back and found a town hall that their VP had given and buried in a slide in that town hall was this hundred million pound profit target by the end of the next financial year.\n\n(00:59:22):\nSo they have this number and they start to go like, \"Oh gosh, that's a lot, but it's a whole financial year. It'll be fine.\" And we do, again, inspired by that leader I worked with, I just put this out on a whiteboard. I'm like, \"All right, a hundred million in profits by the end of the next financial year right now we're here. What else should be on this timeline?\" Somebody said, \"Well, we're launching this in October.\" So I put October up there. I go, \"Okay, so if we don't ship anything until October, and right now it's March, how much profit do we make until?\" And they said, \"About 10 million.\" I'm like, \"Okay. So that means that between October and March, we need to generate 90 million pounds of profits.\"\n\n(01:00:06):\nAnd this team, I was worried they were going to freak out or they were going to be like, \"Oh, we can't do this. It's impossible.\" But they were like, \"Okay, it's time to step up. It's time to do all these things that we need to do. We need to ship sooner. We need to do more validation. We need to do more testing. Can we commercialize things sooner? Can we do more discovery to make sure that this is really going to have the impact we need to have? Why are we doing this whole big relaunch? Why don't we rebuild individual things? What impact will we have if we brought more people in top of funnel now? Can we begin building our user base and then upgrade that user base? What are the trade-offs if we do that versus if we bring people in?\"\n\n(01:00:41):\nAll those things that I think is really the heart and the intent of these best practices. They came to life because this team had clarity. They understood like, \"Okay, we are accountable for something which is specific enough to drive some real urgency, and which is impactful enough that we have to get out there and do all these things that we're supposed to do.\"\n\n(01:01:05):\nSo that to me, is a really good example of how if you start with this question of like, well, what's expected of this team? What does success look like for us? It'll often lead you to the right neighborhood of what kind of unit of measure you want to look for, how the business is going to look to you, whether they're looking directly at revenue, whether they're looking at something else.\n\nLenny Rachitsky (01:01:29):\nOkay. These stories are awesome. So basically, so far, the two steps that you've illustrated here of doing this correctly, step one is set team goals that are close to company goals. And then step two is, do this at every step of the product building process. It's not just a one-time thing at the beginning.\n\nMatt LeMay (01:01:46):\nRight. As you're doing OKRs, like that team I talked about, when you're thinking about your company strategy, when you're writing epics, whatever it is, keep that impactful goal top of mind. Don't let it slip away. Don't let it get cascaded into oblivion.\n\nLenny Rachitsky (01:02:02):\nBecause to your point, the examples you shared where you think you're just like, \"Cool, we have our goal, let's go.\" And then you spend months doing this thing and then you forget, okay, this actually got disconnected from the company goal.\n\nMatt LeMay (01:02:12):\nExactly.\n\nLenny Rachitsky (01:02:12):\nEverything you've worked hard to do is just, no one cares.\n\nMatt LeMay (01:02:15):\nYeah.\n\nLenny Rachitsky (01:02:16):\nOkay. What is step three?\n\nMatt LeMay (01:02:18):\nStep three is to connect every bit of work back to impact. So this is when we get to the prioritization piece, right.\n\n(01:02:26):\nSo impact estimation is something that is written about quite well, quite extensively in product management stuff, but it's something that it's easy to not do. I work with a lot of teams that want to know, again, the right best practice for doing prioritization, whether that's should we use ICE or RICE or MoSCoW or whatever it is, what's the right way to do prioritization? And again, it depends, but if you don't have a clear and specific sense of what impact means, you can't really prioritize effectively. So this is where, again, everything comes back to that first step of the way you set goals.\n\n(01:03:13):\nSo that team I told you about that had the goal of converting single product users to multi-product users, one of the product managers on that team came back to me a few months later and said, \"Hey, Matt, I could really use your help figuring out how to do prioritization. Should we do ICE? Should we do RICE? Should we do MoSCoW? I put together an ICE matrix where I scored impact and I scored certainty and I scored effort, and I multiplied each one by each one, and I have a list of the things we should do.\"\n\n(01:03:38):\nAnd I said, \"That's awesome.\" And I do really think it's awesome when people take the initiative to do the thing to say, \"I put this together, let's walk through it.\" So when they showed me this, I said, \"Let's start with impact.\" They're like, \"Okay, well here's the score for each one.\" I was like, \"What's the score?\" They're like, \"Oh, it's a lot of different things.\" And I said, \"Okay, well, we have a team goal of a certain specific number of users we need to convert by the end of the year, so let's try to express impact as a function of that goal. So rather than an abstract score, what is the most number of users we could convert in each of these different scenarios?\"\n\n(01:04:18):\nAnd understandably, they were kind of like, \"Oh, you know what? I don't know exactly.\" I'm like, \"Let's, just work through it. We don't have to be precise. It's called impact estimation, not impact getting perfect number.\" So for one of them, they were like, \"Well, we can do this landing page.\" I'm like, \"Okay, well how many people hit the landing page?\" And they were like, \"Not that many, maybe a few hundred.\" I'm like, \"Okay, cool. So that's maybe a few hundred.\"\n\n(01:04:43):\nAnd there was one thing which they were really reluctant. It had a high effort score and a medium certainty score. And what they basically said was like, \"Look, if we really wanted to do this, we could redesign the entire onboarding experience. We can make it so that rather than us trying to retroactively shuttle people into multi-product usage, we can understand them when they join and get them into the right category of user right away.\"\n\n(01:05:08):\nI'm like, \"That sounds amazing.\" What's the most impact that could have? They were like, \"It would get us all the way there if we did it right, but we'd have to work with these other teams and we'd have to work with marketing. And there are so many dependencies and so many things outside of our control that we don't know if we could do it.\" And I said, \"That's okay. These are the trade-offs we make as product managers, you will have some things to work on that are going to have less impact, but might be easier and more certain to deliver. But if this thing could get us all the way there, if it's really the only thing we're looking at, which has really any chance of getting us to our goal, which remember we came up with to answer the question, what does this team need to deliver to be a good investment for the business, then I think it's worth going for it.\n\n(01:05:55):\n\"It's worth having those conversations with other product teams. It's worth talking to folks in marketing. It's worth stretching ourselves a little bit and saying, 'This is going to be challenging to do, but if we can do it, we can really deliver on something which we're going to feel great about.'\"\n\n(01:06:11):\nSo the way that third step manifests itself the most frequently, tactically is are we estimating and measuring impact in the same unit of measure as our goals? Because if we're doing that, then we're keeping ourselves honest and we're saying, \"Does this actually have a chance of contributing?\" Whereas again, if we get really clever and we come up with a proprietary scoring system and all these little intermediate steps, we can feel like we're doing really awesome work and being very, very terribly smart. But we again, run the risk that we are going to lose our connection with why we're setting about to do this work in the first place.\n\nLenny Rachitsky (01:06:51):\nSuch an important and often easily overlooked point. This idea that when you're doing RICE or whatever version of ICE that you do, that impact should be based on impact to your goal, which is one level removed from the company goal. It feels so obvious as you talk about it, and I hope most people know this, but I feel like that's something people forget. Just like, what is impact? Oh yeah, customers will be happier.\n\nMatt LeMay (01:07:16):\nAgain, this is not easy work, right? Working in product means that we have so many different perspectives, so many different folks who have so many different priorities. The stakeholder management piece of this is relentless and exhausting, and it's really, really easy to lose sight of this stuff. And it takes work and discipline and as you said, bravery to keep bringing it back. But I think again, it is not only the right thing to do, but it helps you at the end of the day, have a little bit more of a boundary between the work you're doing at your job and the stuff you're good at in your life.\n\nLenny Rachitsky (01:07:58):\nSpeaking of boundaries, a lot of the advice you share will involve people saying no, and pushing back, and convincing people they're wrong, which is very hard. That's not a natural happy place for most people.\n\nMatt LeMay (01:08:12):\nNope.\n\nLenny Rachitsky (01:08:15):\nWhat advice do you have? What have you learned works well for pushing back, helping people see how they're not... What they want you to build is wrong.\n\nMatt LeMay (01:08:24):\nSo this is where I have the benefit, I suppose, of being a conflict-averse, people pleaser. So I've been through this, and I think the thing I am proudest of saying in product management and practice is that if you're doing product management really well, you never have to say yes and you never have to say no. You're giving people options and you're helping them understand the trade-offs.\n\n(01:08:52):\nSo in keeping with this idea that there are things outside of your control, as a product manager, you're not always going to be the one who makes the decision. There are going to be other people who come to you and say, \"Build this,\" or who say, \"I don't see the value in that. Do this, do that. I want this, I want that.\" If those people are in a position of formal authority in the organization, I've certainly never had luck telling them no.\n\n(01:09:16):\nFurthermore, I've found myself in situations where they just know things that I don't know. Where they're pursuing an acquisition, so there are certain things that we have to do or can't do. Where there's some serious financial challenge that they're working their way through right now, which is shifting around priorities, but they are not at liberty to discuss that with the broader organization. It is quite possible that the folks who are asking you to do things that don't make sense, have access to information that you don't. And that in trying to convince them otherwise, you are not only going to fail, but you are going to lose some of that trust and degrade that relationship that could in time be really important for you. So I think the challenge is to say, \"All right, you want me to build this thing? Maybe. Let's look at the different things.\"\n\n(01:10:15):\nIf you're going through these steps, if you say, \"I understand, here's what our team's goals are, here's the stuff we're prioritizing, here's the impact we think it could have.\" If you're coming to me with something which is going to have more impact, heck yeah, I would love to build that. That sounds amazing.\n\n(01:10:29):\nBut if it has an unclear impact or if it doesn't tie into this, then we might need to adjust the impact we're seeking to have. If this is suddenly really important, as with that story that was told in the book, right? Sometimes it's like, all right, we got to do this. Sure. That means that our impact projection is going to have to be adjusted this much.\n\n(01:10:48):\nYou're not saying no, you're not saying yes. You're helping someone who is in a position to make a decision, understand the trade-offs that go into that decision. And again, if you can do that, you're going to go home at the end of the day feeling better. You're going to feel less like you lost a battle or that you were overridden by an unjust tyrant, and it's going to be more like, \"Okay, I made sure they had all the information I would want to have if I were making that decision. That decision is ultimately theirs to make, and I'm going to do the best I can.\"\n\nLenny Rachitsky (01:11:19):\nTell me if you disagree. In my experience, you also want to recommend a path. Because a lot of people don't want PMs just, \"Here's all the options. I have no opinion, no bias of any kind. You decide.\" I find that people want you to have a perspective.\n\nMatt LeMay (01:11:33):\nAbsolutely. Options and a recommendation is kind of the magic formula. I did when I was working with MailChimp, we actually did a workshop with all the product managers at the company where we had people roleplay trying to sell in a single option versus multiple options with a recommendation. And it was amazing how when you present a single option, people's instinct is just to, well, I don't know, you start poking holes in it. Not because you're a jerk, but because-\n\nMatt LeMay (01:12:00):\nYou start poking holes in it, not because you're a jerk, but because you're looking at one thing and you're like, \"Oh, well, what about this? What about that?\"\n\n(01:12:07):\nAgain, all of your own anxieties and fears and the things that you don't feel represented in there, and where you're worried, \"What if this happens? What if that happens?\"\n\n(01:12:14):\nAll of that kind of detracts from the momentum, whereas if you come in and say, \"Here are three options, here are the trade-offs, here's the one we recommend,\" then every little bit of back and forth makes those options clearer and stronger.\n\nLenny Rachitsky (01:12:30):\nI feel like people might miss that nuance, in the way we talked about it, so I think that's a really important point to make there.\n\n(01:12:35):\nLet me come back to the three steps, just for folks that are, \"Cool, I'm excited, I'm motivated. I'm going to change the way we operate.\" I'll summarize real quick.\n\n(01:12:44):\nSo step one is, set team goals close to company goals. Step two is keep impact first at every step. Don't forget, as you're building throughout the year. And then, step three is connect every bit of work back to impact.\n\nMatt LeMay (01:12:57):\nYeah.\n\nLenny Rachitsky (01:12:59):\nI think, again, it's important to remind people, this may be hard and annoying, and maybe things are going fine. Everyone's telling you what to build, you're building and shipping, and things are, it seems to be going all right.\n\n(01:13:11):\nI think an important part of this is just, if you believe what you're building is not helping the business grow and succeed, either, they'll let you go someday, because you're not doing something that matters. Or the business will not work out, and you'll be in trouble.\n\n(01:13:27):\nSo it's like, even if you don't want to do this something, you need to really seriously think about this, even though it's really hard.\n\nMatt LeMay (01:13:36):\nYeah.\n\nLenny Rachitsky (01:13:37):\nBut maybe let me just think of that a little bit. Say the business is doing great, everything's great. The CEO's telling you all the things to build, that sales guys and girls are just like, \"Here, ship these features, everything's great.\"\n\n(01:13:46):\nAnd everything's working, business is growing. What thoughts there? Is it just, \"Nah, leave it alone?\" Or is your sense, \"Okay, most often this will not last,\" and you should really start to work on these skills?\n\nMatt LeMay (01:13:56):\nIt's funny, the teams I've worked with, when things are going well, are sometimes just as anxious as the teams I've worked with, when things are going poorly, because they have a hard time attributing success to what they're doing, right?\n\n(01:14:08):\nThey'll look at it and they'll say, \"Yeah, we're doing great. But I think that honestly has more to do with marketing than it does with us.\"\n\n(01:14:14):\nOr, \"Yeah, we're doing great, but we're just in the right place at the right time. Our business is doing really well, our sector is doing really well. We're just growing along with everyone else who's growing.\"\n\n(01:14:24):\nAnd I think, as with most things, if you approach it with curiosity, there's a lot to learn from it. So if you look at it, and you say, \"Yeah, we can't necessarily take sole credit for this, but Marketing's doing awesome. Let's talk to them. What are they doing? Why is this going so well? What have they learned from this, that we can work with them more closely?\"\n\n(01:14:46):\nIf your sector is just doing really well, be like, okay, well what about this is working right now? What might change in the future? How can we understand this?\"\n\n(01:14:54):\nSo I think the challenge, when things are going well, is to keep that curiosity going, and to keep celebrating the things, not just that your team is doing, but that everyone is doing, and to take that time, where you have a little bit more leeway, where there's less pressure on you in the moment, to build those connections with other parts of the organization, to see where that really good work is happening.\n\n(01:15:21):\nOne thing that makes me sad is when teams look upon each other with envy and disgust, right, when it's, \"This team's doing, they're doing great work, but they're not held to the same standards that we are, and it's not fair, and they're the team that everyone likes.\"\n\n(01:15:37):\nIt's like, \"Go talk to them, because there's probably something you can learn from them. And if they're the team that's getting positive attention, that's doing meaningful work, there's probably a reason for that. And if you can understand that reason, and you can align your work, that team's work, that's probably going to be really good for you.\"\n\n(01:15:58):\nAgain, I think, in a lot of cases, it comes back down to that control thing, right? If we can't feel a sense of control over, \"Things are going well because we did this,\" we tend to disconnect ourselves from things going well and say, \"Well, I can't. It almost feels dangerous to engage with it because, what if we didn't do anything, but good things are still happening.\"\n\n(01:16:21):\nAnd I think, just keeping that openness, keeping that curiosity going, puts you in a much better position for when things inevitably begin to either plateau or decline, which is the cyclical nature of all things.\n\nLenny Rachitsky (01:16:34):\nWow. Profound there. To start to wrap up our conversation, what's maybe one question from the book, or even from this conversation, that you think product leaders, product teams should ask themselves to help them solve problems, that maybe they're not seeing, and to help their team operate better?\n\nMatt LeMay (01:16:53):\nI mean, I love the, \"Would you fund this team, if you were the CEO question?\" I know that that can feel a little confrontational sometimes. So, a gentler way of bringing that up is to say, \"What's one sentence you'd want to be able to say at the end of this year, that would leave you feeling awesome about this team's work? What's something?\"\n\n(01:17:11):\nAt the end of the year, everything went really well for this team. You run into the CEO in the hallway, and you say, \"I feel awesome, because we did this.\" '.\n\n(01:17:20):\nAnd you'll sometimes get very different answers from different people on the team, building on those answers, saying, \"Okay, this is what you care about. This is what I care about. This is what I'm worried about. This is what I'm excited about.\"\n\n(01:17:33):\nThat's how you get that magical, people in a room building together, or musicians in a room writing their next song, right?\n\nLenny Rachitsky (01:17:40):\nWhat a call, back to the beginning.\n\nMatt LeMay (01:17:40):\nAnd then-\n\nLenny Rachitsky (01:17:40):\nI love this.\n\nMatt LeMay (01:17:43):\nIt's getting that conversation out in the open, and getting people to talk about their perspectives and their expectations, with the goal of bringing it together, to create something better.\n\nLenny Rachitsky (01:17:55):\nBam. Matt, is there anything else that you wanted to cover or leave listeners with before we get to a very exciting lightning round?\n\nMatt LeMay (01:18:03):\nI think we covered it. I just leave people with, again, this hope that you can start to see the commercial realities and constraints of your business as opportunities, as guideposts, as things that shape and structure your work, not as things that you single-handedly need to change, or break down, or transform, because you probably can't. And that's okay.\n\nLenny Rachitsky (01:18:31):\nThat's empowering stuff. With that, we've reached our very exciting lightning round. Are you ready?\n\nMatt LeMay (01:18:37):\nAs ready as I'm going to be.\n\nLenny Rachitsky (01:18:39):\nQuestion one. What are two or three books that you find yourself recommending most to other people?\n\nMatt LeMay (01:18:43):\nRadical Focus, by Christina Wodtke, is obviously, I cite it a lot in my book, I think it's the best book about OKRs. I love her style of writing. I love the way she tells stories.\n\n(01:18:56):\nI love the focus on focus, this idea that again, the way you do it is less important than the result of the way of doing it. I just find that so inspiring, always.\n\n(01:19:08):\nThe other book, this is a bit of a curveball, is by Alan Watts, the Buddhist philosopher. It's called The Wisdom of Insecurity. And a lot of the way I talk about control, and giving up control, comes from that book.\n\n(01:19:23):\nIt also has a concept. It opens with a concept called the law of reverse effort, which is that sometimes, the harder you try, the worse you make things. When it comes to setting goals, doing OKRs, doing strategy, I think about this a lot, that there is a tendency sometimes to put effort towards the overcomplication of things, which in turn makes those things less effective, what they're ultimately intended to achieve. So, highly recommend that book. It helped me a lot through some dark times, mentally.\n\n(01:19:59):\nThere's an idea in the book. He talks about how trying to keep yourself perpetually safe in an imagined future is effectively killing yourself to the present. And ooh, that hit hard. That hit me really, really, really hard. So, highly recommend that book.\n\n(01:20:18):\nIf the things we've talked about today make you even a fraction of, as anxious and fearful as they make me when I navigate them in my work, then I highly recommend The Wisdom of Insecurity, by Alan Watts.\n\nLenny Rachitsky (01:20:32):\nI was going to ask what the title is, because that sounds really powerful. Amazing, amazing pick.\n\n(01:20:37):\nSecond question, do you have a favorite recent movie or TV show you've really enjoyed?\n\nMatt LeMay (01:20:41):\nGod. So especially, when I'm in work-y write-y mode, my brain shuts off to all things that are not trash. So I have been watching a lot of trash.\n\n(01:20:53):\nI watched Temptation Island, the new season of Temptation Island on Netflix. I loved it so much. It's Mark L. Wahlberg, who is the host of Antiques Roadshow, just weaponizing therapyspeak to torture people, in this bizarre scenario.\n\n(01:21:15):\nAnd I should not love it, but I am only a human, and a messy bitch who lives for the drama, sometimes, so ...\n\nLenny Rachitsky (01:21:25):\nSo good.\n\nMatt LeMay (01:21:26):\nI know. I enjoyed that very much.\n\nLenny Rachitsky (01:21:27):\nI think it's the first Temptation Island call-out, and I love it. Okay, favorite product or ... Yeah, favorite product you've recently discovered, that you really love?\n\nMatt LeMay (01:21:37):\nYeah, so I'm really glad you asked this question, because as a musician, I live in this world of niche products, which is so much fun, because the economies of scale for music creators are just totally different, right?\n\n(01:21:48):\nYou don't need to build a product that's going to have a billion users, and create a huge return. You can do something that a few hundred or a few thousand people get a lot of use out of and love. You're in this fun realm of hybrid, physical and digital, and different types of things. And when you asked me this question, the first thing that came to mind was this, which is made by an amplifier builder who goes by Milkman Sound, in the San Francisco Bay area, who took, basically, the circuit of a Fender amplifier, and made a version of it that fits into this handy, compact, lightweight form factor.\n\n(01:22:35):\nSo for me, as somebody who is no longer 22 years old, and still occasionally tours with my friend's band, and has back problems, the fact that I can carry this really powerful amplifier around, in this really well-designed, aesthetically pleasing form factor, just feels like such a joy. It's one of those products that really understands what quality means to its particular audience.\n\n(01:23:09):\nAnd I can go on tour, and have things sound really nice, without having to lug a giant, heavy thing. And I love that. It's something for which I am truly grateful.\n\nLenny Rachitsky (01:23:24):\nThis makes me want to play music randomly, but just so I understand how this works, do you still plug that into a speaker, or is that-\n\nMatt LeMay (01:23:30):\nYeah, so I have a little speaker.\n\nLenny Rachitsky (01:23:32):\nOkay. Oh, okay.\n\nMatt LeMay (01:23:32):\nYou can also plug direct into the soundboard at a club, or for recording.\n\nLenny Rachitsky (01:23:36):\nOkay, got it.\n\nMatt LeMay (01:23:37):\nAnd it has a little headphone jack, too. So if I want to practice in the hotel room, before you play, I can also use this.\n\n(01:23:45):\nIt does everything you would need this device to do, and nothing more, and it does it really well. And that is so delicious to me, to have a product-\n\nLenny Rachitsky (01:23:59):\nAnother great pick.\n\nMatt LeMay (01:24:01):\n... that I'm like, \"This does exactly what I need. It does it so well, and it's a delightful product.\"\n\nLenny Rachitsky (01:24:11):\nTwo more questions. Do you have a favorite life motto that you often come back to, find useful in work, or in life?\n\nMatt LeMay (01:24:17):\nI come back to something my mom told me. I'm sure you've experienced this, too. When you're a person creating things in the world, there's a tendency to look at the numbers, and look at, \"How am I doing? And did this resonate? Is this good? Did this work?\"\n\n(01:24:31):\nAnd I've definitely worked on things, especially in my musical life, where the amount of effort and love, and time and care that went into something, didn't feel like it showed up in the result of that thing, or the way it was received.\n\n(01:24:48):\nI was talking to my mom about this once, and she said, \"I really believe that no good work is wasted. Even if you don't see it right away, when you put good work out into the world, even if it only finds a few people, it's never wasted. If you do work you really believe in, it's going to have some positive effect on the world.\"\n\n(01:25:10):\nAnd that really stuck with me. I've carried that with me, even when I think about how to write, and what to say, and when I start to worry about outsmarting myself, and should I be more strategic in the way I message this, and should I say something I don't really totally believe?\n\n(01:25:34):\nThere've been a few times, not recently, but a few times, 10 years ago, where I dabbled in writing click bait-y headlines, because I was like, \"Ooh, is this going to get more attention?\" And there was one in particular, that got really thoughtful critique from some people I really respect.\n\n(01:25:49):\nI was like, \"I don't want to do this. I don't want to put work I don't believe in out into the world,\" and even if it doesn't do what I hoped it would do, I'm going to go forth with the belief that no good work has wasted.\n\nLenny Rachitsky (01:26:03):\nI totally believe that. Final question. You wrote a ton of music reviews over the years. I'm curious if there's one that was just very, people super disagreed with it, or just one that you're super proud of?\n\nMatt LeMay (01:26:19):\nI mean, I am a villain, in certain corners of the internet-\n\nLenny Rachitsky (01:26:22):\nSay more.\n\nMatt LeMay (01:26:23):\n... for the review I wrote of Liz Phair's self-titled album. I wrote this review when I was 19, when my worldview was toxic, and very much in progress. It was a really condescending, arrogant review, written from a place of unearned condescension and arrogance.\n\n(01:26:46):\nNot that condescension and arrogance should necessarily be earned, but it felt righteous at the time, in a way that is dangerous, right? That toxic righteousness where you're like, \"I'm fighting something bad.\" But then you realize that what you're fighting is not actually bad.\n\n(01:27:09):\nYou're actually punching sideways and down, but you don't have the wherewithal and the maturity to realize that you are not where you think you are, in relation to people and culture, and yourself. So I apologized for that review in 2019, and Liz Phair and I actually had a really nice little Twitter back and forth.\n\n(01:27:34):\nThis was back when Twitter was still a place where this kind of thing could happen, and it was nice to wrap that up in that way. I still don't feel good about it, because it was playing into some really toxic and hurtful dimensions of discourse.\n\n(01:28:06):\nBut what can you do, if not look back on it and say, \"Yeah, I was wrong. I was just flat-out wrong, and beyond being wrong, I was being a jerk.\" Somebody posted this, a meme creator on Instagram, posted that review a couple months ago, with a caption, \" Matt LeMay, you will be dealt with.\"\n\n(01:28:31):\nAnd I was like, \"Yeah, yeah. If I read that now, I would probably say something pretty similar.\" So I think, as I said, I'm a conflict averse people pleaser.\n\n(01:28:48):\nI went through my kind of edgelord phase. And I don't think it did any good for me, or for anyone else.\n\nLenny Rachitsky (01:28:57):\nWow. That was a much more profound answer than I expected. I can't believe people are still referencing this review from a long time ago. How many years? How ...\n\nMatt LeMay (01:29:08):\n22? It was 2003, so it was 22 years ago. It was more than half my life ago. But this is the wild thing, is that on the internet, it still looks new.\n\n(01:29:19):\nThe first talk I ever gave, in London, actually, was at a Red Monk event, and I brought my teenage diary with me, to make the point that if something has 10 years of age on it as paper, it's contextualized by its own material existence, right?\n\n(01:29:36):\nBut somebody will go, \"Oh, I wonder what Pitchfork thought of this record,\" they'll see my jerk-ass review, and be, \"Pitchfork published this jerk-ass review. Who was the jerk-ass reviewer who wrote it?\"\n\n(01:29:48):\nAnd they'll find me, and be like, \"Hey, you, you're a jerk-ass, because you wrote this jerk-ass review.\" And I'll be like, \"Yes, I did write that jerk-ass review, from the place of being a jerk-ass.\" But I like to think I am a person who has lived 22 years of life since then.\n\nLenny Rachitsky (01:30:11):\nYour frontal cortex has developed more since then. I think it doesn't stop-\n\nMatt LeMay (01:30:13):\nGod, I hope so.\n\nLenny Rachitsky (01:30:14):\nUntil 25, 26. Matt, this was awesome. We covered so much ground. We've touched on everything I was hoping to, and more.\n\n(01:30:22):\nTwo follow-up questions. Where can folks find you online, talk about the sort of work you do with companies, and how can listeners be useful to you?\n\nMatt LeMay (01:30:29):\nYeah, so you can find me online at matlemay.com, pretty straightforward, and in terms of how folks can be useful to me, hopefully I can be useful to them, whether that's through the books, or through coming into work with your company, and help your teams focus.\n\n(01:30:47):\nI find that facilitating these conversations is a really big value add. It's hard to have these conversations to do this without some outside help sometimes. So again, whether it's in book form or in me form, I hope that I can be useful to you, and having these conversations in a way that's less scary, more accessible, and leads you down that road to doing impactful work.\n\nLenny Rachitsky (01:31:11):\nAwesome, and mattlemay.com. And then, what's the name of the book? Where do they find it\n\nMatt LeMay (01:31:15):\nImpact-First Product Teams. You can find it at all the places where you find books, on Amazon. There's an author read audiobook, which I recorded right here in this room, with this microphone. I did all the musical interludes myself ...\n\nLenny Rachitsky (01:31:28):\nWhy?\n\nMatt LeMay (01:31:30):\nBecause it was a great way to procrastinate, when I did not actually want to read the book. But I hope you will find it fun.\n\nLenny Rachitsky (01:31:39):\nMatt, thank you so much for being here.\n\nMatt LeMay (01:31:41):\nThanks so much, Lenny. This was great.\n\nLenny Rachitsky (01:31:43):\nBye, everyone.\n\nSpeaker 1 (01:31:44):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app.\n\n(01:31:52):\nAlso, please consider giving us a rating, or leaving a review, as that really helps other listeners find the podcast. You can find all past episodes, or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "这就是在企业工作的现实，对吧？\n\n(00:08:02):\n如果你对企业的贡献是整个企业能够理解的，是CEO能够理解的，是CFO能够理解的，如果你的团队对企业来说是一项好的投资，那么企业就会继续进行这项投资。\n\n(00:08:16):\n如果你的团队对企业来说不是一项好的投资，或者你并不真正知道你的团队是否是一项好的投资，但你觉得反正自己在工作，所以应该没问题吧，那么这会让你处于一个非常不稳定的位置，而且我认为我们最近都见证过这种情况对所有人来说都没有什么好结果。\n\nLenny Rachitsky (00:08:36):\n那么，这是对什么的反应呢？因为我想很多人听到这些会想，\"当然，PM、产品团队我们正在推动业务影响，这就是我们存在的意义啊。\"\n\n(00:08:44):\n但实际上在大多数情况下并非如此。所以首先，这到底是对什么的反应？是对人们说\"哦，我们只是要打造优秀的产品，我们要倾听客户\"的反应吗？聊聊这个问题的另一面。\n\nMatt LeMay (00:08:55):\n我觉得有几个方面。我认为主要原因就是现在有更多的产品经理和团队被裁员了。这是一个非常可怕的现实。\n\n(00:09:05):\n如果你看看CEO们在裁员时传达的信息，有些信息是相当明确的。\n\n(00:09:13):\nSpotify的Daniel Ek在2024年裁员时发出的信息说：\"我们仍然有太多团队在做围绕工作的工作和支持性工作，而不是专注于真正有影响力的机会。\"\n\n(00:09:25):\n这真的触动了我的神经，因为我以前就在那些支持性团队里工作过。我做过围绕工作的工作。而且我曾经以为，如果公司让我做围绕工作的工作，那肯定是对业务至关重要的，否则他们不会雇我来做这个。\n\n(00:09:40):\n我认为这不是一个安全的假设。特别是考虑到我们不再处于零利率环境，雇用和留住员工的成本很高，公司都在寻求节省成本，我认为我们正处于这样一个时刻：每个产品团队和每个团队成员真的有责任去理解、阐述并朝着自己工作的顶层业务影响努力。\n\nLenny Rachitsky (00:10:12):\n很好。所以这个问题的来源是，第一，如果你没有在推动直接促进业务增长的事情，你对公司的价值就没那么大。你就是那种会被裁掉的人。\n\nMatt LeMay (00:10:12):\n对。\n\nLenny Rachitsky (00:10:23):\n还有找工作的另一面。感觉如果你在简历上展示了影响力，\"这是我推动的所有影响\"，这也能帮你找到工作。对吗？\n\nMatt LeMay (00:10:31):\n完全正确。是的。我是说，这是我看到的最常见的简历建议，就是展示数字，展示影响，说出你做了什么。\n\n(00:10:40):\n我有个朋友做简历辅导，几年前我给她看了我的简历。她说：\"我很喜欢你的简历，除了一点。你为什么写得像个小女孩？说出你做了什么，说出你的贡献。不要说'我帮助了'或'我可能也许帮助人们做了这个'。说出影响，把数字写上去。\"我想我需要从她那里听到这个，因为我觉得确实有这样的倾向，特别是对于我们这些真正在协作环境中茁壮成长的人来说，我们的本性是不想为只有通过许多具有不同经验和视角的人的贡献才能存在的工作邀功。\n\n(00:11:22):\n真的很难说\"嗯，这是我做的，我为那个做出了贡献\"，但这也是我为什么从团队层面写这本书的部分原因，因为我认为对于像我这样真正享受并在团队环境中茁壮成长的人来说，如果你能把产品团队看作影响力的基本单位，并说\"我们交付了这个。我们能够共同努力，为业务产生这样的影响\"，这感觉真的很好，也直接反映了那个团队一起完成的工作。\n\nLenny Rachitsky (00:11:49):\n这是一个非常有趣的洞察。我认为很多这种情况源于PM天生就被训练要转移功劳，在所有事情上都说\"我们\"，说这个人做了那个。所以我理解这是从哪里来的。所以大多数听众可能还是会想，\"是的，我在推动影响，我很棒。我这里没有问题。我不需要改变，不需要改变任何东西。\"有什么方法可以压力测试你的想法？也许可以问自己或你的团队一些问题，比如\"好吧，也许我没有在推动影响？\"\n\nMatt LeMay (00:12:17):\n所以我问大多数合作团队的第一个问题是：如果你是这家公司的CEO，你会完全资助你自己的团队吗？\n\n(00:12:29):\n这是一个小问题，但可能会引起一些大反应。因为对我来说，当我作为产品经理工作时，我真的相信我的工作就是找到下一个最站得住脚的东西来构建，构建它，庆祝它，找到下一个最站得住脚的东西来构建，如此循环往复。永远重复下去。\n\n(00:12:53):\n我有点假设我的团队的存在是宇宙中这个正当的事实，对吧？我的团队会一直存在，这只是我们找到下一个要做的事情的问题，这意味着做发现工作，对领导层想要的东西做出让步，做所有那些利益相关者管理的事情。\n\n(00:13:13):\n但我的团队对业务来说是有成本的这个想法，在某个时候可能有人会在电子表格上看着我的团队说，\"这些非常昂贵的人是谁？我们为什么需要他们？我们真的需要他们吗？\"这些想法根本没有出现在我的脑海中，因为我不在那些对话的房间里。那不是我思考团队工作的方式。\n\n(00:13:34):\n所以我喜欢问这个问题，因为这是一个视角转换。它让你思考，如果你个人要对这个业务的存亡级市场成功负责，你会投资你的团队吗？\n\n(00:13:52):\n坦白说，我问这个问题的大多数人不会马上知道答案。他们不确定。他们说，\"我想会吧\"，或者\"是的，是的。是的，因为...\"然后你可以看到齿轮在转动。\n\n(00:14:05):\n再次强调，对我来说这是一个有风险的情况，因为如果你作为团队成员不能回答这个问题，组织中没有其他人会比你更有资格回答这个问题。\n\n(00:14:19):\n所以把这个问题带给团队，主动地、协作地提出和回答它，并准备好说，\"好的，如果我们不能自信地回答这个问题，我们需要做出什么改变？我们需要改变我们的职责范围吗？我们需要改变我们的目标吗？我们需要和谁谈？我们需要做什么才能实现这一点，才能自信地回答这个问题？\"我们在团队层面进行这种对话要比等着别人为我们或对着我们进行这种对话好得多。\n\nLenny Rachitsky (00:14:50):\n所以这里的信号是，如果你不能自信地说\"是\"，问自己这个问题或让你的团队讨论这个问题并有一个明确的答案，可能存在一个你需要解决的潜在问题？\n\nMatt LeMay (00:15:01):\n完全正确。我认为就是这样，是的。\n\nLenny Rachitsky (00:15:04):\n我们会谈论实际要做什么以及你建议解决这个问题的步骤，但我想继续谈谈影响力，因为有时需要一段时间才能说服人们，\"好的，我真的需要这样做\"，而不是\"好的，这是做这件事的方法。\"\n\nMatt LeMay (00:15:15):\n是的。直到现在，直到写这本书，我才被说服，而且我仍然觉得有时我需要被说服一点。\n\nLenny Rachitsky (00:15:22):\n我认为裁员对人们来说是一个非常好的说服手段。\n\nMatt LeMay (00:15:26):\n是的。\n\nLenny Rachitsky (00:15:26):\n他们看到所有这些PM被裁员，就会想，\"我怎么避免这种情况？\"而这基本上就是答案，这就是你如何避免被裁员。\n\n(00:15:33):\n你在这里描述的内容有一个有趣的含义，你鼓励PM和产品团队像CEO一样思考。\n\n(00:15:39):\n这涉及到我一直想写的东西，但还没写，就是很多人在争论PM是迷你CEO吗？\n\n(00:15:46):\n在我看来，PM 100%是迷你CEO，因为他们像CEO一样思考，或者在团队中应该这样。他们是一样的；他们的工作就是在团队中像CEO一样思考业务。\n\n(00:16:03):\n显然他们不负责所有人。他们不能让任何人离开。汇报线不一样。但我觉得这对PM的工作来说是一个非常好的视角，就是你就像团队中的迷你CEO，确保你在构建正确的东西，思考业务，解决真正重要的问题。\n\nMatt LeMay (00:16:19):\n我认为我已经形成的想法是，产品经理负责让整个团队像CEO一样思考，如果这样说有意义的话。\n\nLenny Rachitsky (00:16:26):\n我喜欢这个。\n\nMatt LeMay (00:16:27):\n所以如果产品经理把这当作他们唯一的责任，说\"我是迷你CEO。我思考业务\"，那就错失了一个机会。\n\n(00:16:35):\n在我的咨询工作中，通常是工程师能够真正为团队达到那个具体的影响级别目标，有时甚至比产品经理更早做到，因为工程师是在系统中思考，他们在思考，\"好的，我了解这个系统，我了解那个系统。我和这个人进行过这样的对话。\n\n这意味着什么呢？这意味着在公司内部，构建任何东西都会变得困难得多，对吧？因为每当你想构建什么东西时，就有10个产品团队需要管理依赖关系，所以公司开始增加项目管理层。他们会说：\"我们的会议太多了。我们需要为项目管理重组，因为重组能解决一切问题，我们需要确保有所有这些层级，让大家保持连接，做好依赖管理。\"但是随着你增加越来越多这样的东西，做高影响力工作就变得越来越难了。\n\n(00:26:33):\n引擎盖变得越来越重，这反过来又让团队越陷越深地掉进低影响力工作的兔子洞。低影响力工作会催生更多低影响力工作。你做的低影响力工作越多，就越难做高影响力工作，你就越有可能去做低影响力工作，如此循环往复。它会一直持续下去，直到下一轮裁员，这是个真实存在的问题。\n\n(00:27:01):\n我在几乎所有合作过的公司都经历过这种情况，非常有趣的是，我看到打破这个循环往往取决于个别产品团队是否有足够的勇气去审视自己的工作，看看什么对业务真正重要，然后说：\"你知道吗？我们不会再冒险成为一个低影响力团队了。我们要主动寻找高影响力的工作并交付成果，即使这意味着我们必须与很多其他团队协调。即使这意味着高管团队会对我们的工作产生很大兴趣。我们要把这些看作是我们所做工作很重要的信号，而不是把它们当作完成工作的障碍。\"\n\nLenny Rachitsky (00:27:47):\n正如你刚才暗示的，这里有一个很大的含义，即使高管让你构建一个他们非常兴奋的东西，但在你看来是低影响力的，这也不是借口。你最终还是会被解雇，尽管他们让你去构建它。这很糟糕，但现实就是如此。\n\nMatt LeMay (00:28:04):\n有趣的是,我在MailChimp被Intuit收购前与他们合作了三年,当时他们正处于一个非常有趣的转型期,从单一产品公司转向平台公司,这是很多公司都在经历的旅程。他们在市场的某个领域获得了成功,然后说:\"你知道吗?我们意识到横向发展、为用户提供一套可以使用的工具是有价值的。我们想要构建这些工具,真正确保我们能满足中小企业客户的需求。\"\n\n(00:28:34):\n所以在他们进行重组后不久,我就被引入了。他们采用了域模型。他们有不同的团队,这些团队应该是这个营销平台不同部分的专家,负责构建新功能。他们的产品副总裁Natalia Williams,后来成为了CPO,她说:\"我们这样做很好,但我担心我们会忽视商业基本面。我们有这些团队在构建非常酷的东西,我们也很明确地表示,我们对那些致力于创新、构建新东西、搭建平台的团队感到兴奋,但让我们确保始终关注整个平台以健康和可持续的方式增长。当我们添加这些新功能时,不要让它变得如此拥挤和复杂,以至于人们更难从中获得价值。\"\n\n(00:29:31):\n所以她为产品团队设定了一个非常明确的目标。她希望在成功发送第一封邮件的用户比例上实现特定的提升。她说:\"当我们构建这些新东西时,邮件仍然是人们的入口。我们要确保他们能够成功完成这个操作。\"她为整个产品组织设定了一个非常有雄心的目标。她把这个目标提交给产品团队,很多产品团队出于各种可以理解的原因,对接手这个任务犹豫不决。他们说:\"如果我们搞砸了,那就是整个业务的商业核心。风险太大了。\"\n\n(00:30:12):\n其他人说:\"这很好,但我们正在构建平台的这些新部分,这些非常重要。我们不想冒险拖慢那些东西的进度。\"有一位我合作过的产品经理,她真正理解这有多重要。她当时已经在应用的不同部分工作过足够长时间。她曾在增长团队工作过,所以她真的具有那种以用户为中心的思维方式,思考如何达成我们需要达成的指标。她来找我说:\"我想确保我们做到这一点,因为我担心如果我们不做会发生什么,对吧?我不想成为未能交付对业务最重要事项的产品团队。\"\n\n(00:30:53):\n所以她去与一些用户研究人员合作,找出人们卡在哪里。她做了这个很棒的研究,发现人们在发送第一封邮件之前在哪里卡住了,然后她召集了一群产品经理。我永远不会忘记这一幕。我当时在亚特兰大现场,她召集了一群产品经理,说:\"看,如果我们要达到这个目标,这些是我们需要修复的问题,但如果我们修复这些问题,我认为我们能做到。我认为我们能达成目标。\"然后是一阵沉默,出于完全可以理解的原因,人们说:\"好的,这很好。我明白了,但我有点担心如果我们这样做...\"这位产品经理,我永远不会忘记。\n\n(00:31:34):\n她环顾房间说:\"你知道吗?如果你们不接受这个任务,我会在你们的梦里缠着你们。这对业务来说是最重要的事情。\"每个人都笑了。这是一个很强硬的表态,但这是一个出于真诚善意的强硬表态,我认为它以自己的方式承认了人们对接手这件事的恐惧。她说:\"看,这真的很重要,如果我们一起努力,如果我们少关心我们域的限制、参数和边界,更关心我们如何合作来交付我们的领导告诉我们对业务最重要的东西,我们就能完成这件事。\"\n\n(00:32:15):\n他们确实做到了,而且他们是通过做减法来实现的。他们简化了体验。他们删除了人们卡住的步骤。他们让事情变得更简单。他们做的这些事情很少像传统的功能发布那样被庆祝,但因为他们对成功的样子有清晰、有影响力、具体的认识,他们能够自己承担这项工作,这让产品变得更好,让业务变得更好,这是与一个优秀团队合作的美好时刻。\n\nLenny Rachitsky (00:32:48):\n这是一个很棒的例子。我喜欢这个例子是如何成为一段英雄之旅的。沿着这个思路,有趣的是做这件事需要多大的勇气。因为就像你说的,简单的做法就是:\"好的,每个人都让我们做这件事。我们要构建这个功能。很好,很简单。我不需要冒头。\"而你指出的是,要由你来认识到你所做的不是高影响力的工作,并有勇气推回去并建议别的东西。\n\nMatt LeMay (00:33:15):\n有趣的是,这是勇气,但也是一种对现实的彻底接受。这个对话有一个非常情感化的哲学维度,因为我认为不想为我们控制之外的事情负责是人类的本性。影响力不是我们可以从清单上勾选掉的东西。如果我们真的在努力实现业务影响,那意味着市场上可能会发生一些会影响我们的事情,对吧?我们的竞争对手可能会推出一些东西,可能会有疫情或战争或我们没有预料到的事情。我们依赖客户改变他们的行为,转化或升级或做我们希望他们做的任何事情。\n\n(00:33:58):\n我用\"希望\"这个词,因为我们可以尽力影响这种行为,但我们不能只是勾选一个复选框。我认为人们对为超出我们控制范围的事情负责有一种非常可以理解的恐惧。我非常理解这一点,但我认为过去几年向我们展示的是,我们确实要为超出我们控制范围的事情负责。我们工作的企业的成功最终超出了我们的直接控制。\n\n(00:34:26):\n你可以遵循所有最佳实践,拥有最高的速度,把一切都做\"对\",但如果你的公司倒闭了,他们不会说:\"是的,我们要倒闭了,但我们会继续给你发两年工资,因为你所有的OKR都是0.6或0.7。\"事情不是这样运作的。现实是,超出我们控制范围的事情会影响我们,我认为如果我们能内化这一点,其中有一种真正的自由。在研究这本书时最让我惊讶的是,我采访的具有商业意识的产品经理也是最快乐的,这是我完全没有预料到的。\n\n(00:35:06):\n正如你所说,我来自音乐背景。我原本期望做业务的人会非常焦虑,像是\"我必须每天在工作上花92个小时来全力以赴,确保我们达到指标,粉碎数字。\"但他们就像,\"是的,我为一家企业工作,我尽我所能,然后我就回家。当我在工作时,我的工作就是帮助业务成功。我通过了解我们的商业模式,努力做对业务有贡献的工作来实现这一点。\n\n为了做到这一点，如果我的目标真的是影响层面的目标，我就必须了解我们的客户。我必须做发现工作，我必须做所有这些我们应该做的事情，不是因为它们是抽象的最佳实践，而是因为这就是你打造成功产品的方式。\"\n\n(00:35:49):\n\"到头来，我不是在和公司对抗，要求用正确的方式做产品，如果他们做不到，我就愿意为此而战。而是，'我为一家公司工作。我不能做每一个决定。有些事情不在我的控制范围内。我会尽力而为，然后我可以腾出一点精力去过我的生活。'\"\n\nLenny Rachitsky (00:36:12):\n为了让这听起来不那么可怕，希望如此，我很好奇你的答案会是什么。你是否发现，那些迈出这一步、推动并试图改变团队思维方式和工作重点的人，即使他们失败了，即使影响没有达到，项目失败了，他们反而会更受好评，他们的职业生涯最终会发展得更好，即使项目失败了，他们最终也会做得更好?\n\nMatt LeMay (00:36:36):\n我希望如此。我总是，再次强调，这不在我的控制范围内。我不能说，如果你做了这些事情，那么管理你的人就会对你刮目相看，因为我不认识那些人，也许他们不会有好的反应。也许他们实际上不是……人们并不总是理性的，这些事情并不总是按你希望的方式发展。我要说的是，在《Impact-First Product Teams》这本书里有一个故事，讲的是有人为一个约会应用工作，他们被分配了一个项目，这个项目有一个非常具体且雄心勃勃的收入目标。在某个时刻，很明显他们可能无法实现这个目标，因为他们需要做其他事情。\n\n(00:37:15):\n所以他们去找财务团队说，\"嘿，我们必须调低这个目标。\" 财务团队说，\"是的，当然要调。这说得通。让我们一起调整。\" 如果他们没有主动采取这一步骤，说\"基于更广泛的世界、市场和我们产品中正在发生的事情，我们不再相信我们能够实现这个目标，但我们想要调整，这样整个公司可以做出更好的预测并相应地分配资源\"，这次对话还会以同样的方式进行吗?\n\n(00:37:42):\n我不知道。但我认为，如果你拥抱这样一种心态——有些事情不在你的控制范围内，你的工作是从你所在的位置尽你所能为业务的成功做出贡献——我认为你诚实地告诉业务你认为可能发生什么，比退缩说\"哦，好吧，如果我们谈论它，我们会惹上麻烦，没有人会相信我们\"，要有价值得多。仅仅是简单地隐瞒信息本身就会造成一种伤害。所以我不能保证任何结果。我不能说，\"是的，在所有情况下这都会被宽容和优雅地接受\"，但我认为这是正确的做法。\n\nLenny Rachitsky (00:38:29):\n我的感觉是，要么你会更受尊重，因为你在为人们解决问题，比如你看到的高层，那些他们应该看到的东西，而你是对的，他们会说，\"哦，哇，Matt 太棒了。他看到了所有这些，并做出了改变。\" 或者你会意识到这不是适合我的公司。他们不重视这个。他们只想让我交付这个小功能，这就是他们想要我做的全部。我可以在其他地方做更多事情。\n\nMatt LeMay (00:38:56):\n嗯，我认为你提到了一个非常重要的点，那就是当你理解商业模式时，你就理解了你工作的公司的现实世界伦理和优先级，对吧?如果你理解公司在优化什么，他们真正关心什么，他们愿意做出什么样的权衡和牺牲来实现这些目标，这比使命宣言告诉你的多得多。使命宣言通常听起来很好，但如果你跟着钱走，跟着决策走，有时它会描绘出不同的画面。\n\n(00:39:28):\n我认为你越能理解商业模式如何运作，价值交换是什么，什么价值被交付，什么价值被提取，我认为这让你处于更好的位置来决定，如果我帮助公司取得成功，我对此感觉良好吗?我觉得这是一家如果实现其目标就会让世界变得更美好的公司吗?我认为你越理解商业模式，你就越有能力在掌握所有可用信息的情况下做出这些决定。\n\nLenny Rachitsky (00:40:05):\n这是一个非常重要的观点。\n\n(00:40:07):\n今天的节目由 Anthropic 赞助，Claude 背后的团队。我每天至少使用 Claude 10 次。我用它来研究我的播客嘉宾，为我的播客和新闻通讯头脑风暴标题想法，获得对我写作的反馈以及各种各样的事情。就在上周，我在为一位非常重要的嘉宾准备采访，我让 Claude 告诉我，其他播客主持人问过这位嘉宾的所有问题是什么，这样我就不会问这些问题了。你每周花多少时间试图综合你所有的研究洞察、支持工单、销售电话、实验结果和竞争情报?\n\n(00:40:43):\nClaude 可以处理极其复杂的多步骤工作。你可以向它扔一份 100 页的战略文档并要求它提供洞察，或者你可以倾倒你所有的用户研究并要求它找到模式。通过 Claude 4 和新的集成，包括 Claude 4 Opus，世界上最好的编程模型，你可以获得语音对话、高级研究能力、直接的 Google Workspace 集成，以及现在可以连接到你的自定义工具和数据源的 MCP。Claude 就成为你工作流程的一部分。如果你想试试，可以在 claude.ai/lenny 开始，使用这个链接，你可以获得专业版计划前三个月令人难以置信的 50% 折扣。那就是 claude.ai/lenny。\n\n(00:41:24):\n好的，让我们转向讨论如何实际操作，该做什么。这个概念是无论你的公司如何运作，你都可以采取的行动。第一部分真的很重要。我看到你非常坚持的一件事是，你不让人们有借口不推动这个。我们已经用其他方式讨论过这个，但也许再多分享一些，就像无论你的公司如何运作，你都没有借口不深入思考这个问题并尝试做出改变。\n\nMatt LeMay (00:41:51):\n是的,我的意思是,现实情况是,产品经理工作的大多数公司并不是大型科技公司。当我在这些公司与产品团队合作时,在保险公司、银行、消费品公司,或者我之前与一家制造音频设备的公司合作,这对我来说显然很有趣,他们通常首先告诉我的是,\"嗯,我们不能用正确的方式做产品,因为我们是受监管的行业\",或者\"因为我们是 B2B\",或者\"因为我们有需要达到的季度收益目标\"。\n\n(00:42:22):\n这总是让我有点难过,因为是的,有一种看待方式,你可以说,\"好吧,如果这五家著名公司用正确的方式做产品管理,那么任何让我们处于与这些公司不同情况的事情都必然意味着我们在用错误的方式做产品管理\",这令人沮丧和痛苦,而且再次,导致人们进行这种堂吉诃德式的战斗,比如\"我必须把一家银行变成一个搜索引擎\",这是不会发生的。\n\n(00:42:49):\n但另一种看待方式是,这些约束就是你做产品管理的方式。这些就是指导你应该做出的商业决策的东西。如果你受监管,你的竞争对手也受监管。如果你能真正理解这些约束,找出如何在其中良好地工作,这对你的业务来说是一个巨大的商业优势。如果你是 B2B,老实说,在很多情况下我更喜欢与 B2B 公司合作,因为他们可以如此直接地接触到他们的客户,他们可以理解客户和用户的整个系统,以及这些东西如何以一种真正即时和可操作的方式连接。\n\n(00:43:24):\n同样,如果你的公司有季度财务目标要达到,恭喜你,你知道业务真正关心什么。你不必比这更进一步寻找。如果你能做直接为公司最关心的事情服务的工作,你不一定需要将其分解为 10 个不同层级的 45 个 OKR。\n\n(00:43:47):\n所以是的,这些都是约束,但它们是塑造我们工作的约束。如果我们接受它们,如果我们将它们视为指南而不是限制,如果我们说我们与我们业务的商业现实合作而不是对抗,我们可以做很多事情。如果我们再次与我们工作的公司的现实合作而不是对抗,产品经理、产品负责人、项目经理,每个在每个组织中从事产品工作的人都可以做很多事情。\n\nLenny Rachitsky (00:44:23):\n好的。所以我认为这真的很赋能。你不是在说,\"你需要改变你公司构建产品的方式。这取决于你。你是一个 IC PM,这取决于你。没有借口。\" 用一种简单的方式来描述你实际在说什么,我认为这会让人们感觉好得多?\n\nMatt LeMay (00:44:38):\n我实际上在说的是,你认为你在对抗的东西通常是给你的工作赋予形状的东西,如果你让它们这样做的话。\n\nLenny Rachitsky (00:44:50):\n太棒了。\n\n我们来谈谈，你有三个步骤，三个便捷的步骤来让团队更加以影响力为先。那我们来逐一讨论。第一步是什么？\n\nMatt LeMay (00:44:59):\n好的，第一步，我认为也是最重要的一步，也是我很多工作的重点，就是设定团队目标，要贴近公司目标。最多与公司目标相隔一步。这个想法来自 Christina Wodtke 的书《Radical Focus》。她在你播客上有一期很棒的节目，我来之前刚重温了一遍找灵感。\n\nLenny Rachitsky (00:45:22):\n不错的做法。\n\nMatt LeMay (00:45:24):\n在那本书里，她有一个可视化图表，说大多数公司处理级联 OKR 的方式就像是多层级的，顶层是公司目标，然后是部门目标，然后是大团队目标，然后是小团队目标，再然后是更小的团队目标。这就导致了我之前描述的那种情况，你没法把这些小团队目标加起来得到公司目标。她有一个对比的可视化图表，把公司目标作为重心，然后所有其他团队目标在它周围环绕一层。我第一次看到这个的时候简直醍醐灌顶，因为无论你用的是 OKR 还是 KPI 还是北极星指标，不管你表面上用什么框架，如果你用得好，它看起来就应该是那样。\n\n(00:46:09):\n我之前和一个团队合作，他们是一家 FinTech 公司的传统功能团队。他们有点像我在 MailChimp 合作的那个团队，负责构建新功能，把这个产品打造成一个多产品平台。业务方会说，\"去构建这个。\"他们就构建，然后庆祝，然后业务方说，\"去构建这个。\"他们又构建，又庆祝。然后业务方说，\"好的，我们要换个做法。现在我们有一个收入目标。我们明年要多赚这么多钱，我们希望你告诉我们你打算如何为此做出贡献。\"\n\n(00:46:42):\n这对团队来说是一次非常有挑战性的对话，因为尽管人们抱怨成为功能工厂，但说实话，那样感觉更安全，对吧？你对此有更多控制权。如果有人告诉你要构建什么，你对能否构建出来的控制力，要比你对它能否产生收入的控制力大得多。所以我们开始讨论，我们应该用什么框架？我们该怎么做？我问的问题不是很好。说实话，我自己也有点慌。然后我问他们，\"好吧，这个团队为什么存在？我们到底为什么要做这件事？为什么业务要投资这么大一个团队来构建所有这些功能？我们为什么在乎是单产品公司还是多产品平台公司？\"\n\n(00:47:26):\n然后其中一位团队负责人说，\"哦，实际上，多产品用户的客户生命周期价值要比单产品用户高得多。\"我说，\"哦，我们知道高多少吗？\"他们说，\"知道，我们实际上有个具体数字。\"我说，\"哇。所以如果我们设定一个目标，把一定数量的单产品用户转化为多产品用户，我们就能确切知道涉及多少收入。\"他们说，\"是的，我想是这样。\"所以我们能够设定一个目标，然后我们讨论了需要达到什么数字才能让这个团队感觉是一项不错的投资？我们得出了一个具体的数字，然后——\n\nMatt LeMay (00:48:00):\n让这个团队感觉是一项不错的投资。我们得出了一个具体的数字，这个数字影响了该团队在这一年剩余时间里做出的每一个决策。我们说，\"到年底，我们需要将这么多单产品用户转化为多产品用户，因为如果我们做到了，就会有这么多额外收入，对公司的收入目标贡献这么多。\"这就是相隔一步。\n\n(00:48:22):\n当他们去向公司领导层分享这个目标时，领导们立刻就明白了。他们不需要说，\"为什么这个有价值？\"他们不需要说，\"你们的其他 OKR 是什么？给我们看看演示文稿。\"他们就是懂了。这给了他们很大的空间去做更大胆的决策，更紧密地与其他团队合作，申请他们需要的资源。而这个得出目标的过程，这个有影响力、具体、并且与公司最关心的事情相隔一步的目标，可能是我最近与团队一起度过的最有价值的时间。因为一旦你做到了这一点，你会看到其他一切都从那里流淌出来。\n\nLenny Rachitsky (00:49:01):\n这里的含义是，如果它离公司目标太远，以至于人们不理解你们到底在做什么来帮助业务？这就是你想要避免的问题。\n\nMatt LeMay (00:49:10):\n没错。\n\nLenny Rachitsky (00:49:11):\n所以一个极端是，我不知道，你的团队设定和公司完全相同的目标可能没有意义。比如你的公司试图增长一亿的收入，这不会是你团队的目标。所以这就像那个极端，与之相隔一步是什么？你对公司目标的贡献是什么？\n\n(00:49:29):\n另一个极端就是某个深达 10 层的目标，我们要提高这个随机步骤的转化率，这会增长这个东西，然后那个增长那个，最后增长收入。\n\nMatt LeMay (00:49:37):\n没错。\n\nLenny Rachitsky (00:49:38):\n你对以收入为基础的目标作为团队目标有什么指导意见？\n\nMatt LeMay (00:49:43):\n我认为，这还是要看情况。我知道人们对团队应该总是或永远不应该有收入目标有非常强烈的看法。我不认为这么简单。我认为有时候是的，如果你的公司正在追求收入，那么设定收入目标是有意义的，或者至少能够用收入来衡量你团队所做工作的价值。我和一些创业公司合作过，他们主动不追求收入，因为现在的重点是增长，对吧？他们想展示他们有足够的用户来筹集下一轮投资。我实际上和一家创业公司合作过，他们的收入在增长，用户数量也在增长，我们不得不进行一次非常有趣的对话，讨论哪一个对我们的投资者真正重要。我们最终制定了两个场景，高增长场景和低增长场景。\n\n(00:50:33):\n在与产品团队交谈时，非常清楚的是他们不可能达到高增长场景。所以他们转向专注于盈利能力，这样他们可以延长跑道，作为一个更小但有可持续收入基础的企业筹集下一轮融资。\n\n(00:50:46):\n所以我理解为什么人们对承诺收入目标犹豫不决。我认为确实存在收入目标过于宽泛或不完全符合业务需求的情况，但归根结底，金钱是衡量大多数团队影响力的方式。如果你对为什么你的团队是一项好投资没有观点，无论是它带来的金钱回报，还是对业务同等或更重要的其他回报，那么，这感觉又是一个不稳定和有风险的位置。\n\nLenny Rachitsky (00:51:25):\n为了让大家的思路朝着正确的方向发展。有哪些好目标的例子，比如你的团队设定的与公司目标相隔一步的具体目标？能举一些例子吗，不用说公司名字？\n\nMatt LeMay (00:51:38):\n我有一个故事可以讲，这也引出了第二步，就是在每一步都保持以影响力为先。\n\n(00:51:47):\n我曾与一家很受大众喜爱的科技公司的增长团队合作。我被请来帮助他们设定 OKR，对吧？公司全面推行 OKR，这个团队要设定它的增长 OKR。所以他们做了很多阅读，很多研究如何正确做 OKR。不幸的是，他们没有读《Radical Focus》，否则他们可能会以不同的方式做事，他们读了很多其他书。他们打印了很多文章，他们说，\"我们要确保做对这件事。我们要准备一个幻灯片，有 5 到 7 个目标，每个目标有 5 到 7 个关键结果，每个关键结果都会有一个负责人，我们要确保人们对此负责。我们真的、真的要用正确的方式做这件事。我们要把中间那部分做得完美。\"\n\n(00:52:39):\n所以他们花了很长时间制定这些 OKR,OKR 季结束了。他们把 OKR 文档归档，直到下一个 OKR 季才会再看。我们重新召集，花了一整天给所有 OKR 打分。关于什么是 0.6 还是 0.7 有激烈的讨论？这是 0.9 吗？谁真正应该是这个关键结果的负责人？谁对它贡献最大？我们完成了整个对话,每个人都累了。然后我说，\"我只需要问一个问题。很抱歉这样对你们,但这一切如何加起来等于公司层面的增长目标？\"\n\n(00:53:23):\n人们互相看看，他们说，\"嗯，这不是我们做的。我们设定了团队层面的 OKR,我们完成了流程,我们确保了,我们遵循了 OKR,我们考虑了 OKR,\"我说，\"是的，但公司有一个目标，比如说今年要带来一百万新用户。我们是增长团队。我们带来了多少用户？\"\n\n(00:53:50):\n一阵沉默。这个团队的负责人是一位非常非常好的领导者。她站起来说，\"好的，我们要换个做法。\"她走到白板前，在白板右端写上 100 万，画一条线，\"这是一年，\"在线上画一个小标记。\"这是我们现在的位置。\n\n我们应该用 ICE 吗？应该用 RICE 吗？还是用 MoSCoW？我做了一个 ICE 矩阵，给影响力打分，给确定性打分，给工作量打分，然后把每个分数相乘，列出了我们应该做的事情清单。\"\n\n(01:03:38):\n我说：\"这很棒。\" 我确实认为当有人主动去做这件事，说\"我整理了这个，我们一起过一遍\"时，这是很棒的。所以当他们给我看这个时，我说：\"我们从影响力开始吧。\" 他们说：\"好的，这是每一项的分数。\" 我问：\"这个分数是什么？\" 他们说：\"哦，是很多不同因素的综合。\" 我说：\"好吧，我们团队有一个具体目标，就是年底前需要转化特定数量的用户，所以让我们试着把影响力表达为与那个目标相关的函数。与其用一个抽象的分数，不如说在每个不同场景下，我们最多能转化多少用户？\"\n\n(01:04:18):\n可以理解的是，他们有点像：\"哦，你知道吗？我不太确定具体数字。\" 我说：\"我们一起推导一下。不需要很精确。这叫影响力估算，不是影响力完美数字获取。\" 所以对于其中一项，他们说：\"好吧，我们可以做这个落地页。\" 我问：\"好的，有多少人会访问这个落地页？\" 他们说：\"不多，可能几百人。\" 我说：\"好的，很好。那就是大概几百人。\"\n\n(01:04:43):\n有一件事他们真的很犹豫。它的工作量分数很高，确定性分数中等。他们基本上是这样说的：\"听着，如果我们真想做这个，我们可以重新设计整个引导流程。我们可以让它不再是事后试图把人们引导到多产品使用，而是在他们加入时就了解他们，并立即将他们引导到正确的用户类别。\"\n\n(01:05:08):\n我说：\"这听起来太棒了。\" 它最大的影响力是什么？他们说：\"如果我们做对了，它能让我们完全达成目标，但我们必须和其他团队合作，必须和市场部门合作。有太多的依赖关系和太多不在我们控制范围内的事情，我们不知道能否做到。\" 我说：\"没关系。这些就是我们作为产品经理要做的权衡取舍，你会有一些影响力较小的工作，但可能更容易、更确定地交付。但如果这件事能让我们完全达成目标，如果它真的是我们所看到的唯一有机会让我们实现目标的事情——记住，我们制定这个目标是为了回答'这个团队需要交付什么才能成为对业务的良好投资'这个问题——那么我认为值得去尝试。\n\n(01:05:55):\n\"值得和其他产品团队进行这些对话。值得和市场部的人交流。值得让自己稍微挑战一下，说'这做起来会很有挑战性，但如果我们能做到，我们就能真正交付一些让我们感到非常自豪的东西。'\"\n\n(01:06:11):\n所以第三步在实际操作中最常见的表现形式是：我们在估算和衡量影响力时，使用的度量单位是否与我们的目标一致？因为如果我们这样做，我们就是在保持诚实，我们在说：\"这真的有机会做出贡献吗？\" 而如果我们变得非常聪明，想出一个专有的评分系统和所有这些小的中间步骤，我们可能会觉得自己在做非常出色的工作，非常非常聪明。但我们再次面临这样的风险：我们将失去与我们最初为什么要做这项工作的联系。\n\nLenny Rachitsky (01:06:51):\n这是一个非常重要但经常容易被忽视的点。这个想法是，当你在做 RICE 或任何版本的 ICE 时，影响力应该基于对你目标的影响，而这个目标是从公司目标衍生出来的。当你谈论它时，感觉如此显而易见，我希望大多数人都知道这一点，但我觉得这是人们会忘记的事情。就像，什么是影响力？哦对，客户会更开心。\n\nMatt LeMay (01:07:16):\n再次强调，这不是容易的工作，对吧？做产品意味着我们有很多不同的视角，很多不同的人有很多不同的优先级。利益相关者管理这部分工作是持续不断且令人筋疲力尽的，真的很容易忽视这些东西。这需要努力、纪律，以及如你所说的勇气来不断回到这个点上。但我认为，这不仅是正确的做法，而且它能帮助你在一天结束时，在你工作中做的事和你生活中擅长的事之间建立更清晰的界限。\n\nLenny Rachitsky (01:07:58):\n说到界限，你分享的很多建议都涉及到说不、反驳，以及说服别人他们错了，这是非常困难的。对大多数人来说，这不是一个自然舒适的位置。\n\nMatt LeMay (01:08:12):\n确实不是。\n\nLenny Rachitsky (01:08:15):\n你有什么建议？你学到了什么方法能很好地进行反驳，帮助人们看到他们的想法如何不对……他们想让你构建的东西是错误的。\n\nMatt LeMay (01:08:24):\n所以这就是我的优势所在，我想，作为一个回避冲突、取悦他人的人。所以我经历过这些，我认为我在产品管理实践中最自豪的一句话是：如果你把产品管理做得真的很好，你永远不必说是，也永远不必说不。你在给人们提供选项，并帮助他们理解权衡取舍。\n\n(01:08:52):\n所以与这个想法一致，有些事情不在你的控制范围内，作为产品经理，你并不总是做决定的人。会有其他人来找你说：\"做这个\"，或者说：\"我看不到那个的价值。做这个，做那个。我想要这个，我想要那个。\" 如果这些人在组织中处于正式权威的位置，我肯定从来没有成功地对他们说过不。\n\n(01:09:16):\n此外，我发现自己处于这样的情况：他们就是知道一些我不知道的事情。他们正在进行收购，所以有些事情我们必须做或不能做。有一些严重的财务挑战，他们现在正在解决，这改变了优先级，但他们不能向更广泛的组织讨论这个问题。很有可能那些要求你做一些看似没有意义的事情的人，掌握着你所没有的信息。在试图说服他们的过程中，你不仅会失败，而且会失去一些信任，损害那种随着时间推移对你来说可能非常重要的关系。所以我认为挑战在于说：\"好吧，你想让我做这件事？也许吧。让我们看看不同的选项。\"\n\n(01:10:15):\n如果你经历这些步骤，如果你说：\"我理解，这是我们团队的目标，这是我们正在优先考虑的事情,这是我们认为可能产生的影响。\" 如果你带着一些将产生更大影响的东西来找我，天哪，我会很乐意去做。这听起来太棒了。\n\n(01:10:29):\n但如果它的影响不明确，或者如果它与此无关，那么我们可能需要调整我们寻求产生的影响。如果这突然变得非常重要，就像书中讲述的那个故事，对吧？有时候就是，好吧，我们必须做这个。当然。这意味着我们的影响预测将不得不调整这么多。\n\n(01:10:48):\n你不是在说不，也不是在说是。你在帮助一个处于决策位置的人理解该决策涉及的权衡取舍。再说一次，如果你能做到这一点，你在一天结束时回家会感觉更好。你会减少那种失败感或被不公正的暴君推翻的感觉，更多的会是：\"好吧，我确保他们拥有所有我在做那个决定时想要拥有的信息。那个决定最终是他们要做的，我会尽我所能。\"\n\nLenny Rachitsky (01:11:19):\n告诉我你是否不同意。根据我的经验，你也想推荐一条路径。因为很多人不希望 PM 只是说：\"这是所有选项。我没有任何意见，没有任何倾向。你决定吧。\" 我发现人们希望你有自己的观点。\n\nMatt LeMay (01:11:33):\n绝对是。选项加上建议是一种神奇的公式。我在与 MailChimp 合作时，我们实际上与公司所有产品经理做了一个工作坊，让人们角色扮演，尝试推销单一选项与带有建议的多个选项。令人惊讶的是，当你只提出一个选项时，人们的本能就是开始挑毛病。不是因为你是个混蛋，而是因为——\n\nMatt LeMay (01:12:00):\n你开始挑毛病，不是因为你是个混蛋，而是因为你在看一件事时会想：\"哦，那这个呢？那个呢？\"\n\n(01:12:07):\n再说一次，你所有的焦虑、恐惧，以及你觉得没有在其中体现的东西，还有你担心的\"如果发生这种情况怎么办？如果发生那种情况怎么办？\"\n\n(01:12:14):\n所有这些都会削弱动力，而如果你进来说：\"这里有三个选项，这是权衡取舍，这是我们推荐的那个\"，那么每一点来回讨论都会让这些选项更清晰、更有力。\n\nLenny Rachitsky (01:12:30):\n我觉得人们可能会错过我们谈论方式中的那个细微差别，所以我认为这是一个非常重要的要点。\n\n(01:12:35):\n让我回到这三个步骤，只是为了那些想着\"很好,我很兴奋,我有动力\"的人们。\n\n我要改变我们的运作方式。\"让我快速总结一下。\n\n(01:12:44):\n第一步是，将团队目标设定得接近公司目标。第二步是在每一步都以影响力为先。不要忘记，在全年的构建过程中要记住这一点。然后，第三步是将每一项工作都与影响力联系起来。\n\nMatt LeMay (01:12:57):\n是的。\n\nLenny Rachitsky (01:12:59):\n我想，再次提醒大家很重要，这可能会很难很烦人，也许事情进展得还不错。每个人都在告诉你要构建什么，你在构建和发布，事情似乎进展得还可以。\n\n(01:13:11):\n我认为重要的一点是，如果你相信你正在构建的东西并没有帮助业务增长和成功，那么要么有一天他们会让你离开，因为你没有做重要的事情。要么业务就不会成功，你就会陷入困境。\n\n(01:13:27):\n所以即使你不想做这件事，你也需要认真思考这个问题，尽管这真的很难。\n\nMatt LeMay (01:13:36):\n是的。\n\nLenny Rachitsky (01:13:37):\n但也许让我再想想这个问题。假设业务进展得很好，一切都很好。CEO告诉你所有要构建的东西，销售团队的同事们就像，\"来，发布这些功能，一切都很好。\"\n\n(01:13:46):\n一切都在运转，业务在增长。对此有什么想法？是\"不，别管它\"？还是你觉得，\"好吧，这种情况通常不会持续太久\"，你应该真正开始培养这些技能？\n\nMatt LeMay (01:13:56):\n有趣的是，当事情进展顺利时，我合作过的团队有时和事情进展不顺时的团队一样焦虑，因为他们很难将成功归因于他们正在做的事情，对吧？\n\n(01:14:08):\n他们会看着它说，\"是的，我们做得很好。但我认为这更多地与营销有关，而不是与我们有关。\"\n\n(01:14:14):\n或者，\"是的，我们做得很好，但我们只是在正确的时间出现在正确的地点。我们的业务做得很好，我们的行业做得很好。我们只是和其他所有正在增长的人一起增长。\"\n\n(01:14:24):\n我认为，和大多数事情一样，如果你带着好奇心去对待它，就能从中学到很多。所以如果你看着它说，\"是的，我们不能完全把功劳归于自己，但营销做得很棒。让我们和他们谈谈。他们在做什么？为什么这么顺利？他们从中学到了什么，我们可以更紧密地与他们合作？\"\n\n(01:14:46):\n如果你的行业做得很好，那就说，好吧，现在是什么在起作用？未来可能会发生什么变化？我们如何理解这一点？\n\n(01:14:54):\n所以我认为，当事情进展顺利时，挑战在于保持好奇心，继续庆祝那些事情，不仅是你的团队正在做的，还有每个人正在做的，并利用那段时间，当你有更多回旋余地时，当前压力较小时，与组织的其他部分建立这些联系，看看真正出色的工作在哪里发生。\n\n(01:15:21):\n让我难过的一件事是，当团队彼此嫉妒和厌恶时，对吧，就像，\"这个团队在做，他们在做出色的工作，但他们没有像我们一样受到同样的标准约束，这不公平，他们是每个人都喜欢的团队。\"\n\n(01:15:37):\n我想说，\"去和他们谈谈，因为你可能可以从他们那里学到一些东西。如果他们是获得积极关注、做有意义工作的团队，那可能是有原因的。如果你能理解这个原因，并且你能将你的工作与那个团队的工作保持一致，这对你来说可能会非常好。\"\n\n(01:15:58):\n再说一次，我认为，在很多情况下，这又回到了控制的问题上，对吧？如果我们不能感受到一种控制感，\"事情进展顺利是因为我们做了这个\"，我们往往会将自己与事情的顺利进展脱节，说，\"好吧，我不能。参与其中几乎感觉很危险，因为，如果我们什么都没做，但好事仍在发生呢。\"\n\n(01:16:21):\n我认为，保持开放性，保持好奇心，会让你在事情不可避免地开始停滞或下降时处于更好的位置，这是万物的周期性本质。\n\nLenny Rachitsky (01:16:34):\n哇。很深刻。在结束我们的对话之前，书中或者甚至这次对话中，有没有一个问题，你认为产品负责人、产品团队应该问自己，以帮助他们解决可能没有看到的问题，并帮助他们的团队更好地运作？\n\nMatt LeMay (01:16:53):\n我的意思是，我喜欢这个问题，\"如果你是CEO，你会资助这个团队吗？\"我知道这有时会让人觉得有点对抗性。所以，一个更温和的提出方式是说，\"在今年年底，你希望能说出什么样的一句话，能让你对这个团队的工作感到很棒？是什么？\"\n\n(01:17:11):\n在年底，这个团队的一切都进展得很顺利。你在走廊里遇到CEO，你说，\"我感觉很棒，因为我们做了这个。\"\n\n(01:17:20):\n有时你会从团队的不同成员那里得到非常不同的答案，基于这些答案，说，\"好的，这是你关心的。这是我关心的。这是我担心的。这是我兴奋的。\"\n\n(01:17:33):\n这就是你如何获得那种神奇的，人们在房间里一起构建，或者音乐家在房间里写他们的下一首歌，对吧？\n\nLenny Rachitsky (01:17:40):\n真是回到了开头。\n\nMatt LeMay (01:17:40):\n然后——\n\nLenny Rachitsky (01:17:40):\n我喜欢这个。\n\nMatt LeMay (01:17:43):\n就是把这个对话公开化，让人们谈论他们的观点和期望，目的是将其汇集在一起，创造更好的东西。\n\nLenny Rachitsky (01:17:55):\n太棒了。Matt，在我们进入一个非常令人兴奋的闪电问答环节之前，你还有什么想要讨论的或想留给听众的吗？\n\nMatt LeMay (01:18:03):\n我想我们都讨论过了。我只是再次给人们留下这样的希望，你可以开始将业务的商业现实和约束视为机会，视为指引，视为塑造和构建你工作的东西，而不是你需要单枪匹马地改变、打破或转变的东西，因为你可能做不到。这没关系。\n\nLenny Rachitsky (01:18:31):\n这是令人振奋的话。说到这里，我们到了非常令人兴奋的闪电问答环节。你准备好了吗？\n\nMatt LeMay (01:18:37):\n准备得差不多了。\n\nLenny Rachitsky (01:18:39):\n第一个问题。你最常向别人推荐的两到三本书是什么？\n\nMatt LeMay (01:18:43):\nChristina Wodtke的《Radical Focus》，显然，我在书中经常引用它，我认为这是关于OKR最好的书。我喜欢她的写作风格。我喜欢她讲故事的方式。\n\n(01:18:56):\n我喜欢对专注的关注，这个想法是，你如何做并不那么重要，重要的是做事方式的结果。我总是觉得这很鼓舞人心。\n\n(01:19:08):\n另一本书，这有点出人意料，是佛教哲学家Alan Watts写的。它叫《The Wisdom of Insecurity》(不安全感的智慧)。我谈论控制和放弃控制的很多方式都来自那本书。\n\n(01:19:23):\n它也有一个概念。它以一个叫做反向努力定律的概念开始，即有时候，你越努力，事情就越糟糕。当涉及到设定目标、做OKR、做战略时，我经常想到这一点，有时候有一种倾向是把精力投入到事物的过度复杂化上，这反过来使这些事物在最终想要实现的目标上效果更差。所以，强烈推荐那本书。它在一些黑暗时期帮助了我很多，心理上。\n\n(01:19:59):\n书中有一个想法。他谈到试图在想象的未来中让自己永远保持安全，实际上是在扼杀当下的自己。哦，这真的触动了我。这对我的触动真的、真的、真的很大。所以，强烈推荐那本书。\n\n(01:20:18):\n如果我们今天谈论的事情让你哪怕只有我在工作中应对它们时的一小部分焦虑和恐惧，那么我强烈推荐Alan Watts的《The Wisdom of Insecurity》。\n\nLenny Rachitsky (01:20:32):\n我正想问书名是什么，因为这听起来真的很有力量。很棒、很棒的选择。\n\n(01:20:37):\n第二个问题，你有没有最近最喜欢的电影或电视节目，你真的很喜欢的？\n\nMatt LeMay (01:20:41):\n天哪。所以特别是，当我处于工作和写作模式时，我的大脑会关闭所有不是垃圾的东西。所以我一直在看很多垃圾。\n\n(01:20:53):\n我在Netflix上看了《Temptation Island》(诱惑岛)，新一季的《Temptation Island》。我太喜欢它了。主持人是Mark L. Wahlberg,他是《Antiques Roadshow》(古董路演)的主持人,在这个奇怪的场景中武器化治疗术语来折磨人。\n\n(01:21:15):\n我不应该喜欢它,但我只是一个人,一个有时为戏剧而活的八卦婊,所以...\n\nLenny Rachitsky (01:21:25):\n太好了。\n\nMatt LeMay (01:21:26):\n我知道。我非常喜欢它。\n\nLenny Rachitsky (01:21:27):\n我想这是第一次提到《Temptation Island》,我喜欢。好的,你最近发现的最喜欢的产品,你真的很喜欢的?\n\nMatt LeMay (01:21:37):\n是的,所以我真的很高兴你问这个问题,因为作为一个音乐人,我生活在这个小众产品的世界里,这非常有趣,因为音乐创作者的规模经济完全不同,对吧?\n\n(01:21:48):\n你不需要构建一个将拥有十亿用户并创造巨大回报的产品。\n\n你可以做一些让几百或几千人大量使用并且喜爱的东西。你处在这个有趣的混合领域，既有实体又有数字，还有不同类型的东西。当你问我这个问题时，我第一个想到的就是这个，它是由一位叫 Milkman Sound 的功放制作者制造的，在旧金山湾区，他基本上采用了 Fender 功放的电路，然后做了一个版本，让它适配到这个方便、紧凑、轻便的外形尺寸里。\n\n(01:22:35):\n所以对我来说，作为一个不再是 22 岁的人，偶尔还会跟朋友的乐队巡演，而且有背部问题，我能够携带这个真正强大的功放，以这种设计精良、美观大方的外形尺寸，真的让人感到非常愉悦。这是那种真正理解质量对其特定受众意味着什么的产品之一。\n\n(01:23:09):\n我可以去巡演，音质非常好，而不用拖着一个巨大、沉重的东西。我很喜欢这一点。这是我真正感激的东西。\n\nLenny Rachitsky (01:23:24):\n这让我突然想玩音乐了，但我想了解一下这是怎么工作的，你还是要把它插到音箱里吗，还是——\n\nMatt LeMay (01:23:30):\n是的，所以我有一个小音箱。\n\nLenny Rachitsky (01:23:32):\n好的。哦，明白了。\n\nMatt LeMay (01:23:32):\n你也可以直接插到俱乐部的调音台，或者用于录音。\n\nLenny Rachitsky (01:23:36):\n好的，懂了。\n\nMatt LeMay (01:23:37):\n它还有一个小耳机插孔。所以如果我想在酒店房间里练习，在演出前，我也可以用这个。\n\n(01:23:45):\n它做了你需要这个设备做的所有事情，不多不少，而且做得非常好。这对我来说太美妙了，拥有一个产品——\n\nLenny Rachitsky (01:23:59):\n又是一个很棒的选择。\n\nMatt LeMay (01:24:01):\n——让我觉得，\"这正好做了我需要的事情。它做得非常好，而且是一个令人愉悦的产品。\"\n\nLenny Rachitsky (01:24:11):\n还有两个问题。你有没有一个最喜欢的人生格言，是你经常回想起来的，在工作或生活中觉得很有用？\n\nMatt LeMay (01:24:17):\n我经常回想起我妈妈告诉我的一些话。我相信你也有过这种经历。当你是一个在世界上创造东西的人时，你会倾向于看数字，看\"我做得怎么样？这个有共鸣吗？这个好吗？这个成功了吗？\"\n\n(01:24:31):\n我确实做过一些事情，尤其是在我的音乐生涯中，投入到某件事情中的努力、热爱、时间和关心，感觉并没有体现在那件事的结果中，或者它被接受的方式中。\n\n(01:24:48):\n有一次我跟我妈妈谈这个，她说，\"我真的相信，好的工作永远不会被浪费。即使你没有立即看到，当你把好的工作带到这个世界上，即使它只触及到少数人，它永远不会被浪费。如果你做你真正相信的工作，它会对世界产生一些积极的影响。\"\n\n(01:25:10):\n这真的让我印象深刻。我一直记着这句话，即使当我思考如何写作、说什么的时候，当我开始担心是否要太聪明、是否应该在传达信息的方式上更有策略、是否应该说一些我并不完全相信的东西时。\n\n(01:25:34):\n有几次，不是最近，但大约 10 年前有几次，我尝试写标题党式的标题，因为我想，\"哦，这会不会得到更多关注？\"有一篇特别的文章，受到了一些我非常尊重的人的深思熟虑的批评。\n\n(01:25:49):\n我当时想，\"我不想这么做。我不想把我不相信的工作带到这个世界上，\"即使它没有达到我希望的效果，我也会坚持相信，没有好的工作会被浪费。\n\nLenny Rachitsky (01:26:03):\n我完全相信这一点。最后一个问题。你这些年写了大量的音乐评论。我很好奇有没有一篇让人们非常不同意，或者你特别自豪的？\n\nMatt LeMay (01:26:19):\n我的意思是，在互联网的某些角落，我是一个反派——\n\nLenny Rachitsky (01:26:22):\n说说看。\n\nMatt LeMay (01:26:23):\n——因为我写的关于 Liz Phair 同名专辑的评论。我写这篇评论时才 19 岁，当时我的世界观很有问题，还在发展中。那是一篇非常居高临下、傲慢的评论，是从一个没有资格居高临下和傲慢的立场写出来的。\n\n(01:26:46):\n不是说居高临下和傲慢就应该有资格，但当时感觉很正义，以一种危险的方式，对吧？那种有毒的正义感，你会想，\"我在对抗坏事。\"但后来你意识到，你对抗的实际上并不是坏事。\n\n(01:27:09):\n你实际上是在横向和向下攻击，但你没有足够的能力和成熟度去意识到，在与人、文化和你自己的关系中，你并不在你认为的那个位置。所以我在 2019 年为那篇评论道歉了，Liz Phair 和我实际上在 Twitter 上有了一次非常好的互动。\n\n(01:27:34):\n那还是 Twitter 仍然可以发生这种事情的时候,以那种方式结束这件事感觉很好。我仍然对此感觉不好，因为它助长了一些非常有毒和伤害性的言论维度。\n\n(01:28:06):\n但你能做什么呢，除了回顾它然后说，\"是的，我错了。我就是彻底错了，而且除了错误之外，我还很混蛋。\"几个月前，Instagram 上的一个表情包创作者发布了那篇评论，配文是\"Matt LeMay，会有人收拾你的。\"\n\n(01:28:31):\n我想，\"是的，是的。如果我现在读到那个，我可能也会说类似的话。\"所以我想，正如我所说，我是一个害怕冲突的讨好型人格。\n\n(01:28:48):\n我经历过我的那种刻薄阶段。我不认为它对我或其他任何人有任何好处。\n\nLenny Rachitsky (01:28:57):\n哇。这个答案比我预期的要深刻得多。我不敢相信人们还在引用这篇很久以前的评论。多少年了？\n\nMatt LeMay (01:29:08):\n22 年？那是 2003 年，所以是 22 年前。那是我人生一半以上的时间以前。但疯狂的是，在互联网上，它看起来仍然是新的。\n\n(01:29:19):\n实际上，我在伦敦的 Red Monk 活动上做的第一次演讲，我带了我的青少年日记，就是为了说明这一点：如果某样东西作为纸质材料有 10 年的历史，它会通过自身的物质存在被语境化，对吧？\n\n(01:29:36):\n但有人会说，\"哦，我想知道 Pitchfork 对这张唱片的看法，\"他们会看到我那篇混蛋评论，然后说，\"Pitchfork 发表了这篇混蛋评论。是哪个混蛋评论者写的？\"\n\n(01:29:48):\n然后他们会找到我，说，\"嘿，你，你是个混蛋，因为你写了这篇混蛋评论。\"我会说，\"是的，我确实写了那篇混蛋评论，是在我还是个混蛋的时候。\"但我想我是一个从那以后又活了 22 年的人。\n\nLenny Rachitsky (01:30:11):\n你的额叶皮层从那以后发育得更好了。我想它要到——\n\nMatt LeMay (01:30:13):\n天啊，我希望如此。\n\nLenny Rachitsky (01:30:14):\n25、26 岁才停止发育。Matt，这太棒了。我们涵盖了很多内容。我们触及了我希望谈到的所有内容，甚至更多。\n\n(01:30:22):\n两个后续问题。人们可以在哪里在线找到你，谈谈你为公司做的那类工作，以及听众如何能帮到你？\n\nMatt LeMay (01:30:29):\n是的，你可以在 matlemay.com 找到我，非常直接，至于人们如何能帮到我，希望我能帮到他们，无论是通过书籍，还是通过来到你的公司工作，帮助你的团队集中注意力。\n\n(01:30:47):\n我发现促进这些对话是一个非常大的价值增加。有时候没有一些外部帮助，很难进行这些对话。所以，无论是以书籍形式还是以我本人的形式,我希望我能帮到你，以一种不那么可怕、更易接近的方式进行这些对话，并引导你走上做有影响力工作的道路。\n\nLenny Rachitsky (01:31:11):\n太棒了，mattlemay.com。然后，书名是什么？他们在哪里能找到？\n\nMatt LeMay (01:31:15):\n《影响力优先的产品团队》(Impact-First Product Teams)。你可以在所有能找到书的地方找到它，在亚马逊上。有作者朗读的有声书，我就在这个房间里，用这个麦克风录制的。我自己做了所有的音乐间奏……\n\nLenny Rachitsky (01:31:28):\n为什么？\n\nMatt LeMay (01:31:30):\n因为这是一个很好的拖延方式，当我实际上不想读这本书的时候。但我希望你会觉得它很有趣。\n\nLenny Rachitsky (01:31:39):\nMatt，非常感谢你来这里。\n\nMatt LeMay (01:31:41):\n非常感谢，Lenny。这很棒。\n\nLenny Rachitsky (01:31:43):\n大家再见。\n\nSpeaker 1 (01:31:44):\n非常感谢收听。如果你觉得有价值，可以在 Apple Podcasts、Spotify 或你最喜欢的播客应用上订阅节目。\n\n(01:31:52):\n另外，也请考虑给我们评分或留下评论，因为这真的能帮助其他听众找到这个播客。你可以在 lennyspodcast.com 找到所有过往剧集，或了解更多关于节目的信息。下期见。",
  "chunks_count": 10
}