{
  "guest": "Matt Mullenweg",
  "en": "Lenny Rachitsky (00:00:00):\nIf you're really open and open source, sometimes you have to stand up the bullies and you have to fight to protect your open source ideals.\n\nSpeaker 1 (00:00:05):\nPlease put your hands together for Matt Mullenweg.\n\nLenny Rachitsky (00:00:08):\nMatt Mullenweg has been making some questionable moves recently. There's a lot going on with Matt and WordPress these days. 20+ years of good sentiment burned in days. You are like a 100% beloved hero of open source and internet and now you're in this, a lot of people don't like you.\n\nMatt Mullenweg (00:00:23):\nIf you were kind of inside baseball with WordPress, it's actually a lot of people who have been unhappy with me over the years. Previously, 1% of the world thought I was terrible and now I feel like it's up to four or 5%.\n\nLenny Rachitsky (00:00:35):\nPeople that don't know what the hell's going on, what's just like the high level overview of what's going on?\n\nMatt Mullenweg (00:00:39):\nThere's a company called WP Engine. By 2018, they got bought out by a private equity firm called Silver Lake. Since 2019, WP Engine has kind of changed a bit. They started using the trademark, they're offering something called WordPress. They're referred to it as like a bastardized hacked up version of it. It's diluting our brand.\n\nLenny Rachitsky (00:00:56):\nWhy do you think so many people are looking at you as the bad guy?\n\nMatt Mullenweg (00:00:58):\nA lie gets around the world seven times before the truth has time to get out of bed.\n\nLenny Rachitsky (00:01:07):\nToday my guest is Matt Mullenweg. Matt is the co-creator of WordPress, which powers 40% of websites on the internet today, including whitehouse.gov. He's also the CEO of Automatic, which is valued at over $7 billion and owns products like WordPress.com, Tumblr, WooCommerce, Gravatar, and Pocket Casts. There is a lot of drama these days around Matt and WordPress and within the open source community, so I thought I'd have Matt on to address many of the criticisms head-on that he hasn't addressed in other places and also just get the full story on what's going on. We also chat about what incepted him to spend over half his life at this point on open source and creating WordPress. Also, why products like Llama are what he calls 'fake open source' and his perspective on AI and open source. Also, how AI is actually trained on open source code and what that means for the future and his approach for deciding what companies to acquire within Automatic.\n\n(00:02:03):\nIf you enjoy this episode, don't forget to subscribe and follow it in your favorite podcasting app or YouTube. Also, if you become an annual subscriber of my newsletter, you now get a year free of Notion and Superhuman and Perplexity Pro and Linear and Granola. Check it out at lenny'snewsletter.com. With that, I bring you Matt Mullenweg.\n\n(00:02:24):\nThis episode is brought to you by WorkOS. If you're building a SaaS app, at some point your customers will start asking for enterprise features like SAML authentication and skim provisioning. That's where WorkOS comes in, making it fast and painless to add enterprise features to your app. Their APIs are easy to understand so that you can ship quickly and get back to building other features. Today, hundreds of companies are already powered by WorkOS, including ones you probably know like Vercel, Webflow and Loom. WorkOS also recently acquired Warrant, the fine grain authorization service. Warrant's product is based on a groundbreaking authorization system called Zanzibar, which was originally designed for Google to power Google Docs and YouTube. This enables fast authorization checks at enormous scale while maintaining a flexible model that can be adapted to even the most complex use cases. If you're currently looking to build role-based access control or other enterprise features like single sign-on, skim or user management, you should consider WorkOS. It's a drop-in replacement for auth zero and supports up to 1 million monthly active users for free. Check it out at workos.com to learn more, that's workos.com.\n\n(00:03:42):\nThis episode is brought to you by Vanta and I am very excited to have Christina Cacioppo, CEO and co-founder Vanta joining me for this very short conversation.\n\nChristina Cacioppo (00:03:51):\nGreat to be here, big fan of the podcast and the newsletter.\n\nLenny Rachitsky (00:03:54):\nVanta is a longtime sponsor of the show, but for some of our newer listeners, what does Vanta do and who is it for?\n\nChristina Cacioppo (00:04:01):\nSure. So we started Vanta in 2018 focused on founders helping them start to build out their security programs and get credit for all of that hard security work with compliance certifications like SOC 2 or ISO 27001. Today we currently help over 9,000 companies including some startup household names like Atlassian, Ramp and LangChain start and scale their security programs and ultimately build trust by automating compliance, centralizing GRC, and accelerating security reviews.\n\nLenny Rachitsky (00:04:31):\nThat is awesome. I know from experience that these things take a lot of time and a lot of resources and nobody wants to spend time doing this.\n\nChristina Cacioppo (00:04:39):\nThat is very much our experience before the company and to some extent during it. But the idea is with automation, with AI, with software, we are helping customers build trust with prospects and customers in an efficient way. And our joke, we started this compliance company so you don't have to.\n\nLenny Rachitsky (00:04:55):\nWe appreciate you for doing that and you have a special discount for listeners, they can get $1000 off Vanta at vanta.com/lenny, that's V-A-N-T-A .com/lenny for $1,000 off Vanta. Thanks for that, Christina.\n\nChristina Cacioppo (00:05:10):\nThank you.\n\nLenny Rachitsky (00:05:14):\nMatt, thank you so much for being here. Welcome to the podcast.\n\nMatt Mullenweg (00:05:17):\nThanks, big fan and long time listener, so happy to be on.\n\nLenny Rachitsky (00:05:21):\nI'm a long time fan. I've been wanting to get you on this podcast for so long and this is such an interesting time to be chatting with you, there's a lot going on with Matt and WordPress these days, so it's really interesting, almost good that we waited a little bit to talk so we're going to get into a lot of that stuff. But I want to start with just what is it that you do, Matt? What are all the things you're involved in? Give people a sense of just the things you're working on.\n\nMatt Mullenweg (00:05:44):\nSo first, when I was 19, I co-founded an open source project called WordPress with Mike Little and we started just blogging software, then became sort of a full site thing and then became a platform that really tons of stuff is built on and now it's kind of transitioning into this cool WASM can be embedded anywhere or run locally or make mobile apps. It's really interesting seeing WordPress used as an engine for powering things I would say don't even look like a website, which is kind of wild to me, but that's kind of the beauty of the open source people do things with that you don't expect. End up dropping out of college, moving to San Francisco and then worked at CNET for a year as project manager actually, that's how they hired me.\n\nLenny Rachitsky (00:06:27):\nI want to talk about that, but go on.\n\nMatt Mullenweg (00:06:30):\nAnd then had this vision where instead of downloading the software and setting up a database and everything, we made a SaaS version of WordPress. I pitched it at CNET, they didn't want to do it, so I was like, \"Okay, I got to do this,\" so I left and started a company called Automatic. And the idea was to essentially compliment the core WordPress software with some commercial services, things that run in the cloud, like Akismet which is our machine learning AI, I guess you'd call it AI now, but anti-spam system, or Jetpack, which is iCloud for WordPress. It does the backups and the real time sync and everything like that.\n\n(00:07:04):\nSo that was 19 years ago, so that's now grown to be over 1700 people in actually 90 countries so we've actually been fully distributed and remote and asynchronous from the start, which I think is one of our superpowers. I actually wasn't the CEO in the beginning, but in 2014, so I guess 11 years ago, I became CEO. The original CEO was... Well, I guess I wasn't the very beginning, but then I hired Tony Schneider from BCL, probably four or five months in.\n\n(00:07:35):\nAnd yeah, so that is a very full-time thing and Automatic does a lot of products, WooCommerce, which is open source Shopify, which is now half our revenue. And then we have some really cool apps so like Beeper, DayOne, Simplenote, Rocket Casts or trying to fill up your home screens with open web, open source things that are very privacy and user-centric. So running that company is definitely a full-time job. I still run WordPress.org and the WordPress project, so I'm the lead developer there and so sort of manage all those releases in the community and the directories and all the sort of things we do on WordPress.org and this cool thing called Openverse we took over Creative Commons, which is a way you can find sort open licensed images and audio and video. So basically if you notice a throughput through all these things, it's open source.\n\n(00:08:31):\nOn the nights and weekends or side, a few hours a week I do some angel investing. So I've done over 100 angel investments through an entity called Audrey Capital, which is sort of, if anything's in the sort of WordPress space, I invest in it through Automatic, but if anything's a little more further afield I do it through Audrey Capital and have done some really exciting investments there, everything from name brands like Stripe and SpaceX, but also it was in the seat of Calm or a lot of home automation stuff like Ring, August, smart things. Yeah, just check out Audrey Capital, it's got some fun stuff in there. Daylight Computer, which is one I'm very excited about right now.\n\n(00:09:11):\nAnd I guess finally I love San Francisco, so I an a co-owner of a cool grungy jazz club in North Beach called Keys with Simon Rowe. So if Wednesday through Saturday night, you want to see some awesome live jazz, check out Keys.\n\nLenny Rachitsky (00:09:28):\nWow, okay. You said too much, I get it now. Jazz club I was not aware of, I got to check this out. It's called Keys?\n\nMatt Mullenweg (00:09:36):\nYeah, keys Jazz Bistro.\n\nLenny Rachitsky (00:09:38):\nOkay, cool.\n\nMatt Mullenweg (00:09:39):\nIt's over on Broadway in Columbus, kind of right around there.\n\nLenny Rachitsky (00:09:42):\nAmazing. That was news to me. Going back to Automatic, I think people don't get the scale of this thing, so just to mirror back, if you think that even add to what you've said, 1700 people work there, 90 different countries. Also, you didn't share this stat, it was something like 43% of internet websites are built on WordPress, run on WordPress.\n\nMatt Mullenweg (00:10:02):\nYeah, so when we started, a lot of websites were built on custom CMSs and there's a lot of fragmentation in the space, but now WordPress has grown to be over 40% of all websites in the world, which is 10x the number two, which right now is Shopify.\n\nLenny Rachitsky (00:10:17):\nRight, they're like at 4%. I was looking at that list.\n\nMatt Mullenweg (00:10:20):\nThey're around 4%, yeah.\n\nLenny Rachitsky (00:10:21):\nThat's unreal.\n\nMatt Mullenweg (00:10:22):\nIt used to be open source was the top three. Unfortunately, Jula and Drupal have fallen behind, and so now it's like Shopify, Wix, Squarespace are the top ones but WordPress is still, because we have this flywheel of open source community, its movements, any open source like Linux or Apache or Wikipedia, it has some positive flywheel effects when it takes off.\n\nLenny Rachitsky (00:10:48):\nAwesome, okay. And then there's a few other things you didn't mention, I want to get to this later, but I'll just mention now, you guys own Tumblr, you bought Tumblr, which I don't think a lot of people necessarily know.\n\nMatt Mullenweg (00:10:56):\nI'm sorry, I forgot to mention that, Tumblr.\n\nLenny Rachitsky (00:10:58):\nWe're going to get into that, yeah.\n\nMatt Mullenweg (00:11:00):\nYeah, running a social network is definitely the hardest thing I've ever attempted. I thought we knew what we were doing because WordPress ran so much of the web, we dealt with, I thought, every content moderation thing you could ever deal with, but social networks are a whole other ballgame.\n\nLenny Rachitsky (00:11:15):\nOkay, a couple more fun facts before we get into some other stuff I want to chat about. Fun fact number one is you were super involved in the Bay Lights project. I didn't know this. For people that don't know what the Bay Lights, if you're in San Francisco you definitely know what the Bay Lights project is and I'm sure you love it, for people that don't know what this is about, what is this project and how have you been involved? Why have you been instrumental in to make this a thing?\n\nMatt Mullenweg (00:11:37):\nBay Lights, there's two famous bridges in San Francisco, the Golden Gate Bridge, which is kind of the iconic one, there's actually the Bay Bridge, which is the workhorse of San Francisco. It's one of the busiest bridges in the country. And it's really beautiful from an engineering point of view. And so kind of a vision between Ben Davis and artist Leo Villarreal, who's an amazing light artist, actually who started Burning Man was to put, gosh, I forget the number, I think 18,000 LEDs on the side of the bridge on all the cables and create this really beautiful, gentle kind of algorithmic light piece, light art piece.\n\n(00:12:18):\nAnd yeah, Ben Davis was dating an artist friend of mine and we were over and having drinks on my patio and we were looking at the Bay Bridge and I had this kind of thing where there's some lights at the top of the Bay Bridge and I was like, \"Oh, wouldn't it be cool if those lights were Christmas lights and they could do patterns or something?\" It's the lights to keep planes from hitting it. And I was like, \"Oh, you could program that.\" He was like, \"Yeah.\" It was almost like the Social Network thing where a million's cool, but a billion would be really cool. He was like, \"Yeah, that would be cool, but what if we put the whole side of it?\" And so I was like, \"Oh, cool,\" and sort of made an angel investment in that thing. They hadn't raised anything or had, I don't even think an entity at that point, but I was like to get you started, I forget what it was, 100 or 150k so I gave them that first bit and then it kind of blossomed into a thing.\n\n(00:13:07):\nAnd then sort of fast-forward, I don't remember the exact timeline, but they were kind of at a final bit of fundraise and they weren't able to close that last bit and I actually mortgaged my condos and donated the last million, million and a half to finish out that project. The Bay Lights were online for 10 years. The technology degraded, and so the environment's very harsh. So actually we just completed a fundraise and are reinstalling the Bay Lights. They're calling it Bay Lights 360. So now it'll be both sides of the bridge, it'll be visible from also Oakland and the Treasure Island because the first version, the city was very worried about the drivers seeing the lights and it might distract them so we had to angle them so that you could only see it from San Francisco, which was a compromise we didn't love because we love the East Bay and everything else like that too. So new version is coming online hopefully later this year in the fall. And also that turned into a nonprofit called Illuminate, which I'm on the board of run by Ben Davis, who I mentioned previously, that does cool public art stuff around the city. So they're responsible for the Grace Lights, all the JFK Boulevard stuff where that has some murals and the beer garden and all the chairs, that's all Illuminate. So their thing is radical public art. So it's like art that needs to be free and accessible. And I think that's so important for San Francisco. We have great institutions know the SF, MoMA, the Opera, etc, that have huge budgets like 100 million a year and Illuminate literally one 10th of that has created something that millions of people can enjoy.\n\n(00:14:40):\nAnd I like to think that anyone along the Embarcadero, you might be going through a tough time, obviously we have people who are struggling with mental health and homelessness and everything like that, but maybe seeing a little bit of art can help raise your soul a little bit. And that's how I think about philanthropy as well. You need to work on the base issues, the fundamentals at the bottom of Maslow's Hierarchy of Needs, and then you also have to work on the things that raise your soul a little bit, so arts. So I like that barbell approach to philanthropy.\n\nLenny Rachitsky (00:15:13):\nElon has a great quote along those lines, \"You can't just work on solving problems all day, you need something inspiring to think about and to work towards.\" First of all, thank you for doing this. If you live in SF, you're like, this makes the city better, just having this around. I didn't realize you were involved in helping come up with the idea itself. I know that you did mortgaged your house to make it possible.\n\nMatt Mullenweg (00:15:32):\nI can't take any credit for the idea, I was exposed to it. I had an adjacent idea and they had a way cooler one with a real artist and everything like that. So I was just happy to be there. It's like being an angel investor, you can support the entrepreneurs and the people who truly do it.\n\nLenny Rachitsky (00:15:49):\nYeah, okay. And the other funny thing you said is about they were worried about the angle of the lights distracting people. What's funny is when I drive across the bridge, you can only see it when you're driving towards San Francisco looking backwards. So I'm looking in my rearview mirror or in the mirror turning around to the kind and it feels more dangerous, the lights shining in my face.\n\nMatt Mullenweg (00:16:07):\nThey call it impossible works of art. There were like 13 agencies that had to sign off, they were worried the lights would distract birds or seals or environmental reviews, and it was really a lot of public bureaucrats and to make that happen, there was 20 places where someone could have said no and it never would happen. So it's very inspiring to see the city come together.\n\n(00:16:31):\nAlso in San Francisco, I feel like is entering new chapter right now, going from the doom loop to the boom loop. I'm a big believer in the city. So much innovation has come here from food, the burrito, fortune cookies, all these sorts of things are from San Francisco to obviously all the tech innovation that we're all familiar with. It's kind of the city of the future and I don't know what it is in the water from the '60s until now, cultural innovations, things that happen and influenced the whole world, Burning Man, Grateful Dead, et cetera. That all starts in San Francisco. So it's exciting to be here.\n\nLenny Rachitsky (00:17:03):\nLet's set the so back, as they say on Twitter. Okay, someone very close to you told me that you're an excellent rapper. I'm not going to ask you to rap, but if you ever want to answer any questions in rap form, feel free.\n\nMatt Mullenweg (00:17:17):\nOh man, that would be fun. I've dreamed about being able to do a Q&A and rhyme, but I don't think I'm that talented.\n\nLenny Rachitsky (00:17:26):\nPlanting the seed, I'm planting the seed. So I want to get into all the drama there in this world and right now, but I want to first lay the foundation of how you got into this and where this all came from. So let's talk about just the origin story of you and open source. More than half of your life, you've been working on open source, you've been working on WordPress, specifically WordPress is such a core community within the open source. What was kind of the origin story of you becoming obsessed and, I don't know, open source-pilled?\n\nMatt Mullenweg (00:17:56):\nI was a broke kid in Houston, Texas, and my passions were jazz. Houston has actually amazing music programs in the public schools, and so I was very fortunate to go to some of the best civil arts programs, including my high school called the High School for Performing and Visual Arts, where Beyoncé went, Robert Glasper, amazing folks went there. And so music was a big part of my life, and actually economics. So I had this fun teacher, Scott Roman, who participated in our school in the Federal Reserve Challenge, which was run by the Federal Reserve that sets the interest rates and backs the national banking system and everything like that, has this competition for high school students. It ended up being the first academic competition this art school ever won. And yeah, first year we kind of didn't get that far, second year we went all the way to nationals so I got to meet Alan Greenspan, Ben Bernanke was our judge, went to DC. So that was very, very exciting.\n\n(00:19:01):\nAnd so being exposed to us having a great liberal arts education, the ideas of Frederick Hayek, Agnes Smith, Alexander Hamilton, Ben Franklin, Thucydides, all these sorts of things, that philosophy really influenced me. And combine that with that, music lessons were expensive, so we couldn't really afford them, so I would barter and trade. I'd build websites for local musicians and exchange for lessons. So these websites, I would start to put software on forums or different things and that kind of exposed me to open source. So my father was also an engineer, he worked for oil companies and things, but his world was all Microsoft, it was all proprietary. And I always kind of grew up in early days of the internet, so was Slashdots and Jeffrey Zeldman talked about web standards and all these things are really kind of the social milieu and zeitgeist that I grew up in.\n\n(00:19:56):\nSo combining all this philosophy I studied, it felt that open source was actually the most important idea of our generation. If the founding fathers were around today, I think they would be open source advocates. If you think about it as more and more of our lives are influenced and actually controlled by the software we use, if we don't have fundamental freedoms attached to that software, we're not truly free.\n\n(00:20:24):\nSo WordPress is under license called the GPL, which has four freedoms, the freedom to use the software for any purpose, so we can use it for anything, whether I agree with you or not, the terms of service is you could do whatever you want with it. The freedom to see how the software works, open up the hood, see how it works, see every line of code, you can audit it. The freedom to change it is the third freedom. And then finally the freedom to redistribute those changes so you can share them. And the GPL has a fun little hack where if you share them, you have to provide those same freedoms to who you share it with. So it's called a viral open source license as opposed to the MIT license or some of the others that aren't.\n\n(00:21:03):\nSo yeah, just kind of decided that this was what I was going to devote my life to. And so that became getting involved with some early open source projects, WordPress was actually a fork of abandoned open source project called B2. So the code base actually started was something that was already out there that I was a user and contributor to kind of volunteer on the forums and contribute code. And then when it was abandoned, myself and Mike were one of four or five different forks that started that, picked it up and tried to continue it for our own use and then later for our larger community.\n\nLenny Rachitsky (00:21:36):\nIt feels like a lot of people are coming around to exactly your worldview in, say, I was just watching a video of Jack Dorsey talking about how we're just controlled by algorithms and we don't know how they work and we are not in control of our lives. Have you seen that video?\n\nMatt Mullenweg (00:21:52):\nNo, but I actually love that. Also, some people who maybe made their first billion or whatever from proprietary software then come back and it's so cool to see folks like Marc Andreessen or Bill Gurley be huge advocates for open source. I actually remember one of my early meetings with Andreessen Horowitz, Marc Andreessen. I didn't realize that at the time, Tony Schneider and I were sort fundraising and Marc really grilled us, he's like, \"How can you build a business on open source? How can you be remote and distributed? Look around Silicon Valley, Google, Microsoft, Oracle, Sun, every great company has had an office. How are you going to build something that can change the internet with people all around the world?\" And just had this long hour long debate and we walked out of that, I was like, \"Wow, that was the worst meeting ever. They just hate everything we're doing.\"\n\n(00:22:48):\nAnd then the next day they were like, \"Hey, we're interested.\" I was like, \"What happened?\" I didn't realize that he had this idea where he wanted to attack the ideas and see how we defended it was how they battle tested things. I guess kind of like a Microsoft culture or whatever where you really grill the idea, I just wasn't familiar with that. But it's so cool now that some of these folks that I've learned so much from are such good advocates for open source.\n\nLenny Rachitsky (00:23:15):\nYeah, it's so interesting. I just had the Community Notes team on the podcast, and that's an amazing example of open source, Meta is adopting it from Twitter/X. Speaking of open source, one of the interesting, maybe most common ways people hear about open source these days is AI and AI models, and there's a couple areas here, one is you wrote this really interesting post where you talk about how Meta talks about Llama as an open source project, but you called it a false prophet. What is it about Llama that isn't open source? What are people missing when they see Llama and they're like, \"Oh, Meta is amazing open sourcing everything.\"\n\nMatt Mullenweg (00:23:52):\nLlama, you can obviously download and run locally and all these sorts of things, right? You don't have to use their SaaS service. However, there's a clause in it that says if you're above a certain threshold of monthly active users...\n\nMatt Mullenweg (00:24:00):\n... as if you're above a certain threshold of monthly active users. I forget what it is. It's big. It's like 750 million, so it's pretty high. You need a license from them. And so that does not give you the freedom to use the software for any purpose. If at some point you have to ask for permission, you're kind of at the whims of this company who you might be aligned with or you might be an enemy with. And also, how do you define that? So, for example, on WordPress, our products don't have 750 million monthly active registered users, but we reach billions of people per month in terms of visitors. So, is that defined? So, there's just ambiguity there. So, I still think what they've done is amazing and I like that they're releasing it. I was very confused for why they insist on calling it open source because they...\n\n(00:24:54):\nActually, Meta has been a huge open source contributor. React. They've had incredible improvements to the PHP engine, which we benefit from a lot. So, they're actually a big open source contributor. I think Mark Zuckerberg really understands and loves open source too. My best guess now, I don't have any inside information here, but I think they're calling it open source because there's some European regulation about open source versus proprietary AI models. So, I think it might be a weird regulatory thing because clearly they understand this isn't open source. When I wrote the blog post, I was just kind of confused, and thought, \"Oh, maybe if I get this message out there, they'll change.\" And then when they didn't, I was like, \"Oh, there must be something else going on. I think it might be this regulatory thing.\" We were actually a big part of, actually many, many years ago, I think it was React that they were doing something with a licensing or a patent restriction on, and the WordPress community actually got Meta to change that and reverse something they were doing to lock it down.\n\n(00:25:53):\nSo, I consider my role as an open source advocate to actually be my primary thing. And it's very much my life mission. I hope to work on WordPress the rest of my life, but also just open source in general. I also support Drupal and Joomla. Anything else that's open source, I'm going to be a supporter of because I think when people choose that versus proprietary software, we're increasing the freedom and liberty in the world. It's incumbent on us to make open source, to make a better user experience, to make a better product so that people choose it, and then the world becomes more free, not less free.\n\nLenny Rachitsky (00:26:36):\nIt also feels it's important to you to, I don't know, white open source washing, like avoid people using the term when it's not true. And it's interesting in this case, that the thing that makes it not truly open source is the limit. There's a limit where you can no longer use it the way you want. Is that the issue?\n\nMatt Mullenweg (00:26:53):\nYeah. And there's actually an open source OSI. There's a formal definition for what makes an open source license. And there's actually many dozens of open source licenses, and sort of public domain licenses and other things. So, it's also their stance that this is not an open source license.\n\nLenny Rachitsky (00:27:15):\nSomething else that I think is really interesting when it comes to AI and open source, you wrote about this and it blew my mind, such a good point, that the code that these models were trained on was open source code because that's all they have access to. They don't have Windows code, they don't have Shopify code. And what a cool, I don't know, another success story slash... I don't know. I guess, how do you feel about that, that all these AI models are trained on code you wrote in open source community?\n\nMatt Mullenweg (00:27:43):\nThat's beautiful. It's one of the safest things to train on, right, because the license of open source very explicitly allows that. I also like to think about I have some window where my creative output is useful to society. And if you fast forward like 50 or 100, I do believe that the utility for proprietary software eventually approaches zero. When we're sending people to Mars, the operating system of the rockets and the devices and everything like that is not going to be built on the Windows NT kernel, as amazing feat of engineering that that proprietary kernel is. It's going to be built on an open source kernel, Linux or BSD or something like that. And so if you want to be part of something that sort of becomes the fabric of humanity's foundation, like things that allows a Cambrian explosion of things built on top of it, a renaissance of ideas, you want to be involved with open source.\n\n(00:28:38):\nAnd so I really hope that more and more people... I'm a little bit of an evangelist here. I'm a missionary, where I really want to encourage more and more people to consider at least making part of their time, even if just a few hours a week, contributing to open source because you could be part of something that is a huge impact. And it's fun, especially if you're a younger developer or designer or PM or whatever, you can't walk up to Facebook and change your home page or say, \"I'd like to change this feature,\" but you could come to an open source project, some of which have hundreds of millions of users. You could go to WordPress or, gosh, Bitcoin.\n\n(00:29:20):\nOr there's all these things are open source, Chromium, Firefox, and you could actually change a feature or project management things or change the design or improve it. And that's I think really, really special. And sort of the thrill for me of knowing that code I wrote is now executing millions of times per seconds and millions of servers around the world, that kind of thrill, that high is, when I first had my first open source contribution, such a thrill. And I've been sort of chasing that and enjoying that ever since.\n\nLenny Rachitsky (00:29:53):\nSay someone wants to actually do this, where do they go? How do they do this? Do they just pick up a project, go to WordPress. org and here's how you contribute? What's a next step there?\n\nMatt Mullenweg (00:30:03):\nYeah, pick a project that you use or like. That's obviously a nice one. For WordPress, we have this... It's called make.WordPress.org. That's where we make WordPress. And there's different groups, there's accessibility, there's design, there's the core code, there's plugins, there's all sorts of ways. So, really whatever your talent is, there's people who translate, there's people who do support, there's people who write documentation, there's people who organize events, so whatever you feel like your talent in the world is either that you have or that you want to cultivate. I learned how to code while building WordPress basically. I didn't have too much formal training there. So, it's a great way to [inaudible 00:30:48] your skills as well, and work with some of the best developers and others in the world.\n\nLenny Rachitsky (00:30:53):\nThis also made me think about AI agents are coming around, Devin and all these AI driven coding agents. Do you have a prediction at when most of the code contributed to the open source projects will be Devin and AI agents such type projects?\n\nMatt Mullenweg (00:31:10):\nI think Google talked about 25% of their code or characters committed are now sort of AI-assisted, and they're probably on the bleeding edge. I don't know how much of WordPress's code right now is AI-assisted or something like that. But I think over the next five years it definitely approaches maybe a majority. And I'm actually very, very excited, so one of the big challenges that we have as a very open platform is we have this open plugin and theme architecture, so the 60,000 plugins and themes and the way WordPress works is these plugins and themes can modify every single part of the code, so you can really customize everything. However, many of these plugins and themes don't have the same sort of robust security and review process that core has. So, that's where when you hear about security issues with WordPress, it's very rarely in core anymore.\n\n(00:32:03):\nWe haven't had a remote exploit, knock on wood, it's like I think five or six years or something, but in the plugins it can be somewhat more frequent. And so one thing I'm very, very excited about the next year or two is actually more automated scanning because obviously that code basis is so many tens of millions, maybe over 100 million lines of code at this point. It's impossible for humans to review that, so we kind of rely on developers to review that and manage. And of course, we have bug bounties and everything do that, so when things get reported, we fix it quickly. But I can't wait for more automated scanning there, and I think that could vastly upgrade the security of open source. The other thing that's really exciting is right now you see people building apps and stuff and it's just sort of custom generated code, but I think the next generation of these models or sort of the next layer there is because...\n\n(00:32:54):\nAs everyone knows, just writing the code is just one part of it. It's maintaining it that really becomes the life cycle of it. And Stewart Brand's new book is all about maintenance, which I'm very excited about. He's publishing, I think, with Strike. And it's actually kind of open source. He's open sourcing the book, so you can see it being written online. But anyway, to go back, I think that if... And they're starting to do that, is when the open source models you say like, \"Hey, build me a website.\" It actually installs WordPress, and then builds on top of that, and then customizes on top of that. Then you get for free that core engine that's always being audited and updated and getting passkey support or whatever the new things are sort of continuously. And then your custom stuff can be on top of that, which I think is actually a lot more powerful than building something proprietary or custom from the ground up.\n\nLenny Rachitsky (00:33:43):\nI love this book concept about maintenance. My sister's partner has this quote that I've always come back to, \"Life is maintenance.\" You basically... Everything you acquire and deal with... You get a generator for your house, you have to maintain that forever now. You get this backpack, okay, now you have to maintain this thing, keep it nice, nice jacket. Everything is maintenance. Everything in your life is just maintenance. And I wonder if that's what the book's about.\n\nMatt Mullenweg (00:34:09):\nWell, that's why I think technical debt is one of the most interesting concepts. There's so many companies as well that maybe have big market caps, but I feel like they might have billions or tens of billions of dollars of technical debt. You can see in the interface or how their products integrate with themselves through things. And I think about that a lot in our own company. We definitely have some products, almost a little embarrassed coming on because you have such great product people. And we have some variable quality around some of our things right now. If you check out Gravatar right now, I'm actually really proud of it. It's I think a really great user experience, very slick. But there's parts of... Well, I always say, \"I'm the unhappiest WordPress user in the world,\" so there's parts of WordPress and WordPress.com that I'm a little embarrassed and ashamed of.\n\n(00:34:52):\nWe have a really large surface area that we cover with relatively few people, and so there's some parts we haven't looked at in a little while that we need to get around to. And it's a big focus for us this year, is actually kind of going back to basics, back to core, and improving all of those kind of nooks and crannies of the user experience, and also ruthlessly editing and cutting as much as possible, because we just launched a lot of stuff over the past 21 years that maybe is not as relevant today or it doesn't need to be there.\n\nLenny Rachitsky (00:35:21):\nThat sounds like excellent work for this AI agent of the future that's coming soon. There's one other area I want to mine and that's community, community building, building this ecosystem that you've created around WordPress. It might be one of the most successful, biggest communities on the internet. I'm curious just what lessons you've learned about what it takes to build a successful community, online especially.\n\nMatt Mullenweg (00:35:48):\nThis is probably influenced by economics and jazz. And economics is all about systems thinking. And what are the incentive structures of how you set something up? And then in jazz is all about collaboration. So, if there's something unique I have for your audience, I would say it's don't just build a product, build a movement. And to the extent that we've been successful, I think it's that we give people something to believe in, a philosophy, a worldview. Even silly things, like we had this tagline in the footer of the WordPress.org when we started, it's still there, it says, \"Code is poetry.\" This idea that we're not just writing code, we're trying to create something that can have elements. We name every WordPress release after a jazz musician for the past 60 releases or so. So, those sorts of things bring a little art and soul and some fun into it as well.\n\n(00:36:44):\nIt doesn't have to be serious all the time. I think they can give something to believe in and work on and aim towards that's more than just a paycheck or more than just the utility, the base utility of the software. So, it's not just the software, it's also like: how are the meetups? How are people getting together? What events are you running? Are there forums? How do people contribute? Is there office hours or town halls? I do a lot of Q&A. So, what are the things you're doing around the software that's allowing people to get involved, that's inviting contributions, that's allowing people to build on top of it? I've studied platforms quite a bit like Microsoft and others, so our whole ecosystem of plugins and themes is part of what's made WordPress so successful, and the moat that we have.\n\n(00:37:33):\nThe core features of a CMS, you can kind of write with a few developers in a few weeks or something. It's not... It's basically CRUD operations, but to replicate those 60,000 plugins and themes, gosh, no one's done it. That's a huge moat. And proprietary services can create platforms. Shopify has a third-party ecosystem and things like that, but it's never a true platform. And a true platform, it's when your ecosystem makes more money than the core does. And so many times, whether it was the Facebook platform, I'm putting that in air quotes, or the Shopify platform, companies build on it and then they get the rug pulled out from under them because they're too successful.\n\n(00:38:15):\nAnd then the sort of thing you're building on decides, \"Oh, we want that money or we want that growth.\" And they sort of change the API or remove your access. There's so many examples of this, especially on, I think, Facebook and Shopify and others, where people got too successful and all of a sudden they knock on the door and they say, \"Oh, that's a mighty nice app you have there. I'd love to offer you some warrants where we own a bunch of your company or we're going to shut it off,\" or those sorts of things.\n\n(00:38:42):\nAnd again, you don't have freedom unless you're building on open source. That's why more and more companies and people are choosing... If they're going to build a business on top of something else, if you build it on an open source, you have that guarantee. Even if I grew devil horns and became evil and automatic decided to know whatever, WordPress would still belong just as much to you as it would to me. People can fork the code. They can still own it. They can still build on top of it. So, those things I think are really important.\n\nLenny Rachitsky (00:39:13):\nWhat a segue to all of this drama that's swirling around you these days. I think a lot of people do feel like there's devil horns that have appeared, and so I'm excited to dig into this stuff. I find that every time you go on a podcast these days, if we don't get into this, everyone's just like, \"Why is Matt not answering these questions?\" Let's get into the hard stuff. So, I'm going to ask you some hard questions. For people that don't know what the hell's going on, they're like, \"What are you even talking about?\" or just have a sense something is swirling with WordPress and, Matt, I don't know what's going on, what's just like the high level overview of what's going on?\n\nMatt Mullenweg (00:39:48):\nSo ,to set it, you can get WordPress from WordPress.com or us, but also you can get WordPress from dozens of other hosts. The biggest in the world are like GoDaddy, Hostinger, Newfold. It's not the biggest, but it is in the top 10 or something. It has about 700,000 WordPress installs. There's a company called WP Engine. In 2019, WP Engine started as very WordPress oriented and they contributed a lot to the community and everything like that. They were very respectful about distinguishing themselves from core, so people really realized it wasn't officially associated and everything. But in 2019 they got bought out by a private equity firm called Silver Lake. And anyone who follows business, when private equity buys something, there's some the good ones, but there's also many, many stories about how they can really hollow things out, really optimize our profits, become user hostile.\n\n(00:40:45):\nActually recently read a story where one of the reasons there was a shortage of firetrucks these LA fires was that the fire truck manufacturers have been rolled up by a private equity firm, and they've been raising prices and their supply constraint and things like that. So, there's literally a shortage in firetrucks right now because of private equity. And of course, if you look at healthcare or other things, there's so many examples of where private equity can really, I think, be one of the darker parts of capitalism. So, since 2019, WP Engine has kind of changed a bit, and they really stopped contributing to core and they started using the trademark in a way that was very confusing in the marketplace. And particularly in the past year, year and a half or so, we're just getting lot... I get a lot of support for requests for WP Engine.\n\n(00:41:36):\nAnd when we do surveys, we'd find that 20, 30, 40% of people thought they were officially associated because how they were using our logo and presenting the brand and everything like that was very confusing to people. And as you know, if you don't protect a trademark, you lose it. And also the version of WordPress that they were offering actually wasn't our core vision of the functionality of WordPress. So to save money, they were actually turning off features like revisions. So, a cool part about WordPress that... actually one of my favorite features, is every change to every single post or page is saved forever, just like Wikipedia. So, if you make a mistake, you can always undo it. And of course, as building a great product, that sort of user safety of an undo is so critical.\n\n(00:42:19):\nNow, obviously you have to store these revisions, so it takes up more database space. Now, it's trivial, it's megabytes, so on modern databases is not that big a deal. But to save money, they actually turned us off, so they broke the undo feature in WordPress to essentially save money. And so you have this thing where they're offering something called WordPress. I think I refer to it as a bastardized hacked up version of it. It's diluting our brand, and then also people think it's official. So, even close friends of mine were like, \"Oh yeah, I signed up for this thing. I thought I was supporting you.\"\n\n(00:42:49):\nAnd it's came to a head. So, past 18 months they've also... We contacted them and said, \"Hey, you need a trademark license or something if you're going to use this or change how you're doing things,\" and tried to negotiate something and had many different term sheets over the months offered and different things, and they just kept stretching it out. And I was like, \"What's going on here?\" And I think part of what was going on is last year they tried to sell the company. So, private equity usually holds things for five to seven years, so they were kind of five years into this. They tried to shop it around and sell it. They weren't able to find a buyer.\n\n(00:43:25):\nThey said, \"Well, they don't have any IP, and it feels like they're using your trademark, so they're going to have trouble with you. They don't have a license and things like that.\" So, while they were negotiating with us, it appears they were also preparing this lawsuit against us. So again, I've been very fortunate in my business career that we've invested in dozens of companies, we've acquired lots of things, by and large, 99% of the time people I've dealt with in business have been ethical, straightforward, honest. I haven't really faced any baldfaced lying or duplicitous behavior. Very, very rarely people who just say one thing and do another or are fraudulent in their behavior, but I think that was happening here.\n\n(00:44:17):\nAnd so I also just wasn't prepared for it. I was thinking I was a little naive and kind of didn't realize what was going on for a while. So, it came to a head, and at WordCamp US in September, I was like, \"Okay, well, if you're still not going to even agree to negotiate, I'm going to give this presentation about how I think both private equity has messed up a lot of open source projects in the past, and how in particular, [inaudible 00:44:46] has done some very bad or evil things.\" And they were like, \"Okay, go for it.\" So, I did the presentation. I think it was on a Thursday or a Friday. Kind of spicy. People were like, \"Oh, can't believe he did that.\"\n\n(00:45:00):\nAnd then on Monday they launched this with Quinn Emanuel, which is kind of the baddest, nastiest law firm, it's like who Elon uses when he sues people, launched this big multimillion dollar lawsuit against both me personally and WordPress.org, so the WordPress community and Automattic. And also they're spending millions of dollars a month on both lawyers and PR. So, they're doing... If you read... Oh gosh, who was the celebrity that they were recently talking about this, like dark PR stuff where they're boosting things on social networks?\n\nLenny Rachitsky (00:45:35):\nOh, Blake Lively and-\n\nMatt Mullenweg (00:45:37):\nBlake Lively, yeah, yeah.\n\nLenny Rachitsky (00:45:37):\n... the other guy.\n\nMatt Mullenweg (00:45:38):\nSo, all that stuff is happening, so there's... And I warned people. I think in the presentation I say, \"Hey, there's going to be a smear campaign against me.\" And internally in the company, I was like, \"Hey, they're going to dig up everything that's ever happens. Anything bad anyone's ever said to me is going to all of a sudden become a news item.\" And that has happened. It's been true. So, right now there is a portion of the internet that does think I have devil horns and everything. Fortunately, this is not my first rodeo. I know a lot of people think like, \"Oh, Matt was nice for 20 years, and then got mean.\" But one thing, if you're really open and open source, sometimes you have to stand up the bullies, and you have to fight to protect your open source ideals.\n\n(00:46:19):\nOtherwise people could take advantage of it in a way that ultimately can destroy everything you've created. So, this is probably the fourth time the internet has decided I'm the main character or really evil. And the previous ones we don't remember anymore. It's Hot Nacho or the Easter Massacre of Themes or these are the things that aren't even on my Wikipedia page anymore, but those seemed like really big deals at the time.\n\nLenny Rachitsky (00:46:43):\nThose are your incidents. Those weren't like historical battles.\n\nMatt Mullenweg (00:46:46):\nNo, no, these are things that, yeah, I was involved in.\n\nLenny Rachitsky (00:46:48):\nCool names at least.\n\nMatt Mullenweg (00:46:49):\nIncluding some things I had screwed up, like Hot Nacho was definitely a screw-up on my end very early in the WordPress side, but...\n\nLenny Rachitsky (00:46:55):\nWow. Okay, I'm not going to follow those threads, but those are great names.\n\n(00:46:59):\nThis episode is brought to you by Loom. Loom lets you record your screen, your camera, and your voice to share video messages easily. Record a Loom and send it out with just a link to gather feedback, add context or share an update. So, now you can delete that novel-length email that you were writing. Instead, you can record your screen and share your message faster. Loom can help you have fewer meetings, and make the meetings that you do have much more productive. Meetings start with everyone on the same page and end early. Problem solved, time saved. We know that everyone is in a one-take wonder when it comes to recording videos, so Loom comes with easy editing and AI features to help you record once and get back to the work that counts. Save time, align your team, stay connected and get more done with Loom. Now part of Atlassian, the makers of Jira. Try Loom for free today at Loom.com/Lenny. That's L-O-O-M.com/Lenny.\n\n(00:47:59):\nSo, you mentioned this talk you gave at WordCamp, and you said at the beginning of the talk, like, \"I'm-\"\n\nLenny Rachitsky (00:48:00):\n... at WordCamp, and you said at the beginning of the talk... oh no, afterwards you were like, \"I was really nervous to give this talk,\" and obviously you can see why. Just what finally convinced you this was time? Was it just to go, as you described, scorched earth nuclear? Was it like WordCamp is coming up and this is the moment to go public with this? Was there something else that kind of crossed the line?\n\nMatt Mullenweg (00:48:24):\nIt was a unique opportunity because we were essentially saying that, hey, WP Engine isn't going to be allowed to sponsor WordCamps anymore. They're not going to be a... Because we had, again, up to that point really done everything to bring them in and have to be part of the community. So I really had to also explain to our community, hey, why we're going to be excluding this company that a lot of people saw as doing good. If you go to the WP Engine website, they have whole pages about how much they contribute and give back and how they... they do kind of greenwash or open source wash a lot of what they do. So all their marketing branding was around this positive stuff, and so I was like, \"Hey, we need to just explain this case.\"\n\n(00:49:03):\nBut yeah, again, my defaults and how we've worked with, by the way, every other company in the WordPress space, many of which are much, much larger and make sometimes billions more in revenue than WP Engine, is collaborative. So if there's a trademark violation, usually it's not even lawyers get involved. It's just like there's a email, we have a conversation, we do a call, we talk about it. That's how things get resolved and that's my default. I'm a lover, not a fighter, and that's why this thing doesn't happen very often. I like to say that, yes, if WordPress community or whatever was doing this like every year or every couple months, yeah, you should worry about it, but it kind of happens every like 10 years.\n\nLenny Rachitsky (00:49:46):\nSo if I could mirror back the issues that you ran into, and I want to go through this a little bit more, the problems you had with WP Engine in this case. One is they were using the trademark both WordPress and WooCommerce without license, and they're just abusing it, confusing people. A lot of people thought WP Engine was actually Automattic and WordPress official. They weren't contributing to the project. They were just making basically a bunch of money and not doing the work off this company they bought and they're just kind of hollowing it out as you described. And then they're also cutting corners, making the product worse, and that kind of reflects on the whole brand of WordPress.\n\nMatt Mullenweg (00:50:22):\nThat's a great summary, yeah.\n\nLenny Rachitsky (00:50:24):\nAwesome. I'm curious just which of those three, or is it something even else that most bothered you about this? What's just like, \"This is the thing that's eating me\"? If I had to guess, it'd be damaging the legacy potentially of this thing you've worked on for most of your life. Maybe it's that, maybe it's just taking advantage of the community. What's the thing that you think is the root of this, just like, \"Just this needs to stop\"?\n\nMatt Mullenweg (00:50:50):\nWell, I guess the one thing I'd add to your list was as this was happening they were pretending to good faith negotiate. And in fact, at one point the executive, we were talking about her joining Automattic and running WordPress out of Oregon and when she thought... the VP and she going to sell, she was thinking about what was next. So yeah, a lot of this stuff was, I think that duplicitous behavior also kind of forced us to an edge more than even those other things that you mentioned. There's lots of companies that don't contribute back and it's not as big a deal. But yeah, the legal issue was definitely the trademark thing. So what pushed it to the edge? I think just the magnitude of the issue. They would refer to themselves as WordPress Engine in client meetings and other things. They were very cavalier about how they would imply their association with the project.\n\nLenny Rachitsky (00:51:46):\nObviously, as you can tell on socials, a lot of people are just really upset and a lot of people blame you. There's just, like I said, every time you're on a podcast or on Twitter, people are just like, \"Matt, what about this? Why this sucks? Why are you doing this?\" And I want to go through some of those things, but just not many people go through... I think you were like a hundred percent beloved hero of open source and internet and now you're in this... a lot of people don't like you. Just as a human, just what is that? How do you work through that? How do you deal with that? What's that been like?\n\nMatt Mullenweg (00:52:17):\nIf you were kind of inside baseball with WordPress, it's actually a lot of people who have been unhappy with me over the years, and when we introduced something like Gutenberg, people hated it. Actually when we introduced a visual editor, people hated it.\n\nLenny Rachitsky (00:52:29):\nYou've had practice.\n\nMatt Mullenweg (00:52:30):\nThese are huge controversies in the WordPress history. There actually hasn't been a fork or WordPress around all this latest stuff, but there was when we introduced Gutenberg. It's one called ClassicPress where people actually forked the software. So how I would describe it is previously like 1% of the world thought I was terrible, and now I feel like it's up to like 4 or 5%. So it's still not the majority, but as you know, something negative you feel seven times more than something positive. And when people are angry with you, it's kind of like restaurant reviews or whatever, they're more likely to leave a bad review than a good review.\n\n(00:53:14):\nThe people who WordPress, 98% of all the core developers have stayed and contribute and are working on the next version and are supportive and all these sorts of things. And part of the reason these folks are so good is they don't spend all their time on Twitter and Reddit arguing with folks, and also the arguments could be... they're very frustrating because people don't engage in good faith. They don't really change their mind when new facts are introduced.\n\n(00:53:43):\nAnd so I've done my best actually because from the open source side I'm really used to engaging with things, and I think that's been one thing I've learned from this is in some forums it doesn't matter how you engage and especially if you have bots or other things running there. I'd leave comments on Reddit and immediately get like 40 downvotes. I'm like, \"Hey, this is a article about me and I'm adding a fact to the thing. Why is it getting downvoted? This is very relevant to the discussion.\" But it's literally hidden. So when you see that thread, you'd have to click like three or four times to see the comment I had left, and so it can really change the perception. And then when you read these things, I think it's just very human nature. Even folks very close to me, if you read a thread and it's all super negative, it's hard to not be influenced by that because we're social creatures.\n\nLenny Rachitsky (00:54:36):\n100%.\n\nMatt Mullenweg (00:54:37):\nNow the good news is I've had lots of credibility weighted support from people like Marc Benioff or other open source leaders or the core people in WordPress, Matias, Mary Hubbard, all the core committers. The international community actually, like just in Japan, they don't care about this stuff. So these are actually, if you look by number of commits and lines of code and everything like that, the folks who actually are most crucial in WordPress. So I feel like that's been a good balance as well for me because there are days where I'm like, \"Gosh, am I an idiot?\" or it could be really down reading all these things. So that is part of what allows me to balance and get back to that sort of positive, optimistic space that I think you need to be in to do great software and great work.\n\nLenny Rachitsky (00:55:27):\nYeah. The internet can be brutal. Let me go through a couple of specific things that people pointed out because I think you've been on a lot of podcasts and people haven't asked you these questions and I think a lot of people are just like, \"But, Matt, what about this? This is really bad.\" So let me just ask you a couple of things here. One is there's just like a frustration in the community around the instability that this has just caused in the WordPress community. I'll read you a couple quotes. \"Real people are receiving fewer projects on WordPress because C-suite are seeing WordPress as unstable because of this feud, and I work at Enterprise and we're very concerned about the stability of this platform and our projects.\" Just thoughts on that and the impact that it's had on the community.\n\nMatt Mullenweg (00:56:05):\nYeah, I think this is until this gets resolved... which by the way I hope it is soon. I think there's no business reason for this to continue. I really hope that they come to a settlement or something. We're ready. They could end this tomorrow if they wanted to. WP Engine could. We can't. We're just defending right now. So it's really incumbent on them. All of our competitors, by the way, are like, \"Great. WordPress, the king on the hill, all of a sudden we can use this.\" And so there's also not just from WP Engine, but also from all the competitors to WordPress, and all the people who would love to capture some market share, they're really leaning into this. So I've seen white papers, I've seen all sorts of things where people talk about this.\n\n(00:56:49):\nWe're actually in the next couple of days going to publish something really cool on the WordPress.org blog though that shows if you actually look at the numbers, like the activity, number of commits, plugin updates, downloads, installs of WordPress since September 20th when this all started, it's quite healthy. And so I'm not saying that there isn't examples of where someone lost a project or something like that. I'm sure it's happened. It's the internet's big. WordPress has so many millions of users and developers and everything that you're going to get some example. But by the numbers things are actually quite healthy, and in some ways it's not that there's no press is bad press, it's raised the awareness of WordPress quite a bit. So people who haven't talked about WordPress in years are now like, \"Oh, Let's talk about it.\" And so a little bit of drama I think, I wouldn't do this all the time, but a little bit can be a good thing.\n\nLenny Rachitsky (00:57:39):\nOkay, so one of the most common frustrations I've seen on the internet, people complaining is around the trademark. I don't know all the details, but my understanding is there's kind of a... you moved the trademark to be owned by the foundation and Automattic is exclusive rights to use the trademark. And I think people are like, \"Oh, I thought it was the foundation owned it, but maybe Matt still owns it and then you're trying to monetize it through this agreement with WP Engine.\" Is there anything you can share there that'll make people feel and see your side of the story?\n\nMatt Mullenweg (00:58:10):\nYeah, this is totally fair because it's complicated, but people are saying this has been private. This has all been very public and documented on the internet from the beginning. So WordPress.org has always been me personally, and I think because it's... part of the reason we started there is . com was not available when we started. So that's why we started on the .org and things like that. But I think people also assume .org means nonprofit or something, and that's sometimes true but it's not always. It's not a requirement of the .org domain. Then when I founded Automattic and when we did register the trademark that actually was registered under Automattic. So it used to be, for the first five years of the project or whatever, that Automattic just owned everything outright. And again, I had investors and the board and that was under the control of that.\n\n(00:59:06):\nNow, as Automattic became more successful I was able to consolidate some voting rights and other things and at least later advocate. Also remember, I was like 21 when all this was happening, so I was not maybe the most savvy about legal stuff or didn't always have the best advice. So later as I learned more, I was like, \"Oh, I want to actually take this out of the company and create a nonprofit.\" And so we ended up creating a nonprofit. Now the rules around 501(3)(C) nonprofits run the IRS are actually very strict. So that's also something as people assume, it's like, oh, doesn't the nonprofit run the software, and we applied for that originally and it was denied by the IRS.\n\n(00:59:47):\nSo we actually weren't able to put WordPress.org or the software itself under the nonprofit, but we were able to have sort of an educational purview. So what was eventually approved was sort of running the meetups and other things for WordPress, doing educational stuff. We sponsor a lot of learn to code or running workshops in other countries. We have this cool thing called do_action where we'll do a weekend where we take a bunch of nonprofits and build websites for them and stuff like that. So the nonprofit does a lot of exciting things there and then also negotiated with the investors and everyone at Automattic to actually put the trademark under the foundation.\n\n(01:00:31):\nNow the compromise there was that Automattic at this point is running WordPress.com. So to continue running that, which at the time had already tens of millions of users and everything, it needed a commercial license. And so the compromise is that the foundation would kind of own the trademark and license it out for non-commercial purposes. I had a license to run WordPress.org because obviously I need that. And then Automattic would retain the commercial license and the ability to sub-license that, so to sell that to others. So this was kind of the grand compromise and create this tripartite structure. I was very inspired by the three branches of government. So there's sort of power in each of those that I think sort of checks and balances each side of it which is on purpose.\n\nLenny Rachitsky (01:01:23):\nWow. Okay, I get why it's complicated. I get why people would be confused. This makes me think about OpenAI had a really strange structure and that got them in a lot of trouble, and it feels like when you're 21 you're like, \"Oh, this makes a lot of sense. What a great concept we've come up here,\" and then all this complexity just adds to a lot of confusion around what's going on. So thank you for addressing that. Another, there's a kind of related question I've seen a couple of times is just why don't you let that .org be run by a community. Why not just give that up to someone else and not just you that's there?\n\nMatt Mullenweg (01:01:53):\nYeah, and the frame of that question is kind of interesting because it implies I'm the only person making WordPress which is obviously not true. If you look at the daily commits and activity and everything, it is run by the community. So it's hundreds of volunteers every day that are actually doing the day-to-day work and making the daily decisions and everything happens. So there has been a radical delegation. However, there's ultimately a hierarchy, and I'm the CEO, so I'm like the final final decision-maker.\n\n(01:02:24):\nAnd so I think what people advocate for around this governance point of view is like, okay, well, install a board on top of you that ultimately makes decisions for the product or things like that. And there are other open source projects that have this structure. None of them have been successful as WordPress. So I think your audience in particular, is great software ever created by committee or does it more often reflects a vision of a leader or something that can allow us to... and I think particularly WordPress not just remaining relevant but actually accelerating growth over huge technological shifts over the past two decades.\n\n(01:03:12):\nWhen we started there was dynamic web apps or DHTML or JavaScript wasn't really a thing, and then the social web and then iPhones and then all this sort of stuff that's changed over time, and we've surfed a lot of these technological changes which is very, very hard to do. Most products do not remain relevant over multiple generational changes like that, and that's been because sometimes we've had to make very unpopular decisions. Gutenberg is a huge part of why WordPress is relevant today, and it's actually an open source project we do. It's the block editor. It's actually bigger than WordPress because it's not just used on WordPress, it's used on every WordPress site, but also like Tumblr, other people. I would actually love if Squarespace or Wix adopted Gutenberg. It's meant to be like a really open source framework.\n\n(01:03:56):\nBut anyway, if we had voted for whether we should do that or not, everyone would've voted against it or the majority would have. It was really a few core people of us in the community, Matias, myself, other core contributors, Ella, Andrew Ozz, that said, \"Hey, this is the future and it's going to take 10 years to do and it's going to be a long bet. It's going to suck for the first three or four years, and so everyone's going to hate it in the beginning.\"\n\n(01:04:20):\nBut then later with iteration, we've had I think now 200 releases of Gutenberg. We do sort of a very strict every two weeks release schedule since it started. It's going to get pretty good, and it's at that point now where it's actually getting pretty darn good. And the next phase of it, actually I'm so excited about, it's going to be collaboration. So all the real time co-editing like Google Docs and Notion has, it's coming out to this open source thing, and with the technological changes, we're actually able to do it peer-to-peer. So we don't need a centralized server. We can use WebRTC and other cool technologies.\n\n(01:04:49):\nI mean, anyway, I'm going sidelining, but I think that sort of more... and if you look at a lot of great companies, there's a board or whatever but ultimately there's an executive, and some of the most iconic companies of our generations are ones where the executive retains some majority of voting control or other things like that which I've been able to do with Automattic and with WordPress. And I definitely think about succession planning and everything like that, but if or when I'm gone I don't want to pass it to a committee. I want to pass it to someone else who can have a role similar to mine and really sort of try to be a steward.\n\n(01:05:34):\nThere ultimately is a check and balance on that because, again, the community could leave. They could fork the software. People could change. And so you're \"in charge\" quote, unquote, but you're also at surface. So it's a lot more being like a mayor than a CEO and that you ultimately are accountable to the folks who are contributing and new users and everything like that. So I do feel like there is a balance there. Some of this as well is that there's some people who aren't part of leadership who feel like they should be. So if you look at the Yoast or Korean things, these are folks who actually don't have commit status. They haven't contributed WordPress over the years and serve our normal hierarchy of the meritocracy of how you get the ability to commit code or things like that. They're like, \"Hey, I want to lead a release.\" That's cool, dude, but there's a process. We have different people lead releases over the years, but they kind of worked their way up to it.\n\nLenny Rachitsky (01:06:28):\nThis makes so much sense to me. That's one of the themes of the podcast, just the power of a singular visionary and leader, founder mode as we've all heard is trending these days.\n\nMatt Mullenweg (01:06:38):\nYou made famous, yeah.\n\nLenny Rachitsky (01:06:40):\nI wouldn't say that it was. Yeah, Brian shared it, but then Paul Graham pointed afterwards and then I renamed the title of that episode Founder Mode to [inaudible 01:06:49]\n\nMatt Mullenweg (01:06:49):\nI really want your [inaudible 01:06:50]\n\nLenny Rachitsky (01:06:50):\nIf I zoom out, what I'm sensing here is there's people that have this ideal of how something like this should run, but they've never actually worked at a place where a nonprofit board runs it, runs a thing, and have seen what that actually looks like. And so I think there's a big disconnect between the ideal in theory and how does great stuff get built.\n\nMatt Mullenweg (01:07:11):\nAnd one of the things I think we've tried to demonstrate with WordPress is actually it's kind of like a open source side and a nonprofit side and a for-profit working in concert. And one of the things people don't necessarily appreciate as much about why WordPress has been so successful is because of Automattic and things like Akismet doing anti-spam or WordPress.com having a free version of WordPress that is introduced over a hundred million people to the software in a way that you could just sign up for free. You don't have to pay for hosting or download it yourself or things like that.\n\n(01:07:43):\nSo that kind of for-profit, nonprofit, open source, working in concert I think is a really interesting model that we're starting to see a lot more companies do. It's actually very exciting to me that some of the things that were controversial when we started open source or distributed work are now the default for so many exciting new startups, and this whole ecosystems of really, really cool open source, like Cal.com for open source Calendly. There's so much cool stuff out there that actually there's a whole generation of younger entrepreneurs that I find very, very inspiring because they're also bringing modern design and web development and everything to open source which is very neat.\n\nLenny Rachitsky (01:08:21):\nI anticipate a blog post one day, \"I told you so, guys.\" Open source, remote work, I imagine there's a few more things there. There's one other thing I want to address. I haven't seen you talk about this. It comes up a bunch. It's around, this is very the weeds, but I think it's really important to people, and there's something here for a lot of people, the way you guys forked Advanced Custom Fields. So I think what happened here is you guys forked an existing plugin, I think somebody else's plugin, and then kind of pushed people to this plugin versus the original plugin. What can you share there?\n\nMatt Mullenweg (01:08:55):\nYeah, this is very complex. So WordPress.org has kind of like a app store. After WP Engine started suing us, creating millions of dollars of legal fees and things, we blocked their access to WordPress.org. So this plugin they had, Advanced Custom Fields, wasn't able to be updated. At the same time a number of security issues were found in it, including some we reported, and so there had to be an update to it. So we're like, \"Okay, we'll ship the update for you essentially.\" And then we were like, \"Okay, I think we need to call it something different because it actually isn't theirs anymore.\" And they still offer Advanced Custom Fields on their own and people can download it from them, et cetera. So we made Secure Custom Fields which was originally under the same directory listing, so again, because we want all the users of it to get the security updates. This is controversial, and actually they actually got a preliminary injunction, so the judge said \"Reverse this.\" So this has all been reversed by the way.\n\n(01:10:04):\nThere now is a separate fork under separate listing of Secure Custom Fields which actually we have a team on it, developers, designers, and we're creating... just like WordPress was a fork, we've actually forged this. Actually WooCommerce was a forge. A lot of things are forks. So we forked it and now have a new name, new everything that we're doing a lot of product innovation and improving it. So there's a separate project now and separate directory listing for Secure Custom Fields. That's kind of fast-forward to today. They now have access to WordPress.org again. They have updated the plugin. Everything's back to how it was before, and there's now this separate thing called Secure Custom Fields that the WordPress project is officially supporting.\n\nLenny Rachitsky (01:10:46):\nSo I'm hearing essentially you blocked WP Engine as a part of this, we're just going to simplify WordPress, reduce confusion. They're being bad actors in the space, so we're going to block them, and in that block, there's like a dependency where people couldn't do a thing that they needed to do. So you're like, \"And the one that exists, there's a problem with it, so we're going to make that dependence... release a version that you can actually use and fix the security issues.\"\n\nMatt Mullenweg (01:11:09):\nThat was the intention. I think that there was a lot of perceptions around it that were different, but yeah, that was the goal.\n\nLenny Rachitsky (01:11:14):\nOkay. Okay. Great. So maybe just the last question. We talked about just a lot of people see you with devil horns these days. They think you're doing bad things and they don't like the approach you're taking. You talked about there's this WP Engine spending a lot of money on PR and hiring this agency. I guess is there anything else that... why do you think so many people are looking at you as the bad guy? Is it mostly that you think... just where do you think it's coming from? Why are comments always so negative? And we talked a bit about it, but anything more there?\n\nMatt Mullenweg (01:11:46):\nI don't know if I can say why. I do think one thing I've learned is that a lot of these things we've talked about are nuanced. So one essentially thing I've learned in this process is that it's hard to explain this stuff in 240 characters or the-\n\nMatt Mullenweg (01:12:00):\n... 40 characters. Some mediums do not lend themselves well to discussing this. And so I tried, but I'm participating less in Reddit or Twitter and trying to do more long form things like this, where you can actually have the context and things can't be taken out of context. Also, I think there's something where social networks sometimes are tuned to promote outrage. And it was very interesting. We ran a sentiment analysis recently. We were kind of looking at different social networks, analyzing all the comments, and we found, actually, that the negative, the sort of devil horn fraction on, what was it, like LinkedIn, Facebook, Instagram was like 8%. It's actually pretty small. On Reddit, it was bigger, I forget the exact number, but on Twitter it was 52%. You're like, whoa, what's going on there?\n\n(01:12:53):\nAnd so there's something in the algorithm, and again, we can't see how the algorithm works or what the incentives are, but it can promote the most controversial things. I think that's not a novel perception. There's a lot of discussion around how social media might be creating more fragmentation in society, and I think this is just an example of that, where when you have networks, when people are getting the majority of the information from social networks, and those networks are not designed to provide nuance or balance, or even promote truth necessarily, misinformation can get spread far more than... What's the saying? Like a lie gets around the world seven times before truth has time to-\n\nLenny Rachitsky (01:13:30):\nGet out of bed.\n\nMatt Mullenweg (01:13:31):\nGet out of bed, yeah. There's been a lot of that. So there's actually been a lot of misinformation, untrue things that go viral, and then the untrue thing gets like 700,000 views, and the correction gets like 20,000 views. So there's been some of that happening. When mainstream media has covered this, it's actually been a lot better. So there's been some actually really good articles in some business publications and other things that sort of look at a more nuanced and balanced view. And I think the podcast have been pretty good, but definitely on Twitter, I think you can get a version of all of this that is both, I think, not entirely true and also pretty more negative.\n\nLenny Rachitsky (01:14:15):\nYeah. I imagine people are going to be like, \"Lenny, you didn't ask him this thing. Here's the thing he said that I want to learn more about.\" I'm sure I missed some stuff, but from an outsider's perspective, this all make sense. There's a company, I don't think PE companies are bad innately, but their job is buy a company and make it run more efficiently, and then oftentimes sell it for more. So it makes sense that they buy a company, make it more efficient, cut some corners, don't put a lot of effort into making it awesome, even though I'm sure there's awesome people working in there, trying really hard to make it great. And basically what I'm feeling is they got to a point where this is hurting the ecosystem. They're feeling really dishonest with working with you, and there's a stalling technique. And so, makes sense to me why you just have to stand up and fight back. And it's hard, it's hard to do that. Is there anything else along this thread before we move on to a different topic, anything else you want to share before we close out this chapter?\n\nMatt Mullenweg (01:15:15):\nWell, if people have more questions, they can come to WordCamp Asia. We're going to do an open Q&A there. We do town halls in the WordPress.org Community. There's a Slack people can get on and ask questions. So there is kind of a lot of open ways to engage, and I'm definitely happy to do that. I'm probably not going to do it on Twitter as much, but when there's longer form opportunities to have a discussion here, particularly if it's more like real time, like this, I'm very happy to.\n\n(01:15:43):\nAnd that's why if you look at it, there's actually a big difference. WP Engine has not done any podcasts and no press. They don't respond to journalists, they don't talk about this. And I've done the opposite, where I'm really trying to be out there and engaged. And everyone's like, \"Why don't you just let the lawyers do the talking?\" And it's like, well, but we have community, and also I feel like we're in the right. So when you're in the wrong, you probably say only have the lawyers talk. When you're in the right, I think you should be out there and telling the story.\n\nLenny Rachitsky (01:16:10):\nI remember at the end of your WordCamp talk, you were like, \"Any questions?\" after this big controversial talk, and I'm curious how it felt. All the questions initially were nothing to do with this. It's what it felt like. You're just like, oh, they already had these questions. They didn't even know what you said maybe, and I bet you're just like, wait, did anyone hear what I just said? Did it feel like that?\n\nMatt Mullenweg (01:16:28):\nWell, also, that's really like a WordPress community event, so it's a lot of the core developers and things, so they have WordPress questions, so that is something.\n\nLenny Rachitsky (01:16:37):\nYou're like, hello.\n\nMatt Mullenweg (01:16:38):\nI've now done hundreds and hundreds of these town halls and QAs, and I really enjoy it because you never know what's going to come up.\n\nLenny Rachitsky (01:16:42):\nYeah, okay. I want to talk about all the companies that you bought and will buy in the future. It's kind of like you're building a little Berkshire Hathaway. I think you've described it that way. It's kind of what it's feeling like. And Tumblr is really interesting. Until I started prepping for this, I didn't even know you guys own Tumblr. I haven't heard this story. Why did you guys buy Tumblr? What is going on with Tumblr? It was like a big deal back in the day. What is the current state of Tumblr? What is the story there?\n\nMatt Mullenweg (01:17:10):\nOh, Tumblr is so interesting. At the time, I think it was one of our best competitors. They created this really amazing sort of hybrid of blogging and social networking. And if you kind of zoom back, a lot of things that are now standard on other social networks, even the ability to embed an image with a post, again, it was not supported originally on Twitter and other things. Remember they used to have, what was it, like tweet image, or you have to linked out to other things to post an image to Twitter. It wasn't native functionality, and Tumblr had these multiple post types. You could post a chat, an image. They were, I think, one of the first to support video, so they did a lot of, I think, product innovation under the leadership of David Karp, who's a really amazing entrepreneur and product leader.\n\n(01:17:54):\nFunny story, both David and I were at CNET at the same time. They had hired both of us.\n\nLenny Rachitsky (01:17:59):\nWhat an alumni group at CNET.\n\nMatt Mullenweg (01:18:02):\nThey could have kept both of us probably. But anyway, the Tumblr, I forget the year, but they sold, I think the same time that Instagram did, for a similar amount, $1.1 billion.\n\nLenny Rachitsky (01:18:14):\nTo you or to someone else?\n\nMatt Mullenweg (01:18:16):\nInstagram bought by Facebook, obviously.\n\nLenny Rachitsky (01:18:19):\nRight, right. Tumblr.\n\nMatt Mullenweg (01:18:20):\nAnd Tumblr bought by Yahoo.\n\nLenny Rachitsky (01:18:21):\nOh, wow.\n\nMatt Mullenweg (01:18:22):\nWho was at the time, again, Yahoo, we don't think about it now, but I feel a little old. But at the time, Yahoo was one of the internet giants and had recently Marissa Mayer, who was one of the big early people at Google, I think part of creating the API program and everything like that, was the CEO of Yahoo. This was, I think, one of her first big acquisitions.\n\n(01:18:46):\nNow subsequently, obviously ,we know how Instagram went. I think people were like, \"I can't believe you bought this for a billion dollars.\" And obviously now it's worth hundreds of billions. So that's had a really good trajectory. At Yahoo, I think things became more challenged. So again, this is a little bit of history, but Yahoo then had this thing where they owned part of Alibaba, which then became more valuable than the rest of the company. They had activist investors. I think they had some CEO switches. I think Marissa Mayer leaves or gets fired at some point. There's all this turnover, and I think Tumblr really languished under their ownership. And from what I can understand, the team was actually held back a lot from things they wanted to launch or ways they wanted to iterate. Then Yahoo merges with AOL, which is another kind of early internet thing. That goes for a little while. So again, then Tumblr's just kind of stuck underneath this stuff.\n\nLenny Rachitsky (01:19:43):\nTumbling along.\n\nMatt Mullenweg (01:19:45):\nTumbling along. And then that gets bought by Verizon. So fast-forward to 2019. Verizon wants to get rid of Tumblr. And so they're kind of putting it up for sale and had a number of bidders. Automattic ended up buying it for a de minimis amount. I think it's been reported we bought it for $3 million.\n\nLenny Rachitsky (01:20:10):\nWhat a deal. 3 million.\n\nMatt Mullenweg (01:20:14):\nBut obviously, that represented a lot of value destruction over the years. Tumblr had had some tough times. They actually were banned from the App Store at one point for not moderating things well enough and having maybe a little too much porn. Obviously, Twitter [inaudible 01:20:31] porn. They maybe were a little too out there with it, and we're doing a good job filtering it and keeping away from App Store reviewers or whatever. And so Verizon, to their credit though, there were people bidding more. Actually I think a porn company was bidding on Tumblr that would've paid a lot more money. They really were looking for an acquirer that they felt like would be a good steward. From my point of view, I had such incredible respect for Tumblr as a product. And the community, still, despite all of this sort of stuff that had happened, I think at that point still was like, I forget the exact number, but call it 15, 20 million monthly active users.\n\n(01:21:14):\nSo really, sort of active core. And one of the things that's so fascinating is over half of that user base was under the age of 25. And actually had a huge, I think, it was like 25 or 30% LGBT+. I think a very unique place on the internet, where people could have a social network where they could be anonymous, they could put on different identities, they could be someplace their parents weren't, like Facebook or Instagram, really still could take a special spot. So we ended up buying it. Now, people are like, \"Oh, you bought it for $3 million.\" But we bought it sort of taking on all liabilities, including, I think they were under investigation by the FTC, there were lawsuits. There was all this sort of stuff. So it was free like a puppy, not free like-\n\nLenny Rachitsky (01:22:01):\nFree like beer.\n\nMatt Mullenweg (01:22:05):\nHad a pretty big team, I think 185 people. We were taking a lot of burners, burning a ton of cash, and that was 2019. And so, it's been, I think, a humbling experience running a social network. It was very, very different from all the other products that we've done. And I think there's some incredible things about Tumblr and that I'm still very excited about. So where WordPress has primarily a desktop and web user base, Tumblr is obviously like 85% app-based, has a younger demographic. And so part of the vision that now we're executing on is actually we wanted to create a path for people using Tumblr to actually it being powered by WordPress on the back end. So Tumblr users could unlock themes, customization, plugins, et cetera. Actually, we're in the process right now of migrating the half a billion Tumblr sites to WordPress, probably one of the largest data migrations-\n\nLenny Rachitsky (01:22:58):\nThat makes sense.\n\nMatt Mullenweg (01:23:00):\n... that's happened in a while. So we're kind of trying to do this in a way that's invisible to users on the front end, so changing at the back end while maintaining the APIs and the interface and everything. So it's a fun engineering project. I kind of posted this kind of call to arms, got a lot of fun people applying for Automattic, and we hired a lot of great folks around this sort of audacious project, this big hairy audacious goal. And so that's where it's at now. I've sort of ran it personally for a few years while we're doing turnarounds, but there's a great team there, but still challenged, still not profitable, so we're still subsidizing it from the rest of Automattic's businesses. Fortunately, the rest of our business have done really well, so we were able to do that, but I definitely want to get to a place where it's sustainable.\n\n(01:23:46):\nAnd one of the things we're also experimenting with is can Tumblr have not just an advertising-driven model? I think ultimately the incentives of advertising social networks can lead to the kind of dynamics that you see on the more negative side of Twitter, Instagram, Facebook, et cetera. And so really trying to create a subscription model or a sort of first-party user-driven advertising, where you promote your blog posts or something like that, or you promote a WooCommerce product or something, where it's not a third-party ad ecosystem, which I think has a lot of weird code and malware and lots of stuff I don't love.\n\nLenny Rachitsky (01:24:21):\nWow, sounds like a lot you took on with this acquisition, and I love that you said you ran it initially. So this is a good segue to maybe my last question. I'm curious where this goes. Just how do you... Well, let me zoom out. There's a lot of people these days that are excited about roll of businesses. I'm going to buy a bunch of companies, make them better, make them awesome, save money, and then just keep building this holding company sort of thing. You guys are doing that, and it's working well. What do you look for? How do you decide a company's right for Automattic? What are the factors that are like, we should buy this, we can turn this around and turn it into a big success?\n\nMatt Mullenweg (01:24:58):\nI don't know if I would do another turnaround like Tumblr again, or at least not for many, many years. It's definitely a different thing. The vast majority of things we acquire, it's simply something that's done well, and we want to accelerate it, or sometimes acqui-hires, where we're plugging it into one of our existing projects, or we're taking the team and putting them on something we're already doing. So it's a really talented team. Tumblr, I think we ended up ultimately replacing 85, 90% of the team as well. So that's just very different. So I do think there are different ways of doing it, but if you look at our other acquisitions like Day One, et cetera, founder's still here, many years later, we're accelerating stuff like that. We brought it to Android, we're bringing it to it to web. It's more of taking something good and making it better. And probably our best example there is WooCommerce, which was a small company, I think 35, 40 people, based out of South Africa, and has obviously grown to... Again, I said Automattic makes about half a billion dollars a year now, and WooCommerce is a majority of that.\n\nLenny Rachitsky (01:26:06):\nSpeaking of that, actually, you haven't shared the revenue number. I know it's public. Just give people a sense of Automattic's revenue. Can you just share those numbers? Because I think it might blow people's minds.\n\nMatt Mullenweg (01:26:15):\nYeah, I think we say publicly it's about a half a billion dollars in sort of ARR revenue right now.\n\nLenny Rachitsky (01:26:20):\nIncredible. Okay. I have a question for you. It's kind of a hot seat question. As you talked, I wonder, I feel like people are thinking of this. So you've been talking about PE companies being often bad. You're buying Tumblr. You've talked about laying off a bunch of people, turning it all around. How's that different from a PE company, Matt?\n\nMatt Mullenweg (01:26:39):\nYeah, and I agree with you that just because it's private equity doesn't mean it's bad. And also, something people say is like, \"Hey, wait, don't you have private equity investors as well at Automattic?\" And we do. Now, they own usually a small percentage, sometimes under 1%, and they don't have control of the company. So I think there's a distinguish. Is it a minority investment or a control investment? And with WP Engine, Silver Lake controls the company. And when they control the company, I think there's a spectrum of actions. Obviously, being more efficient is great, and we should all strive for that. And I think every business does, whether it's private equity or our business or things that are founder controlled. You always want to be more efficient. Now, there's some spectrum there where you over-optimize, or you could have dark patterns. Right now on WP Engine, it's very difficult to cancel your accounts. Actually, I think as of today, 45,000 sites have left, so they're, I think, down to 600. Yeah, well, because their customers have realized like, \"Hey, this isn't WordPress, this isn't...\" or, \"They're suing the guy who started WordPress, so maybe we should not support this commercially.\" So we have the site wordpressenginetracker.com that sort of shows in real time the sites that are leaving. It's kind of an exciting thing to see that number tick up. Actually, maybe a good example as well, even though there's a lot of negativity, you actually look at how people are voting with their wallets. They're leaving.\n\n(01:28:07):\nSo I think you have to judge as well, just look at the track record. So one of the things I'm very proud of with Automattic is we are an acquirer of first resort, and we have founders that have sold to us. Paul Mayne at Day One is a great example that didn't need to sell. They're wildly profitable, could have run it himself for a long, long time, but people choose to join because they feel like we'll be good stewards of it in the future, and ultimately just have to look at the track record.\n\n(01:28:36):\nSo I think don't judge it by what it's called, judge it by the actions over time. And I hope to continue building that reputation for a place that's a good steward of communities and software and everything else for many years to come.\n\nLenny Rachitsky (01:28:52):\nMatt, we covered so much. I asked you all the hard questions and more. Before we wrap up, is there anything else that you want to leave listeners with? Any last thoughts, comments, insights, stories?\n\nMatt Mullenweg (01:29:04):\nYeah, follow me. I'm at photomatt, P-H-O-T-O-M-A-T-T, on Tumblr, Twitter, Instagram, everything like that. I post a lot about other stuff. I post a lot about AI and open source and other things. Some WordPress things in there as well. I have these life missions to democratize publishing and commerce. We added a new one last year, which is messaging, so it's in beta mode right now, but relaunching in a few months as a product called Beeper, which takes all your Telegram, Instagram DMs, Signal, everything, brings it all into one app. And you can do some really cool stuff like that, and especially when you start to imagine search or AI, local AI around that. So very, very excited about that relaunch. So I encourage people to, you check out the beta now, go to beeper.com/beta to get the new version, and we're going to relaunch that later in the year.\n\n(01:29:50):\nSo yeah, I'm very excited about that. It's kind of fun to be working on something that's at the stage where WordPress was in 2003, 2004. So WordPress is quite mature at this point. WooCommerce is kind of where WordPress was in 2010. And then the Beeper stuff, the messaging stuff is where we were in 2003. So one thing that keeps me excited is working at different stages of this.\n\nLenny Rachitsky (01:30:12):\nThis feels like a reason to be doing your approach to Berkshire Hathaway is just stay active in early stage stuff and not just optimize established things. So it's beeper.com, by the way, awesome domain name. Photomatt, what's the story of photomatt? You're into photography, I imagine, is the story?\n\nMatt Mullenweg (01:30:32):\nYeah, it's a little bit of a pun. So a fotomatt is also, F-O-T-O-M-A-T-T, is a place that you would go to develop your photos back when you would have film and develop things. So originally my username was Saxmatt because I played the saxophone. Sometimes people mishear that. And also, I started traveling so much. There's been years I do like 400,000 miles of air travel, because I go around the world to go to WordPress events and meet the community. And as a distributed company, we do lots of meetups. And so, it became hard to carry my saxophone around. So my method of artistic expression became photography, and that's actually kind of how WordPress started, was actually originally a site where I could share my photos before Flickr, before Facebook and everything like that, sort of use this gallery software, actually open source gallery software, PHP software, to sort of share all the photos I was taking.\n\n(01:31:25):\nAnd actually now on my website, I think I have over 38,000 photos I posted. And yeah, it's still one of the things I really love. So it's also a username that was available everywhere, and I still do it. So I'm actually going to the Maha Kumbh Mela, the big 300-million-person gathering at the Ganges River in a few weeks. And one, I'm just excited to experience that, it happens every 12 years, but two, I'm just really excited to take some time to do photography. And yeah, I really enjoy it.\n\nLenny Rachitsky (01:31:56):\nYou forgot to mention your website and your blog, your WordPress site itself, where you blog. Ma.tt, is the domain, which is amazing. I will point people to one of my favorite ritual you have on your blog, which is you share what's in your bag, you talk about how you travel all this, and I think every year you're like, here's the gadgets I use most and bring with me everywhere.\n\nMatt Mullenweg (01:32:18):\nIt's my most popular post of the year by far.\n\nLenny Rachitsky (01:32:20):\nI'm not surprised. You need an Amazon, just buy everything button. Yeah, because basically you're just trying to optimize for the least weight and most utility, right, out of all these gadgets that you're bringing with the on trips.\n\nMatt Mullenweg (01:32:33):\nYeah, actually weighing it is something I just started doing this year because my bag actually got really heavy, got like 35 pounds or something. And so, some friends were like, \"Hey, why don't we weigh everything and just go through.\" So now I'm posting the weights.\n\nLenny Rachitsky (01:32:45):\nOh my god. Okay. Anyway, we'll point people to that. Matt, thank you so much for doing this. This was awesome,\n\nMatt Mullenweg (01:32:50):\nLenny, thank you so much. And I really appreciate the ability to discuss these things in a longer form. And also just your audience. Oh, I guess final thing I'll say is we're hiring a ton. So you have one of the most incredible audiences in the world. I recommend your podcast and newsletter to a lot of my colleagues. And so, if you're someone who loves this kind of stuff, I think there's a big opportunity at Automattic to have an impact on these things.\n\nLenny Rachitsky (01:33:11):\nWhat roles are you hiring for most and where do people find these roles?\n\nMatt Mullenweg (01:33:15):\nAutomattic.com, A-U-T-O-M-A-T-T-I-C. There's a Work with Us page. You can kind of see how we work. We're fully distributed and can manage that forever. We sort of started that. Another interesting thing is we actually pay the same salaries globally. So whether you're in California or Italy or Nigeria or wherever, we pay global salaries. So yeah, a lot of opportunities, and we're hiring for kind of everything, I would say, but particularly people with great design or product skills is probably one of the areas that you can have the biggest impact at Automattic right now.\n\nLenny Rachitsky (01:33:53):\nAll right. If you made it this far into the podcast, you should definitely apply. Matt, thank you. Thank you for being here. Bye, everyone. Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or a leaving a review as that really helps other listeners find the podcast. You could find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "你人生一半以上的时间都在从事开源工作，特别是在做 WordPress。WordPress 在开源社区中占据着如此核心的位置。能聊聊你是如何开始痴迷于开源的起源故事吗？我不知道该怎么说，就是你被开源\"洗脑\"的过程？\n\nMatt Mullenweg (00:17:56):\n我当时是德克萨斯州休斯顿的一个穷小子，我热爱爵士乐。休斯顿的公立学校其实有很棒的音乐项目，所以我很幸运能参加一些最好的艺术课程，包括我的高中——表演与视觉艺术高中，Beyoncé、Robert Glasper 这些了不起的人都是从那里毕业的。所以音乐是我生活的重要组成部分，还有经济学。我有个很有趣的老师叫 Scott Roman，他带我们学校参加了联邦储备挑战赛，这是由设定利率、支撑国家银行系统的美联储举办的高中生竞赛。这最终成为我们这所艺术学校赢得的第一个学术竞赛。是的，第一年我们没走多远，第二年我们一路打到了全国赛，所以我见到了 Alan Greenspan，Ben Bernanke 还当了我们的评委，我们去了华盛顿特区。那真的非常激动人心。\n\n(00:19:01):\n所以接受了良好的博雅教育，接触到 Frederick Hayek、Adam Smith、Alexander Hamilton、Ben Franklin、Thucydides 这些人的思想，那些哲学真的影响了我。再加上音乐课很贵，我们负担不起，所以我会以物易物。我给本地音乐家做网站来换取课程。做这些网站时，我会在论坛或其他地方添加软件，这让我接触到了开源。我父亲也是工程师，在石油公司工作，但他的世界全是 Microsoft，全是专有软件。而我成长在互联网早期，所以是在 Slashdot、Jeffrey Zeldman 谈论网络标准这些东西的社会环境和时代精神中长大的。\n\n(00:19:56):\n所以结合我学习的所有这些哲学，我觉得开源实际上是我们这一代人最重要的理念。如果国父们今天还在，我认为他们会是开源倡导者。想想看，随着我们的生活越来越多地被我们使用的软件影响甚至控制，如果我们对这些软件没有基本的自由权，我们就不是真正自由的。\n\n(00:20:24):\n所以 WordPress 采用的是 GPL 许可证，它有四大自由：为任何目的使用软件的自由，所以我们可以用它做任何事情，不管我是否同意你，服务条款就是你可以用它做任何你想做的事。查看软件如何工作的自由，打开引擎盖，看看它如何工作，查看每一行代码，你可以审计它。第三个自由是修改它的自由。最后是重新分发这些修改的自由，这样你就可以分享它们。GPL 有个有趣的小技巧，如果你分享它们，你必须向分享对象提供同样的自由。所以它被称为病毒式开源许可证，不同于 MIT 许可证或其他一些非病毒式的许可证。\n\n(00:21:03):\n所以，我就决定把一生都投入到这个事业中。于是我开始参与一些早期的开源项目，WordPress 实际上是从一个被放弃的开源项目 B2 分叉出来的。所以代码库最初是已经存在的东西，我是它的用户和贡献者，在论坛上做志愿者并贡献代码。当它被放弃后，我和 Mike 是四五个不同分叉中的一个，我们接手它，试图为我们自己的使用继续开发它，后来是为了我们更大的社区。\n\nLenny Rachitsky (00:21:36):\n感觉很多人现在都开始认同你的世界观了。我刚看了 Jack Dorsey 的一个视频，他说我们被算法控制，我们不知道它们如何工作，我们无法掌控自己的生活。你看过那个视频吗？\n\nMatt Mullenweg (00:21:52):\n没有，但我其实很喜欢这个观点。还有，一些可能从专有软件赚到第一个十亿或什么的人，后来又回来了，看到像 Marc Andreessen 或 Bill Gurley 这样的人成为开源的大力倡导者真的很酷。我记得我和 Andreessen Horowitz 的 Marc Andreessen 早期的一次会面。我当时没意识到，Tony Schneider 和我在筹款，Marc 真的把我们盘问了一番，他说：\"你们怎么能在开源上建立业务？你们怎么能远程分布式办公？看看硅谷，Google、Microsoft、Oracle、Sun，每个伟大的公司都有办公室。你们怎么能用分布在世界各地的人来建立一个能改变互联网的东西？\"我们进行了长达一小时的辩论，走出来时我想：\"哇，那是最糟糕的会议。他们讨厌我们做的一切。\"\n\n(00:22:48):\n然后第二天他们说：\"嘿，我们有兴趣。\"我当时想：\"发生了什么？\"我没意识到他有这样的理念，他想攻击这些想法，看我们如何防御，这是他们测试想法的方式。我猜这有点像 Microsoft 的文化，你真的要拷问这个想法，我只是不熟悉这种方式。但现在真的很酷，一些我从他们那里学到很多的人成为了开源的优秀倡导者。\n\nLenny Rachitsky (00:23:15):\n是的，这很有趣。我刚刚请了 Community Notes 团队上播客，这是一个很棒的开源例子，Meta 正在从 Twitter/X 采用它。说到开源，现在人们听到开源最常见的方式之一就是 AI 和 AI 模型，这里有几个方面。其中一个是你写了一篇很有趣的文章，谈到 Meta 把 Llama 说成是开源项目，但你称它为\"假先知\"。Llama 有什么地方不是开源的？当人们看到 Llama 并认为\"哦，Meta 太棒了，开源了所有东西\"时，他们错过了什么？\n\nMatt Mullenweg (00:23:52):\nLlama，你显然可以下载并在本地运行之类的，对吧？你不必使用他们的 SaaS 服务。但是，其中有一个条款说，如果你超过一定的月活跃用户阈值......\n\nMatt Mullenweg (00:24:00):\n......如果你超过一定的月活跃用户阈值。我忘了具体数字了，很大，好像是 7.5 亿，所以相当高。你需要他们的许可。所以这并没有给你为任何目的使用软件的自由。如果在某个时候你必须请求许可，你就会受制于这家公司，你可能与他们一致，也可能是敌对关系。而且，你怎么定义这个？比如，在 WordPress 上，我们的产品没有 7.5 亿月活跃注册用户，但我们每月触达的访客有数十亿。那么，这算吗？所以这里就有模糊性。所以，我仍然认为他们做的事情很了不起，我喜欢他们发布它。我很困惑为什么他们坚持称它为开源，因为他们......\n\n(00:24:54):\n实际上，Meta 一直是巨大的开源贡献者。React。他们对 PHP 引擎做出了令人难以置信的改进，我们从中受益匪浅。所以，他们实际上是一个大的开源贡献者。我认为 Mark Zuckerberg 真的理解并热爱开源。我现在最好的猜测是——我没有任何内部信息——但我认为他们称它为开源是因为欧洲有一些关于开源与专有 AI 模型的监管规定。所以，我认为这可能是一个奇怪的监管问题，因为显然他们明白这不是开源。当我写那篇博客文章时，我只是有点困惑，想：\"哦，也许如果我把这个信息传出去，他们会改变。\"然后当他们没有改变时，我想：\"哦，一定还有别的原因。我认为可能是这个监管问题。\"实际上很多很多年前，我想是 React，他们在许可或专利限制上做了一些事情，WordPress 社区实际上让 Meta 改变并逆转了他们正在做的一些锁定措施。\n\n(00:25:53):\n所以，我认为我作为开源倡导者的角色实际上是我的首要任务。这是我的人生使命。我希望余生都从事 WordPress 工作，但也包括整个开源领域。我也支持 Drupal 和 Joomla。任何其他开源的东西，我都会支持，因为我认为当人们选择开源而不是专有软件时，我们就在增加世界的自由。我们有责任让开源提供更好的用户体验，做出更好的产品，让人们选择它,这样世界就会变得更自由，而不是更不自由。\n\nLenny Rachitsky (00:26:36):\n感觉对你来说很重要的是——我不知道该怎么说——防止\"开源洗白\"，比如避免人们在不真实的情况下使用这个术语。在这个案例中很有趣的是,使它不是真正开源的原因是限制。有一个限制,超过这个限制你就不能按你想要的方式使用它了。这就是问题所在吗？\n\nMatt Mullenweg (00:26:53):\n是的。实际上有一个开源 OSI。对于什么是开源许可证有一个正式的定义。实际上有几十种开源许可证,还有公共领域许可证和其他东西。\n\n所以，他们的立场也是认为这不是一个开源许可证。\n\nLenny Rachitsky (00:27:15):\n关于AI和开源，还有一件我觉得特别有意思的事，你写过这个话题，真的让我大开眼界，非常好的观点——这些AI模型训练用的代码都是开源代码，因为它们只能访问到这些。它们没有Windows的代码，没有Shopify的代码。这是多么酷的一个……我不知道该说是另一个成功案例还是……你怎么看待这件事，所有这些AI模型都是用你和开源社区写的代码训练出来的？\n\nMatt Mullenweg (00:27:43):\n这很美好。这是最安全的训练数据之一，对吧，因为开源许可证非常明确地允许这么做。我还喜欢思考这样一个问题：我的创造性产出对社会有用的时间窗口是有限的。如果你快进50年或100年，我确实相信专有软件的实用性最终会趋近于零。当我们把人类送往火星时，火箭和设备的操作系统等等不会建立在Windows NT内核上，尽管那个专有内核是了不起的工程成就。它会建立在开源内核上，Linux或BSD之类的。所以如果你想成为那种成为人类基础架构的一部分，那种能够让寒武纪大爆发式的东西在其上构建、让思想文艺复兴的东西，你就要参与开源。\n\n(00:28:38):\n所以我真的希望越来越多的人……我在这方面有点像传教士。我真的很想鼓励越来越多的人考虑至少拿出一部分时间，哪怕每周只有几个小时，为开源做贡献，因为你可以成为产生巨大影响的事物的一部分。而且这很有趣，特别是如果你是年轻的开发者、设计师或PM什么的，你不能走进Facebook然后改变你的主页或说\"我想改这个功能\"，但你可以参与一个开源项目，其中一些有数亿用户。你可以去WordPress，或者，天哪，Bitcoin。\n\n(00:29:20):\n或者还有各种开源项目，Chromium、Firefox，你可以真正改变一个功能或项目管理的东西，或者改变设计、改进它。我觉得这真的非常特别。对我来说那种激动，就是知道我写的代码现在每秒钟在全世界数百万台服务器上执行数百万次，那种激动，那种兴奋感，当我第一次做开源贡献时，那种感觉太棒了。从那以后我就一直在追逐和享受这种感觉。\n\nLenny Rachitsky (00:29:53):\n假如有人真的想这么做，他们该去哪里？怎么做？是不是就选个项目，去WordPress.org看看怎么贡献？接下来该怎么做？\n\nMatt Mullenweg (00:30:03):\n对，选一个你在用或喜欢的项目。这显然是个不错的选择。对于WordPress，我们有个……叫make.WordPress.org。那就是我们制作WordPress的地方。有不同的小组，有无障碍访问组、设计组、核心代码组、插件组，有各种各样的方式。所以，真的无论你的才能是什么，都有人在做翻译、做支持、写文档、组织活动，所以无论你觉得你在世界上的才能是什么，不管是你已经拥有的还是想要培养的。我基本上就是在构建WordPress的过程中学会编程的。我在这方面没有太多正式培训。所以，这也是提升技能的好方法，可以和世界上最优秀的开发者和其他人一起工作。\n\nLenny Rachitsky (00:30:53):\n这也让我想到AI agents正在出现，Devin和所有这些AI驱动的编程代理。你预测什么时候开源项目的大部分代码贡献会来自Devin和这类AI agents？\n\nMatt Mullenweg (00:31:10):\n我记得Google说过他们25%的代码或提交的字符现在是AI辅助的，他们可能处于最前沿。我不知道WordPress现在有多少代码是AI辅助的。但我认为在接下来的五年里，这个比例肯定会接近、也许达到大多数。我其实非常非常兴奋，我们作为一个非常开放的平台，面临的一个大挑战是我们有这个开放的插件和主题架构，所以有6万个插件和主题，WordPress的工作方式是这些插件和主题可以修改代码的每一个部分，所以你真的可以自定义一切。然而，这些插件和主题中的许多没有像核心那样健全的安全和审查流程。所以，当你听说WordPress的安全问题时，现在很少是在核心中了。\n\n(00:32:03):\n我们已经——敲木头——大概五六年没有远程漏洞了，但在插件中可能会更频繁一些。所以我在未来一两年非常非常兴奋的一件事实际上是更自动化的扫描，因为显然那个代码库有数千万行，也许超过1亿行代码了。人类不可能审查那么多，所以我们有点依赖开发者来审查和管理。当然，我们有漏洞赏金计划等等，所以当问题被报告时，我们会快速修复。但我等不及看到更多自动化扫描了，我认为这可以极大地提升开源的安全性。另一个真正令人兴奋的事情是，现在你看到人们构建应用程序什么的，都是定制生成的代码，但我认为这些模型的下一代或者说下一层，因为……\n\n(00:32:54):\n大家都知道，写代码只是其中一部分。真正成为其生命周期的是维护它。Stewart Brand的新书就是关于维护的，我对此非常兴奋。我想他是和Stripe合作出版的。而且实际上是开源的。他把书开源了，所以你可以在线看到它的写作过程。但回到正题，我认为如果……他们已经开始这么做了，就是当开源模型你说\"嘿，给我建个网站\"时，它实际上会安装WordPress，然后在上面构建，然后在上面自定义。这样你就免费获得了那个核心引擎，它一直在被审计和更新，获得passkey支持或任何新功能等等。然后你的定制内容可以在上面，我认为这实际上比从零开始构建专有或定制的东西要强大得多。\n\nLenny Rachitsky (00:33:43):\n我喜欢这个关于维护的书的概念。我姐姐的伴侣有句话我一直记得：\"生活就是维护。\"基本上……你获得和处理的一切……你给房子买个发电机，现在你得永远维护它。你买这个背包，好吧，现在你得维护这个东西，保持它完好，漂亮的夹克。一切都是维护。你生活中的一切都只是维护。我想知道这本书是不是讲这个的。\n\nMatt Mullenweg (00:34:09):\n嗯，这就是为什么我认为技术债务是最有意思的概念之一。也有很多公司市值很大，但我觉得他们可能有数十亿甚至数百亿美元的技术债务。你可以从界面或他们的产品如何相互集成等方面看出来。我在自己的公司里也经常思考这个问题。我们确实有些产品，来参加这个节目都有点不好意思，因为你这里有这么多优秀的产品人。我们现在有些东西的质量参差不齐。如果你现在看看Gravatar，我其实很自豪。我认为它的用户体验真的很棒，非常流畅。但WordPress的某些部分……嗯，我总是说\"我是世界上最不满意的WordPress用户\"，所以WordPress和WordPress.com的某些部分我有点尴尬和惭愧。\n\n(00:34:52):\n我们用相对较少的人覆盖了非常大的表面积，所以有些部分我们有一阵子没看了，我们需要去处理。这是我们今年的一个重点，实际上是回归基础，回归核心，改进用户体验的所有那些角角落落，同时也尽可能无情地编辑和删减，因为在过去21年里我们推出了很多东西，可能今天不那么相关了或者不需要在那里了。\n\nLenny Rachitsky (00:35:21):\n这听起来像是未来即将到来的AI agent的绝佳工作。还有一个领域我想深挖，那就是社区，社区建设，围绕WordPress建立的这个生态系统。这可能是互联网上最成功、最大的社区之一。我很好奇你学到了什么关于建立成功社区的经验，特别是在线社区。\n\nMatt Mullenweg (00:35:48):\n这可能受到经济学和爵士乐的影响。经济学都是关于系统思维的。你如何设置某个东西的激励结构？爵士乐则都是关于协作的。所以，如果要说我能给你的听众一些独特的东西，我会说：不要只是构建一个产品，要构建一场运动。在我们取得成功的程度上,我认为是因为我们给人们一些可以相信的东西——一种哲学、一种世界观。\n\n即使是一些看似无关紧要的小事，比如我们在 WordPress.org 刚开始时在页脚放了一句标语，现在还在，写着\"代码即诗歌\"。这个理念表达的是，我们不只是在写代码，我们试图创造一些可以包含艺术元素的东西。在过去大约60个版本中，我们给每个 WordPress 版本都以爵士乐音乐家的名字命名。所以，这些做法给项目带来了一些艺术感、灵魂和趣味。\n\n(00:36:44):\n不需要一直保持严肃。我认为这些可以给人们一些值得相信、值得为之努力、值得追求的东西，而不仅仅是一份薪水，或者仅仅是软件的实用性、基础功能。所以，这不只是关于软件本身，还包括：线下聚会办得怎么样？人们是如何聚在一起的？你们举办什么样的活动？有论坛吗？人们如何参与贡献？有答疑时间或者市政厅会议吗？我会做很多问答活动。所以，你在软件之外做了哪些事情来让人们参与进来，邀请大家贡献，让人们可以在此基础上进行构建？我研究过很多平台，比如 Microsoft 等等，所以我们整个插件和主题的生态系统是 WordPress 如此成功的部分原因，也是我们的护城河。\n\n(00:37:33):\n一个 CMS 的核心功能，几个开发者用几周时间就能写出来。这不是什么……基本上就是 CRUD 操作，但要复制那6万个插件和主题，天哪，没人做到过。这是一个巨大的护城河。专有服务也可以创建平台。Shopify 有第三方生态系统等等，但它永远不是真正的平台。真正的平台，是当你的生态系统赚的钱比核心还多。很多时候，无论是 Facebook 平台，我加个引号，还是 Shopify 平台，公司在上面构建，然后就被釜底抽薪，因为他们太成功了。\n\n(00:38:15):\n然后你所依赖构建的那个东西就会想，\"哦，我们想要那笔钱，或者我们想要那个增长。\"然后他们就改变 API 或者移除你的访问权限。这样的例子太多了，尤其是在 Facebook 和 Shopify 等平台上，人们做得太成功了，然后突然有人来敲门说，\"哦，你有个不错的应用啊。我很乐意给你一些认股权证，让我们拥有你公司的一部分股份，否则我们就关掉它\"，诸如此类的事情。\n\n(00:38:42):\n再说一次，除非你是基于开源构建，否则你没有自由。这就是为什么越来越多的公司和个人选择……如果他们要在某个东西之上构建业务，如果你基于开源构建，你就有那个保障。即使我长出了魔鬼角变坏了，Automattic 决定不管怎样，WordPress 仍然属于你，就像属于我一样。人们可以 fork 代码。他们仍然拥有它。他们仍然可以在此基础上构建。所以，我认为这些事情真的很重要。\n\nLenny Rachitsky (00:39:13):\n这真是个完美的过渡，正好引到这些天围绕你发生的戏剧性事件。我想很多人确实觉得魔鬼角已经出现了，所以我很期待深入探讨这些。我发现每次你最近上播客，如果我们不谈这个，每个人都会说，\"为什么 Matt 不回答这些问题？\"让我们谈谈这些棘手的问题。所以，我要问你一些难回答的问题。对于那些不知道到底发生了什么事的人，他们可能在想，\"你们到底在说什么？\"或者只是感觉到 WordPress 和 Matt 有些事情在发酵，但不知道具体是什么，能概括一下到底发生了什么吗？\n\nMatt Mullenweg (00:39:48):\n那么，首先说明一下，你可以从 WordPress.com 或者我们这里获得 WordPress，但你也可以从其他几十个主机服务商那里获得 WordPress。全球最大的有 GoDaddy、Hostinger、Newfold。虽然不是最大的，但也在前10名左右。有大约70万个 WordPress 安装。有一家叫 WP Engine 的公司。2019年，WP Engine 最初是非常面向 WordPress 的，他们为社区做了很多贡献，诸如此类。他们在区分自己和核心项目方面非常谨慎，所以人们真正意识到它不是官方关联的，等等。但在2019年，他们被一家叫 Silver Lake 的私募股权公司收购了。任何关注商业的人都知道，当私募股权收购某个东西时，有些是好的，但也有很多很多关于他们如何真正掏空企业、优化利润、变得对用户不友好的故事。\n\n(00:40:45):\n实际上最近读到一个故事，洛杉矶火灾期间消防车短缺的原因之一是消防车制造商被一家私募股权公司整合了，他们一直在提价，供应受限，诸如此类。所以，现在字面上就是因为私募股权导致消防车短缺。当然，如果你看医疗保健或其他领域，有太多例子表明私募股权可能真的是资本主义最黑暗的部分之一。所以，自2019年以来，WP Engine 有点变了，他们真的停止了对核心的贡献，他们开始以一种非常容易让人混淆的方式使用商标。特别是在过去一年、一年半左右，我们只是收到很多……我收到很多关于 WP Engine 的支持请求。\n\n(00:41:36):\n当我们做调查时，我们发现20%、30%、40%的人认为他们是官方关联的，因为他们使用我们的 logo 和展示品牌的方式等等，对人们来说非常容易混淆。你知道，如果你不保护商标，你就会失去它。而且他们提供的 WordPress 版本实际上不符合我们对 WordPress 功能的核心愿景。所以为了省钱，他们实际上关闭了像修订历史这样的功能。所以，WordPress 有一个很酷的部分，实际上是我最喜欢的功能之一，就是对每篇文章或页面的每次更改都会永久保存，就像 Wikipedia 一样。所以，如果你犯了错误，你总是可以撤销。当然，在构建优秀产品时，这种撤销的用户安全性是如此关键。\n\n(00:42:19):\n现在，显然你必须存储这些修订版本，所以会占用更多数据库空间。但这是微不足道的，只有几兆字节，所以在现代数据库上不是什么大问题。但为了省钱，他们实际上关闭了这个功能，所以他们破坏了 WordPress 的撤销功能，本质上是为了省钱。所以你看到这样一个情况，他们提供的东西叫 WordPress。我认为我把它称为一个被篡改、被破解的版本。它在稀释我们的品牌，然后人们还认为它是官方的。所以，即使是我的好朋友也会说，\"哦对，我注册了这个东西。我以为我在支持你。\"\n\n(00:42:49):\n事情到了紧要关头。所以，过去18个月他们还……我们联系他们说，\"嘿，如果你要这样使用，你需要一个商标许可或者改变你的做法\"，并试图协商一些东西，在几个月内提出了许多不同的条款清单和不同的方案，但他们一直在拖延。我当时想，\"这是怎么回事？\"我认为部分原因是去年他们试图出售公司。所以，私募股权通常持有5到7年，所以他们大概持有了5年。他们试图到处兜售出售它。他们没能找到买家。\n\n(00:43:25):\n买家说，\"嗯，他们没有任何知识产权，而且感觉他们在使用你的商标，所以他们会和你有麻烦。他们没有许可证，诸如此类。\"所以，当他们在和我们谈判时，看起来他们也在准备对我们的诉讼。所以再说一次，在我的商业生涯中我一直很幸运，我们投资了几十家公司，收购了很多东西，总的来说，99%的时候我在商业中打交道的人都是有道德的、直率的、诚实的。我真的没有遇到过任何赤裸裸的谎言或口是心非的行为。很少很少有人说一套做一套，或者在行为上是欺诈性的，但我认为这里就是这样。\n\n(00:44:17):\n所以我也没有准备好。我想我有点天真，有一段时间没有意识到正在发生什么。所以，事情到了紧要关头，在9月的 WordCamp US 上，我想，\"好吧，如果你们还是不同意谈判，我要做这个演讲，讲讲我认为私募股权过去是如何搞砸很多开源项目的，以及特别是[音频不清]做了一些非常糟糕或邪恶的事情。\"他们说，\"好吧，去吧。\"所以，我做了演讲。我想是在周四或周五。有点辛辣。人们说，\"哦，真不敢相信他这么做了。\"\n\n(00:45:00):\n然后周一，他们和 Quinn Emanuel 一起发起了诉讼，这是一家最强硬、最狠的律师事务所，就是 Elon 起诉别人时用的那家，对我个人和 WordPress.org，也就是 WordPress 社区，以及 Automattic 发起了这场价值数百万美元的大型诉讼。而且他们每月在律师和公关上花费数百万美元。所以，他们在做……如果你读到……哦天哪，最近谈论这个的那个名人是谁，像那种黑公关的东西，他们在社交网络上推广内容？\n\nLenny Rachitsky (00:45:35):\n哦，Blake Lively 和-\n\nMatt Mullenweg (00:45:37):\nBlake Lively，对对。\n\nLenny Rachitsky (00:45:37):\n……另一个人。\n\nMatt Mullenweg (00:45:38):\n所以，所有这些事情都在发生，所以有……我警告过人们。\n\n我觉得在演讲中我说过，\"嘿，会有人对我发起抹黑运动。\"在公司内部，我也说，\"嘿，他们会挖出所有发生过的事情。任何人曾经说过我的坏话都会突然变成新闻。\"这确实发生了，是真的。所以，现在互联网上有一部分人确实认为我长着魔鬼犄角什么的。幸运的是，这不是我第一次经历这种事了。我知道很多人觉得，\"哦，Matt 做了20年好人，然后突然变坏了。\"但有一点，如果你真的开放并且做开源，有时候你必须站出来对抗恶霸，你必须为保护你的开源理想而战。\n\n(00:46:19):\n否则人们可能会以一种最终能摧毁你所创造的一切的方式来利用它。所以，这大概是互联网第四次认定我是主角或者真正的恶人了。之前那几次我们现在都不记得了。什么 Hot Nacho 啊，或者主题的复活节大屠杀啊，这些东西甚至都不在我的维基百科页面上了，但在当时看起来确实是很大的事。\n\nLenny Rachitsky (00:46:43):\n那些是你的事件。那些不是什么历史战役吧。\n\nMatt Mullenweg (00:46:46):\n不不不，这些都是，是的，我参与其中的事情。\n\nLenny Rachitsky (00:46:48):\n至少名字挺酷的。\n\nMatt Mullenweg (00:46:49):\n包括一些我搞砸的事情，比如 Hot Nacho 确实是我在 WordPress 早期的一个失误，但是...\n\nLenny Rachitsky (00:46:55):\n哇。好吧，我不打算深究这些，但这些名字真不错。\n\n(00:46:59):\n本期节目由 Loom 赞助。Loom 让你可以录制屏幕、摄像头和声音，轻松分享视频消息。录制一个 Loom，只需一个链接就能发送出去，收集反馈、添加上下文或分享更新。所以，现在你可以删掉正在写的那封长篇大论的邮件了。相反，你可以录制屏幕，更快地分享你的信息。Loom 可以帮你减少会议，并让你确实需要开的会议效率更高。会议从所有人达成共识开始，提前结束。问题解决了，时间节省了。我们知道不是每个人都能一次录好视频，所以 Loom 配备了简单的编辑和 AI 功能，帮你录制一次就能回到真正重要的工作中。用 Loom 节省时间、协调团队、保持联系并完成更多工作。现在是 Atlassian 的一部分，Jira 的制造商。今天就在 Loom.com/Lenny 免费试用 Loom。就是 L-O-O-M.com/Lenny。\n\n(00:47:59):\n所以，你提到了你在 WordCamp 的那次演讲，你在演讲开始时说...\n\nLenny Rachitsky (00:48:00):\n... 在 WordCamp，你在演讲开始时说... 哦不，之后你说，\"我当时真的很紧张要做这个演讲，\"显然你能看出为什么。到底是什么最终让你觉得是时候了？是为了如你所说的焦土核弹式反击吗？还是因为 WordCamp 要来了，这是公开这件事的时机？还是有什么别的事情触碰了底线？\n\nMatt Mullenweg (00:48:24):\n这是一个独特的机会，因为我们实质上是在说，嘿，WP Engine 将不再被允许赞助 WordCamp 了。他们不会再是... 因为在那之前，我们确实做了一切努力把他们拉进来，让他们成为社区的一部分。所以我真的必须向我们的社区解释，嘿，为什么我们要排除这家很多人认为在做好事的公司。如果你去 WP Engine 的网站，他们有整页内容介绍他们贡献和回馈了多少，他们如何... 他们确实做了很多绿色清洗或开源清洗的事情。所以他们所有的营销品牌都围绕着这些正面的东西，所以我想，\"嘿，我们需要把这个情况解释清楚。\"\n\n(00:49:03):\n但是，是的，再说一次，我的默认方式以及我们与 WordPress 生态中其他所有公司的合作方式——顺便说一句，其中许多公司规模要大得多，有时收入比 WP Engine 多几十亿——都是合作的。所以如果有商标侵权，通常甚至都不需要律师介入。就是发个邮件，我们聊一聊，打个电话，我们谈谈。事情就这样解决了，这是我的默认方式。我是个爱好和平的人，不是好斗的人，这就是为什么这种事不常发生。我想说的是，是的，如果 WordPress 社区或什么的每年或每几个月就这样一次，是的，你应该担心，但这种事基本上每10年左右才发生一次。\n\nLenny Rachitsky (00:49:46):\n如果让我总结一下你遇到的问题，我想再深入了解一下，你在 WP Engine 这个案例中遇到的问题。第一是他们在没有授权的情况下使用 WordPress 和 WooCommerce 的商标，而且在滥用，让人困惑。很多人以为 WP Engine 实际上就是 Automattic 和 WordPress 官方。他们没有为项目做贡献。他们基本上就是从他们收购的这家公司赚了一大笔钱，却没有做相应的工作，如你所说，他们在掏空它。然后他们还在偷工减料，让产品变得更差，这反过来影响了整个 WordPress 品牌。\n\nMatt Mullenweg (00:50:22):\n总结得很好，是的。\n\nLenny Rachitsky (00:50:24):\n太好了。我很好奇，在这三个问题中，或者还有其他什么，哪个最困扰你？什么东西\"一直在折磨你\"?如果让我猜的话，应该是可能损害你大半生工作成果的遗产。也许是这个，也许只是利用社区。你认为这件事的根源是什么，就是\"这必须停止\"?\n\nMatt Mullenweg (00:50:50):\n嗯，我想我要补充到你列表里的一件事是，在这一切发生的时候，他们假装在善意谈判。事实上，有一次那位高管，我们在谈论她加入 Automattic 并在俄勒冈州运营 WordPress，当她觉得... 那位副总裁她要出售时，她在考虑下一步做什么。所以是的，很多这些事情都是，我认为这种两面三刀的行为也迫使我们走到边缘，甚至比你提到的那些其他事情更严重。有很多公司不回馈贡献，这也不是什么大问题。但是，是的，法律问题肯定是商标的事。那么是什么把它推到了边缘？我认为只是问题的严重程度。他们在客户会议和其他场合会称自己为 WordPress Engine。他们对暗示自己与项目的关联非常随意。\n\nLenny Rachitsky (00:51:46):\n显然，正如你在社交媒体上看到的，很多人真的很不满，很多人责怪你。就像我说的，每次你上播客或上 Twitter，人们就会说，\"Matt，这个怎么说？为什么这个糟糕？你为什么要这样做？\"我想讨论其中一些事情，但只是没有多少人经历过... 我觉得你曾经是百分之百受人爱戴的开源和互联网英雄，现在你处于这种... 很多人不喜欢你的境地。作为一个人，这是什么感觉？你怎么处理这个？你怎么应对？这是什么样的体验？\n\nMatt Mullenweg (00:52:17):\n如果你对 WordPress 内部了解的话，实际上很多年来一直有人对我不满，当我们推出像 Gutenberg 这样的东西时，人们讨厌它。实际上当我们推出可视化编辑器时，人们也讨厌它。\n\nLenny Rachitsky (00:52:29):\n你有练习的机会。\n\nMatt Mullenweg (00:52:30):\n这些都是 WordPress 历史上的巨大争议。实际上围绕这些最新的事情还没有 WordPress 的分叉，但当我们推出 Gutenberg 时有过。有一个叫 ClassicPress 的，人们真的分叉了软件。所以我会这样描述，以前大约1%的人认为我很糟糕，现在我觉得上升到了4%或5%左右。所以还不是大多数，但你知道，负面的东西你的感受是正面的七倍。当人们对你生气时，就像餐厅评论什么的，他们更有可能留下差评而不是好评。\n\n(00:53:14):\n使用 WordPress 的人，98%的核心开发者都留下来了，继续贡献，正在开发下一个版本，并且支持这一切诸如此类的事情。这些人之所以这么优秀，部分原因是他们不会把所有时间都花在 Twitter 和 Reddit 上与人争论，而且这些争论可能... 它们非常令人沮丧，因为人们不会善意地参与。当引入新事实时，他们不会真正改变想法。\n\n(00:53:43):\n所以我已经尽力了，实际上因为从开源方面我真的习惯于参与这些事情，我认为这是我从中学到的一件事，在某些论坛上，你怎么参与都无所谓，特别是如果那里有机器人或其他东西在运行。我在 Reddit 上留言，立即就会得到大约40个踩。我想，\"嘿，这是一篇关于我的文章，我在添加一个事实。为什么会被踩？这与讨论非常相关。\"但它实际上被隐藏了。所以当你看到那个帖子时，你必须点击三四次才能看到我留下的评论，所以这真的可以改变认知。然后当你读这些东西时，我认为这就是非常人性化的本质。\n\n即使是非常亲近我的人，如果你读到一个帖子，里面全是超级负面的内容，也很难不受其影响，因为我们是社会性动物。\n\nLenny Rachitsky (00:54:36):\n完全同意。\n\nMatt Mullenweg (00:54:37):\n不过好消息是，我得到了很多有分量的支持，来自像 Marc Benioff 这样的人，或者其他开源领袖，或者 WordPress 的核心成员，比如 Matias、Mary Hubbard，所有核心提交者。实际上国际社区，就比如在日本，他们根本不在乎这些事。所以实际上，如果你看提交次数、代码行数这些指标，这些人才是 WordPress 中最关键的。所以我觉得这对我来说也是一个很好的平衡，因为有些日子我会想，\"天哪，我是不是个白痴？\"或者读到所有这些东西会真的很沮丧。所以这也是让我能够平衡并回到那种积极、乐观状态的部分原因，我认为你需要处于这种状态才能做出伟大的软件和伟大的工作。\n\nLenny Rachitsky (00:55:27):\n是的。互联网可能很残酷。让我来说几个人们指出的具体问题，因为我觉得你上过很多播客，但人们没有问你这些问题，我想很多人只是在想，\"但是，Matt，这个怎么说？这真的很糟糕。\" 所以让我问你几件事。一个是社区对这件事给 WordPress 社区带来的不稳定性感到沮丧。我给你读几段引用。\"真实的人因为这场纷争在 WordPress 上接到的项目变少了，因为高管们认为 WordPress 不稳定，我在企业工作，我们非常担心这个平台和我们项目的稳定性。\" 对此以及它对社区的影响有什么想法？\n\nMatt Mullenweg (00:56:05):\n是的，我认为在这个问题解决之前……顺便说一句，我希望能很快解决。我认为从商业角度来说没有理由继续下去。我真的希望他们能达成和解或什么的。我们已经准备好了。如果他们想的话，明天就能结束这件事。WP Engine 可以。我们不能。我们现在只是在防守。所以这真的取决于他们。顺便说一句，我们所有的竞争对手都在说，\"太好了。WordPress，山上的王者，突然我们可以利用这一点。\" 所以不仅仅是来自 WP Engine，还有来自 WordPress 的所有竞争对手，以及所有想要抢占一些市场份额的人，他们真的在充分利用这一点。所以我看到了白皮书，我看到了各种人们谈论这个的东西。\n\n(00:56:49):\n不过我们实际上在接下来的几天里会在 WordPress.org 博客上发布一些非常酷的东西，展示如果你真的看数据，比如活跃度、提交次数、插件更新、下载量、WordPress 的安装量，从 9 月 20 日这一切开始以来，都相当健康。所以我不是说没有某人失去项目之类的例子。我相信这种事发生过。互联网很大。WordPress 有数百万用户、开发者等等，你肯定会遇到一些例子。但从数据来看，情况实际上相当健康，在某些方面，并不是说没有坏的新闻，这大大提高了 WordPress 的知名度。所以多年没有谈论 WordPress 的人现在在说，\"哦，让我们来谈谈它。\" 所以我认为一点戏剧性，我不会一直这样做，但一点点可能是件好事。\n\nLenny Rachitsky (00:57:39):\n好的，所以我在网上看到的最常见的抱怨之一是关于商标的。我不知道所有细节，但我的理解是有点……你把商标转移到了基金会所有，Automattic 拥有使用商标的独家权利。我想人们在想，\"哦，我以为是基金会拥有它，但也许 Matt 仍然拥有它，然后你试图通过与 WP Engine 的协议来从中获利。\" 你能分享一些东西让人们感受并看到你这边的故事吗？\n\nMatt Mullenweg (00:58:10):\n是的，这完全可以理解，因为这很复杂，但人们说这一直是私下的。这从一开始就一直是非常公开的，在互联网上有记录。所以 WordPress.org 一直是我个人的，我想部分原因是我们从那里开始是因为……当我们开始时 .com 不可用。所以这就是为什么我们从 .org 开始之类的。但我认为人们也认为 .org 意味着非营利组织或什么的，这有时是真的，但并不总是。这不是 .org 域名的要求。然后当我创立 Automattic 并注册商标时，实际上是在 Automattic 名下注册的。所以过去，在项目的前五年左右，Automattic 完全拥有一切。再说一次，我有投资者和董事会，那是在他们的控制之下。\n\n(00:59:06):\n现在，随着 Automattic 变得更加成功，我能够巩固一些投票权和其他东西，至少后来可以倡导。还要记住，所有这些发生的时候我才 21 岁，所以我可能对法律方面的东西不是最精明的，或者并不总是得到最好的建议。所以后来随着我了解得更多，我想，\"哦，我实际上想把这个从公司中拿出来，创建一个非营利组织。\" 所以我们最终创建了一个非营利组织。现在美国国税局关于 501(c)(3) 非营利组织的规定实际上非常严格。所以这也是人们假设的事情，就像，哦，非营利组织不是运行软件吗，我们最初申请了，但被国税局拒绝了。\n\n(00:59:47):\n所以我们实际上无法将 WordPress.org 或软件本身放在非营利组织下，但我们能够有一种教育范围。所以最终批准的是为 WordPress 运行聚会和其他事情，做教育方面的事情。我们赞助了很多学习编程或在其他国家举办研讨会的活动。我们有一个很酷的东西叫 do_action，我们会在周末举办活动，带一群非营利组织为他们建立网站之类的。所以非营利组织在那里做了很多令人兴奋的事情，然后还与 Automattic 的投资者和所有人谈判，实际上将商标放在基金会下。\n\n(01:00:31):\n现在那里的妥协是 Automattic 此时正在运行 WordPress.com。所以为了继续运行它，当时已经有数千万用户等等，它需要一个商业许可证。所以妥协是基金会将拥有商标并将其授权用于非商业目的。我有运行 WordPress.org 的许可证，因为显然我需要。然后 Automattic 将保留商业许可证和再许可的能力，所以可以将其出售给其他人。所以这是一种重大妥协，创建了这种三方结构。我很受三权分立的启发。所以每一方都有一定的权力，我认为这在某种程度上制衡了各方，这是有意为之的。\n\nLenny Rachitsky (01:01:23):\n哇。好吧，我明白为什么它很复杂了。我明白为什么人们会感到困惑。这让我想起 OpenAI 有一个非常奇怪的结构，这给他们带来了很多麻烦，感觉就像当你 21 岁时，你会想，\"哦，这很有道理。我们在这里想出了一个多么好的概念，\" 然后所有这些复杂性只会增加很多关于正在发生的事情的困惑。所以谢谢你解决这个问题。另一个，我看到过几次的相关问题是，为什么你不让 .org 由社区运营。为什么不把它交给其他人，而不仅仅是你在那里？\n\nMatt Mullenweg (01:01:53):\n是的，这个问题的框架很有趣，因为它暗示我是唯一制作 WordPress 的人，这显然不是真的。如果你看每天的提交和活动等等，它是由社区运营的。所以每天实际上有数百名志愿者在做日常工作，做日常决策，一切都在发生。所以有一个激进的授权。然而，最终有一个层级结构，我是 CEO，所以我是最终的决策者。\n\n(01:02:24):\n所以我认为人们在这个治理观点上主张的是，好吧，在你上面设立一个董事会，最终为产品做决定或类似的事情。还有其他开源项目有这种结构。它们中没有一个像 WordPress 一样成功。所以我认为你的听众特别是，伟大的软件是由委员会创建的吗，还是更多地反映了领导者的愿景或能让我们……我认为特别是 WordPress 不仅保持相关性，而且实际上在过去二十年的巨大技术转变中加速增长。\n\n(01:03:12):\n当我们开始的时候，有动态网络应用或 DHTML，JavaScript 还不是真正的东西，然后是社交网络，然后是 iPhone，然后是随着时间推移而改变的所有这些东西，我们已经驾驭了很多这些技术变革，这是非常非常困难的。大多数产品在像这样的多代变革中不会保持相关性，这是因为有时我们不得不做出非常不受欢迎的决定。Gutenberg 是 WordPress 今天保持相关性的一个重要原因，它实际上是我们做的一个开源项目。它是块编辑器。它实际上比 WordPress 更大，因为它不仅用于 WordPress，它用于每个 WordPress 网站，还有像 Tumblr 这样的其他人。如果 Squarespace 或 Wix 采用 Gutenberg，我实际上会很高兴。\n\n现在，人们都说，\"哦，你花了300万美元买下它。\" 但我们买下它的时候是承担了所有负债的，包括，我记得他们当时正在接受联邦贸易委员会（FTC）的调查，还有一些诉讼。有各种各样的麻烦事。所以这就像免费领养一只小狗，而不是——\n\nLenny Rachitsky (01:22:01):\n免费啤酒那种免费。\n\nMatt Mullenweg (01:22:05):\n当时有一个相当大的团队，我记得有185人。我们接手了很多烧钱的项目，疯狂烧钱，那是在2019年。所以，我觉得运营一个社交网络是一次很让人谦卑的经历。它和我们做过的所有其他产品都非常非常不同。我认为 Tumblr 有一些很了不起的地方，我现在仍然对此非常兴奋。WordPress 主要是桌面端和网页端的用户群，而 Tumblr 显然大约85%是基于 app 的，用户群更年轻。所以我们现在正在执行的愿景，其实是想为使用 Tumblr 的人创建一条路径，让它的后端实际上由 WordPress 驱动。这样 Tumblr 用户就可以解锁主题、自定义功能、插件等等。实际上，我们现在正在将5亿个 Tumblr 站点迁移到 WordPress，这可能是——\n\nLenny Rachitsky (01:22:58):\n这很有道理。\n\nMatt Mullenweg (01:23:00):\n——近年来最大规模的数据迁移之一。所以我们试图以一种对前端用户不可见的方式来做这件事，在后端进行更改的同时保持 API 和界面等所有东西不变。所以这是一个很有趣的工程项目。我发了一个号召帖，收到了很多优秀人才申请加入 Automattic，我们围绕这个大胆的项目，这个雄心勃勃的目标，招聘了很多优秀的人才。所以这就是它现在的状态。在我们进行业务转型的这几年里，我亲自运营了它一段时间，现在那边有一个很棒的团队，但仍然面临挑战，仍然没有盈利，所以我们仍在用 Automattic 的其他业务来补贴它。幸运的是，我们其他业务做得很好，所以我们能够做到这一点，但我确实希望达到可持续发展的状态。\n\n(01:23:46):\n我们还在实验的一件事是，Tumblr 能否不仅仅依靠广告驱动的模式？我认为最终广告社交网络的激励机制可能会导致你在 Twitter、Instagram、Facebook 等平台上看到的那些负面动态。所以我们真的在尝试创建一个订阅模式，或者一种第一方用户驱动的广告，比如你推广自己的博客文章之类的，或者推广一个 WooCommerce 产品什么的，而不是第三方广告生态系统，我觉得那里面有很多奇怪的代码、恶意软件和很多我不喜欢的东西。\n\nLenny Rachitsky (01:24:21):\n哇，听起来这次收购你承担了很多，我很喜欢你说你最初亲自运营它。所以这是一个很好的过渡，也许是我最后一个问题。我很好奇这会往哪个方向发展。让我先放大一下视角。现在有很多人对控股公司模式很兴奋。我要买一堆公司，让它们变得更好，变得很棒，节省成本，然后不断构建这个控股公司之类的东西。你们正在这样做，而且做得很好。你们寻找什么？你如何决定一家公司适合 Automattic？什么因素会让你觉得，我们应该买下这家公司，我们可以扭转局面，把它变成一个巨大的成功？\n\nMatt Mullenweg (01:24:58):\n我不知道我是否会再做一次像 Tumblr 这样的业务转型，或者至少在很多很多年内不会。这确实是不同的事情。我们收购的绝大多数东西，只是因为它们做得很好，我们想加速它，或者有时是收购团队（acqui-hire），我们把它整合到我们现有的项目中，或者我们让团队去做我们已经在做的事情。所以这是一个非常有才华的团队。Tumblr，我认为我们最终还是替换了85%到90%的团队。所以这真的很不一样。我确实认为有不同的做法，但如果你看我们的其他收购，比如 Day One 等等，创始人还在这里，很多年后，我们在加速这些项目。我们把它带到了 Android，我们正在把它带到网页端。更多的是把好东西变得更好。我们最好的例子可能是 WooCommerce，那是一家小公司，我记得有35到40人，总部在南非，现在显然已经成长到——我刚才说 Automattic 现在每年大约赚5亿美元，而 WooCommerce 占了大部分。\n\nLenny Rachitsky (01:26:06):\n说到这个，实际上，你还没有分享收入数字。我知道这是公开的。只是让人们了解一下 Automattic 的收入。你能分享一下这些数字吗？因为我觉得这可能会让人们大吃一惊。\n\nMatt Mullenweg (01:26:15):\n是的，我想我们公开说过，现在的 ARR 收入大约是5亿美元。\n\nLenny Rachitsky (01:26:20):\n太不可思议了。好的。我有一个问题要问你。这有点像热座问题。在你说话的时候，我想，我感觉人们在想这个。所以你一直在说 PE 公司往往不好。你收购了 Tumblr。你说过裁掉了一大批人，扭转了局面。这和 PE 公司有什么不同，Matt？\n\nMatt Mullenweg (01:26:39):\n是的，我同意你的观点，仅仅因为它是私募股权并不意味着它就是坏的。而且，人们还会说，\"嘿，等等，Automattic 不也有私募股权投资者吗？\" 我们确实有。但是，他们通常拥有很小的百分比，有时不到1%，而且他们没有公司的控制权。所以我认为有一个区别。是少数股权投资还是控股投资？在 WP Engine 的案例中，Silver Lake 控制着公司。当他们控制公司时，我认为有一系列行为。显然，提高效率是很好的，我们都应该为此努力。我认为每家企业都会这样做，无论是私募股权还是我们的业务，还是由创始人控制的企业。你总是想要更高效。现在，这里面有一些程度的问题，你可能会过度优化，或者你可能有黑暗模式。现在在 WP Engine 上，取消账户非常困难。实际上，我想截至今天，已有45,000个站点离开了，所以我认为他们降到了60万。是的，因为他们的客户意识到了，\"嘿，这不是 WordPress，这不是……\" 或者，\"他们正在起诉创建 WordPress 的那个人，所以也许我们不应该在商业上支持这个。\" 所以我们有一个网站 wordpressenginetracker.com，实时显示离开的站点。看到这个数字不断上升是一件令人兴奋的事情。实际上，这也许是一个很好的例子，即使有很多负面因素，你实际上看看人们是如何用钱包投票的。他们正在离开。\n\n(01:28:07):\n所以我认为你也必须判断，只需看看业绩记录。我对 Automattic 非常自豪的一点是，我们是首选收购方，我们有创始人卖给我们。Day One 的 Paul Mayne 就是一个很好的例子，他本来不需要出售。他们盈利能力很强，他自己可以经营很长很长时间，但人们选择加入是因为他们觉得我们将来会成为它的好管家，最终只需要看看业绩记录。\n\n(01:28:36):\n所以我认为不要根据它叫什么来判断，要根据长期的行为来判断。我希望继续为成为社区、软件和其他一切的好管家建立这种声誉，并持续很多年。\n\nLenny Rachitsky (01:28:52):\nMatt，我们聊了这么多。我问了你所有的难题，甚至更多。在结束之前，你还有什么想留给听众的吗？任何最后的想法、评论、见解、故事？\n\nMatt Mullenweg (01:29:04):\n是的，关注我。我在 Tumblr、Twitter、Instagram 等所有平台上的用户名都是 photomatt，P-H-O-T-O-M-A-T-T。我发布很多其他内容。我发布很多关于 AI 和开源以及其他东西的内容。里面也有一些 WordPress 的东西。我有这些人生使命，就是让出版和商业民主化。去年我们增加了一个新的使命，就是消息传递，所以现在处于测试阶段，但几个月后将作为一个名为 Beeper 的产品重新推出，它可以把你所有的 Telegram、Instagram DM、Signal 等等，全部整合到一个 app 里。你可以做一些非常酷的事情，尤其是当你开始想象搜索或 AI，本地 AI 围绕这个的时候。所以我对那次重新推出非常非常兴奋。所以我鼓励大家，你现在就去看看测试版，去 beeper.com/beta 获取新版本，我们将在今年晚些时候重新推出。\n\n(01:29:50):\n所以是的，我对此非常兴奋。在 WordPress 2003年、2004年所处的阶段做一些事情是很有趣的。所以 WordPress 现在已经相当成熟了。WooCommerce 差不多是 WordPress 在2010年的阶段。然后 Beeper 的东西，消息传递的东西是我们在2003年的阶段。所以让我保持兴奋的一件事就是在不同阶段工作。\n\nLenny Rachitsky (01:30:12):\n这感觉就像是你做伯克希尔·哈撒韦方式的一个原因，就是保持在早期阶段的活跃，而不仅仅是优化已经建立的东西。所以是 beeper.com，顺便说一句，很棒的域名。Photomatt，photomatt 的故事是什么？我想你喜欢摄影，是这个故事吗？\n\nMatt Mullenweg (01:30:32):\n是的，这有点双关的意思。所以 fotomatt，F-O-T-O-M-A-T-T，也是一个你以前用胶片拍照然后去冲洗照片的地方。所以最初我的用户名是 Saxmatt，因为我吹萨克斯风。有时人们会听错。而且，我开始大量旅行。",
  "chunks_count": 11
}