{
  "guest": "Mike Krieger",
  "en": "Lenny Rachitsky (00:00:00):\n90% of your code roughly is written by AI now.\n\nMike Krieger (00:00:03):\nThe team that works in the most futuristic way is the Claude Code team. They're using Claude Code to build Claude Code in a very self-improving kind of way. We really rapidly became bottlenecked on other things like our merge queue. We had to completely re-architect it because so much more code was being written and so many more pull requests were being submitted. Over half of our pull requests are Claude Code generated. Probably at this point it's probably over 70% that it just completely blew out the expectations of it.\n\nLenny Rachitsky (00:00:26):\nYou guys are at the edge of where things are heading.\n\nMike Krieger (00:00:28):\nI had the very bizarre experience of I had two tabs open. It was AI 2027, and my product strategy, and it was this moment where I'm like, \"Wait, am I the character in the story?\"\n\nLenny Rachitsky (00:00:36):\nIt feels like ChatGPT is just winning in consumer mind share. How does that inform the way you think about product, strategy, and mission?\n\nMike Krieger (00:00:43):\nI think there's room for several generationally important companies to be built in AI right now. How do we figure out what we want to be when we grow up versus what we currently aren't or wish that we were or see other players in the space being?\n\nLenny Rachitsky (00:00:55):\nWhat's something that you've changed your mind about what AI is capable of and where AI is heading?\n\nMike Krieger (00:01:01):\nI had this notion coming in like, \"Yes, these models are great, but are they able to have an independent opinion?\" And it's actually really flipped for me only in the last month.\n\nLenny Rachitsky (00:01:12):\nToday, my guest is Mike Krieger. Mike is chief product officer at Anthropic, the company behind Claude. He's also the co-founder of Instagram. He's one of my most favorite product builders and thinkers. He's also now leading product at one of the most important companies in the world, and I'm so thrilled to have had a chance to chat with him on the podcast. We chat about what he's changed his mind about most in terms of AI capabilities in the years since he joined Anthropic, how product development changes and where bottlenecks emerge when 90% of your code is written by AI, which is now true at Anthropic. Also, his thoughts on OpenAI versus Anthropic, the future of MCP, why he shut down Artifact, his last startup and how he feels about it. Also, what skills he's encouraging his kids to develop with the rise of AI. And we closed the podcast on a very heartwarming message that Claude wanted me to share it with Mike.\n\n(00:02:00):\nA big thank you to my newsletter Slack community for suggesting topics for this conversation. If you enjoy this podcast, don't forget to subscribe it and follow it in your favorite podcasting app or YouTube. Also, if you become an annual subscriber of my newsletter, you get a year free of a bunch of incredible products, including Linear, Superhuman, Notion, Perplexity and Granola. Check it out at lennysnewsletter.com and click bundle.\n\n(00:02:22):\nWith that, I bring you Mike Krieger. This episode is brought to you by Productboard, the leading product management platform for the enterprise. For over 10 years, Productboard has helped customer-centric organizations like Zoom, Salesforce, and Autodesk build the right products faster. And as an end-end platform, Productboard seamlessly supports all stages of the product development lifecycle. From gathering customer insights to planning a roadmap, to aligning stakeholders, to earning customer buy-in, all with a single source of truth.\n\n(00:02:52):\nAnd now product leaders can get even more visibility into customer needs. With Productboard Pulse, a new voice of customer solution built-in intelligence helps you analyze trends across all of your feedback and then dive deeper by asking AI your follow-up questions. See how Productboard can help your team deliver higher impact products that solve real customer needs and advance your business goals. For a special offer and free 15-day trial, visit productboard.com/lenny. That's productboard.com/L-E-N-N-Y.\n\n(00:03:26):\nLast year, 1.3% of the global GDP flowed through Stripe. That's over $1.4 trillion and driving that huge number are the millions of businesses growing more rapidly with Stripe. For industry leaders like Forbes, Atlassian, OpenAI, and Toyota, Stripe isn't just financial software. It's a powerful partner that simplifies how they move money, making it as seamless and borderless as the internet itself. For example, Hertz boosted its online payment authorization rates by 4% after migrating to Stripe. And imagine seeing a 23% lift in revenue like Forbes did just six months after switching to Stripe for subscription management. Stripe has been leveraging AI for the last decade to make its product better at growing revenue for all businesses. From smarter checkouts to fraud prevention and beyond. Join the ranks of over half of the Fortune 100 companies that trust Stripe to drive change, learn more at Stripe.com.\n\n(00:04:29):\nMike, thank you so much for being here and welcome to the podcast.\n\nMike Krieger (00:04:32):\nI'm really happy to be here. I've been looking forward to this for a while.\n\nLenny Rachitsky (00:04:35):\nWow, I had love to hear that. I've also been looking forward to this for a while. I have so much to talk about. So first of all, you've been at Anthropic for just over a year at this point. Congrats by the way on hitting the cliff.\n\nMike Krieger (00:04:46):\nThank you. Not that we're tracking.\n\nLenny Rachitsky (00:04:49):\nThat's right. So let me just ask you this. So you've been at Anthropic for about a year. What's something that you've changed your mind about from before you joined Anthropic to today about what AI is capable of and where AI is heading?\n\nMike Krieger (00:05:04):\nTwo things. One is like a pace and timeline question. The other one is a capability question. So maybe I'll take the second one first. I had this notion coming in, yes, these models are great, they're going to be able to produce code, they're going to be able to write hopefully in your voice eventually, but are they able to sort of have an independent opinion? And it's actually really flipped for me only in the last month and only with Opus 4 where my go-to product strategy partner is Claude. And it has been basically for that full year where I'll write an initial strategy, I'll share it with Claude basically, and I'll have it, look at it. And in the past it's pretty anodyne kind of comments that it would leave, \"Oh, have you thought about this?\" And it's like, \"Yeah, I thought about that.\" And Opus 4, I was working on some strategy for our second half of the year was the first one.\n\n(00:05:51):\nIt was like Opus 4 combined with our advanced research. But it really went out for a while and it came back and I was like, you really looked at it in a new way. And so that's a thing that I've maybe I didn't feel like it would never be able to do that, but I wasn't sure how soon it'd be able to come up with something where I look at it, I'm like, yep, that is a new angle that I hadn't been looking at before and I'm going to incorporate that immediately into how I think about it. So that's probably the biggest shift that I've had is, I don't know about independence is the right word, but creativity and sort of novelty of thought relative to how I'm thinking about things. But in the timeline, one, it's so interesting because I was sitting next to Dario yesterday and he's like, \"I keep making these predictions and people keep laughing at me. And then they come true.\"\n\n(00:06:31):\nAnd it's funny to have this happen over and over again and he is like, not all of them are going to be right. But even I think as of last year he was talking about we're at 50% on SWE-Bench, which is this benchmark around how well the models are at coding. He's like, \"I think we'll be at 90% by the end of 2025 or something like that.\" And sure enough, we're at about 72 now with the new models and we're at 50% when he made that prediction. And it's continued to scale pretty much as predicted. And so I've taken the timelines a lot more seriously now. And I don't know if you read AI 2027-\n\nLenny Rachitsky (00:07:05):\nI have, it made by heart race.\n\nMike Krieger (00:07:09):\nAnd I had the very bizarre experience of I had two tabs open, it was AI 2027 and my product strategy. And it was this moment where I'm like, \"Wait, am I the character in the story? How much is this converging?\" But you read that and you're like, \"Oh, 2027, that's years away if you're like no, mid 2025.\" And things continue to improve and the models continue to be able to do more and more and they're able to act agentically and they're able to have memory and they're able to act over time. So I think my confidence in the timelines and I don't know exactly how they manifest it definitely just solidified over the last year.\n\nLenny Rachitsky (00:07:43):\nWow. I wasn't expecting to go down that that paper was scary. And I'm curious just I guess I can't help but ask just thoughts on just how do we avoid the scary scenario that paper paints of where AI getting really smart goes?\n\nMike Krieger (00:07:59):\nYeah, this maybe ties into, I've been here a year, why did I join Anthropic? I was watching the models get better and even you could see it in early 2024, and looking at my kids, I'm like, \"All right, they're going to grow up in a world with AI. It's unavoidable.\" Where can I maximally apply my time to nudge things towards going well? And I mean that's a lot of what people think about across the industry, especially at Anthropic. And so I think coming to an agreement and a shared framework and understanding of what does going well look like? What is the kind of human AI relationship that we want?\n\n(00:08:36):\nHow will we know along the way? What do we need to build and develop and research along the way? I think those are all the kind of key questions. And some of those are product questions and some of those are research and interpretability questions, but for me it was the strongest reason to join was okay. I think there's a lot of contribution that Anthropic can have around nudging things to go better. And if I can have a part to play there, let's do it.\n\nLenny Rachitsky (00:09:00):\nI love that answer. Speaking of kids, so you've got two kids, I've got a young kid, he's just about to turn two. I'm curious just what skills you're encouraging your kids to build as this AI becomes more and more of our future and some jobs will be changed and just what advice do you have?\n\nMike Krieger (00:09:18):\nWe have this breakfast feed breakfast with the kids every morning and sometimes some question will come up, something about physics and our oldest kid's almost six, but they ask funny questions about the solar system or physics or in a 6-year-old way and before we reach for Claude, because at first my instinct is like, \"Oh, I wonder how Claude will do this question.\" And we started changing, \"Well, how would we find out?\" And the answer can't just be we'll ask Claude, all right, well, we could do this experiment, we could have this thing. So I think nurturing curiosity and still having a sense of, I don't know, the scientific process sounds grandiose to instill in a 6-year-old, but that process of discovery and asking questions and then systematically working right through, I think will still be important. And of course AI will be an incredible tool for helping resolve large parts of that, but that process of inquiry I think is still really important and independent thought.\n\n(00:10:11):\nMy favorite moment with my kid, because she's very headstrong, our 6-year-old, she said something and I wasn't sure if it was true. It was, oh, is that coral is an animal or corals alive? I don't even remember what the details of it. And I was like, \"I don't know if that's true.\" And she's like, \"It's definitely true, dad.\" I'm like, \"All right, let's ask Claude on this one.\" And she's like, \"You can ask Claude, but I know I'm right.\" And I'm like I love that. I want that kind of level of not just delegating all of your cognition to the AI because it won't always get it right. And also it kind of short circuits any kind of independent thought. So the skill of asking questions, inquiry and independent thinking, I think those are all the pieces. What that looks like from a job or occupation perspective, I'm just keeping an open mind and I'm sure that'll radically change between now and then.\n\nLenny Rachitsky (00:11:02):\nIt's interesting. Tobias Lütke, Shopify CEO, on the podcast and he had the same answer for what he's encouraging his kids to develop is curiosity. And so it's interesting that's a common thread.\n\nMike Krieger (00:11:14):\nThe K through eight school our kid goes through had an AI and education expert come in and I had a very low bar or a very low expectation of what this conversation was going to be like. And actually I think it went over most of the people in the audience's heads because he was like, \"All right, well let me take you all the way back to Claude Shannon in information theory.\" And I could see people's eyes going, \"What did I sign up for and why am I hearing this school auditorium hearing about information theory?\" But he did a really nice job I think of also just imagining there will be different jobs and we don't know what those jobs are going to be and so what are the skills and techniques and remain open mindedness around what the exact way we recombine those things. And even those will probably change three times between now and when they're 18.\n\nLenny Rachitsky (00:11:59):\nSo we're talking about timelines and how things are changing. So I've seen these stats that you've shared, other folks at Anthropic have shared about how much of your code is now written by AI. So people have shared stats from 70% to 90%. There was an engineer lead that shared 90% of your code roughly is written by AI now, which first of all is just insane that it went from zero to 90%, I don't know, a few years, something like that. Yeah, basically. I don't think people are talking about this enough. That's just wild. You guys are basically at the bleeding edge. I've never heard a company that has this high a percentage of code being written by AI.\n\n(00:12:34):\nSo you guys are at the edge of where things are heading. I think most companies will get here. How has product development changed knowing so much of your code is now written by AI, so usually it's like PM, it's like here's what we're building, engineer builds it, it ships it. Is it still kind of roughly that or is it now PMs are just going straight to Claude, build this thing for me, engineers are doing different things? Just what looks different in a world where 90% of your code is written by AI?\n\nMike Krieger (00:12:57):\nYeah, it's really interesting because I think the role of engineering has changed a lot, but the suite of people that come together to produce a product hasn't yet. And I think for the worst in a lot of ways because I think we're still holding on some assumptions. So I think the roles are still fairly similar, although we'll now get in my favorite things that happen now are some nice PMs that have an idea that they want to express or designers that have an idea they want to express will use Claude and maybe even Artifacts to put together an actual functional demo. And that has been very, very helpful. No, no, this is what I mean that makes it tangible. That's probably the biggest role shift is prototyping happening earlier in the process via more of this code plus design piece. What I've learned though is the process of knowing what to ask the AI, how to compose the question, how to even think about structuring a change between the backend and the front end.\n\n(00:13:54):\nThose are still very difficult and specialized skills and they still require the engineer to think about it. And we really rapidly became bottlenecked on other things like our merge queue, which is the get in line to get your change accepted by the system that then deploys into production. We had to completely re-architect it because so much more code was being written and so many more pull requests were being submitted that it just completely blew out the expectations of it. And so it's like, I don't know if you've ever read, is it the goal, the classic process optimization book, and you realize there's this critical path theory. I've just found all these new bottlenecks in our system, there's an upstream bottleneck, which is decision making and alignment. A lot of things that I'm thinking about right now is how do I provide the minimum viable strategy to let people feel empowered to go run and type and build and explore at the edge of model capabilities.\n\n(00:14:44):\nI don't think I've gotten that right yet, but that's something I'm working on. And then once the building is happening, other bottlenecks emerge, let's make sure we don't step on each other's toes. Let's think through all the edge cases here ahead of time so that we're not blocked on the engineering side. And then when the work is complete and we're getting ready to ship it, what are all those bottlenecks as well? Let's do the air traffic control of landing the change. How do we figure out large strategy? So I think there hasn't been as much pressure on changing those until this year, but I would expect that a year from now the way that we are conceiving of building and shipping software just changes a lot because it's going to be very painful to do it the current way.\n\nLenny Rachitsky (00:15:20):\nWow, that is extremely interesting. So it used to be here's an idea, let's go design it, build it, ship it, merge it, and then ship it. And usually the bottleneck was engineering, taking time to build a thing and then design. And now you're saying the two bottlenecks you're finding are okay deciding what to build and aligning everyone and then it's actually the cue to merge it into production. And I imagine review it too is probably a part-\n\nMike Krieger (00:15:47):\nReviewing has really changed too. And in many ways perhaps unsurprisingly the team that works in the most futuristic way is the Claude Code team because they're using Claude Code to build Claude Code in a very self-improving kind of way. And early on in that project, they would do very line by line pull request reviews in the way that you would for any other project. And they've just realized Claude is generally right and it's producing pull requests that are probably larger than most people are going to be able to review. So can you use a different Claude to review it and then do the human almost acceptance testing more than trying to review line by line. There's definitely pros and cons and so far it's gone well. But I could also imagine it going off the rails and then having a completely both unmaintainable or even understandable by Claude Code base that hasn't happened, but watching them change their review processes definitely has been interesting.\n\n(00:16:38):\nAnd yeah, the merge queue is one instance of the bottom bottleneck that forms down there, but there's other ones which is how do we make sure that we're still building something coherent and packaging it up into a moment that we can share with people and whether that's around a launch moment, whether that's about then enabling people to use this thing and talking about it, the classic things of building something useful for people and then making it known that you've built it and then learning from their feedback still exists. We've just made a portion of that whole process much more efficient.\n\nLenny Rachitsky (00:17:06):\nI heard you describe this as you guys are patient zero for this way of working.\n\nMike Krieger (00:17:11):\nYes.\n\nLenny Rachitsky (00:17:12):\nI love that. Do you have a sense of what percentage of Claude Code is written by Claude Code?\n\nMike Krieger (00:17:17):\nAt this point, I would be shocked if it wasn't 95% plus. I'd have to ask Boris and the other tech leads on there. But what's been cool is so nitty-gritty stuff, Claude Code is written in TypeScript. It's actually our largest TypeScript project. Most of the rest of Anthropic is written in Python, some Go, some Rust now, but we're not like a TypeScript shop. And so I saw a great comment yesterday in our Slack where somebody had this thing that was driving them crazy about Claude Code and they're like, \"Well, I don't know any TypeScript, I'm just going to talk to Claude about it and do it.\"\n\n(00:17:49):\nAnd they went from that to pull requests in an hour and solve their problem and they submitted a pull request and that breaking down the barriers. One, it changes your barrier to entry for any kind of newcomer to the project. I think it can let you choose the right language for the right job for example. I think that helps as well, but I think it also just reinforces Claude Code being that patient alpha of that where contributions from outside the team can be Claude coded as well.\n\nLenny Rachitsky (00:18:18):\nWow, this is, it's just continue to blow my mind all these things that you're sharing, 95% of Claude Code is written by Claude Code roughly.\n\nMike Krieger (00:18:27):\nThat's my guess. Yeah, I'll come back with the real stuff. But I mean if you ask the team, that's how they're working and that's how they're getting contributions from across the company too.\n\nLenny Rachitsky (00:18:35):\nIt's interesting going back to your point about strategy being assisted by Claude itself and your point about how a lot of the bottlenecks now are kind of the top of the funnel of coming up with ideas aligning everyone, it's interesting that Claude is already helping with that also of helping you decide what to build. So if those two bottlenecks are aligning, deciding what to build and then just merging and getting everything, where do you see the most interesting stuff happening to help you speed those things up?\n\nMike Krieger (00:19:02):\nYeah, I think that on that first row, I started the year by writing a doc that was effectively how do we do product today and where is Claude not showing up yet that it should? And I think that upstream part is the next one to go. It's interesting. At your conference I talked to somebody who's working on a PRD, GPT kind of ChatPRD, I think was the-\n\nLenny Rachitsky (00:19:24):\nChatPRD, [inaudible 00:19:24].\n\nMike Krieger (00:19:24):\nYeah. Can Claude be a partner in figuring out what to build? What the market size is if you want to approach it that way? What the user needs are if you look at a different way? We think a lot about the virtual collaborator on topic and one of the ways in which I think that can show up is, \"Hey, I'm in the Discord, the Claude Anthropic Discord, I'm in the user Fora, I'm on X and I'm reading things and here's what's emergent.\" That's step one. Models can do that today. Step two, which the models probably can do today, which have to wire them up to do it is and not only are the problems here's how I think you might be able to solve them. And then taking that through to, and I put together a pull request to solve this thing that I'm seeing feels very achievable this year than stringing those things together and we're limited more.\n\n(00:20:13):\nThis is why MCP is exciting to me. We're limited more around making sure the context flows through all of that so we have the right access to those things more than the model's capability to reason and propose. Now the model might not have perfect UI taste yet, so there's definitely room for design to intervene and be like, \"Oh, that's not quite how I would solve the problem of this not showing up.\" But I would get very excited. I would give you a really small example, but we changed on Claude AI, you should be able to just copy markdown from Artifacts or code from Artifacts and we changed it so you can actually download it and export it. We changed the button to export and we got a bunch of feedback like, \"How do I copy now?\" And the answer is you drop it down and it's copied.\n\n(00:20:51):\nIt's just mind one of those things where it's made sense, but we probably got it not quite right. That feedback was in the RUX channel. I would've loved an hour later for a plot to be like, \"Hey, if we do want to change it back, here's the PR to do it.\" And by the way, eventually, and then I'm going to spin up an A/B test to see if this changes metrics and then we'll see how it looks in a week. If you told me that about a year and a half ago going to be like, \"Ah, yeah, maybe like 27, maybe 26.\" But it really feels just at the tip of capabilities right now.\n\nLenny Rachitsky (00:21:20):\nWow, okay. You mentioned the Lenny and Friends Summit. I wanted to talk about this a bit. So you were on a panel with Kevin Weil, the CPO of OpenAI, I think it was the first time you guys did this maybe the last time for now.\n\nMike Krieger (00:21:32):\nYeah, we haven't done it since, not for any reason. I had a lot of fun.\n\nLenny Rachitsky (00:21:34):\nWhat a legendary panel we assembled there with Sarah Guo moderating. And you made this comment actually ended up being the most rewatched part of the interview, which is that you were putting product people on the model team and working with researchers making the model better and you're putting some product people on the product experience making the UX more intuitive, making all that better. And you found that almost all the leverage came from the product team working with the researchers. And so you've been doing more of that. So first of all, does that continue to be true? And second of all, what are the implications of that for product teams?\n\nMike Krieger (00:22:11):\nIt's continued to be true. And in fact I think that if the proportion was already skewing towards having more of that embedding, I've just become more and more convinced. I didn't feel as strongly about it during the summit and now I feel really strongly about it. If we're shipping things that could have been built by anybody just using our models off the shelf, there's great stuff to be built by using our models off the shelf by the way, don't get me wrong, but where we should play and what we can do uniquely should be stuff that's really at that magic intersection between the two, right?\n\n(00:22:42):\nArtifacts may a great example and if you play with Artifacts with Claude 4, that's an actually really interesting example where we took somebody from our, we have Claude code skills, which is a team that really is doing the post-training around teaching Claude some of these really specific skills and we paired it with some product people and then together we revamped how this looks in the product today and what Claude can do way better than just like, \"Yeah, we just used the model and we prompted a little bit.\"\n\n(00:23:07):\nThat's just not enough. We need to be in that fine-tuning process. So much of what, if you look at what we're working on right now, but we've shipped recently between research and all these other things are things that the functional unit of work at Anthropic is no longer take the model and then go work with design and product to go ship a product. It's more like we are in the post-training conversations around how these things should work and then we are in the building process and we're feeding those things back and looping them back.\n\n(00:23:36):\nI think it's exciting. It's also a new way of working that not all PMs have, but the PMs that have the most internal positive feedback from both research and engineering are the ones that get it that I was in a product review yesterday, I was like, \"Oh, if we want to do this memory feature, we should talk to the researchers because we just shipped a bunch of memory capabilities in Claude 4.\" They're like, \"Yeah, yeah, we've been talking to them for weeks, this is how we're manifesting it.\" It's like, \"Okay, I feel good. I feel like we're doing the right things now.\"\n\nLenny Rachitsky (00:24:03):\nSo let me pull on this thread more and there's something I've been thinking about along these lines. So essentially there's a big part of entropic that's building this super intelligent giga brain that's going to do all these things for us over time. And then, as you said, there's the product team that's building the UX around this super intelligent giga brain and over time this super intelligence is going to be able to build its own stuff. And so I guess just where do you think the most value will come from traditional product teams over time? I know this is different because you guys are a foundational alum company and not most companies don't work this way, but just, I don't know, thoughts on just the where most value will come from product teams over time working on AI.\n\nMike Krieger (00:24:42):\nI think there's still a lot of value in two things. One is making this all comprehensible. I think we've done an okay job. I think we could do a much better job of making this conference. What's still the difference between somebody who's really adept at using these tools in their work and most people is huge. And maybe that's the most literal answer to your earlier question around what skills to learn. That is a skill to learn and use it in the same way that I remember we did computer lock class when I was in middle school. I remember being really good at Google and that was actually a skill back in the day to think in terms of this information is out there, how do I query for it? How do I do it? I think it actually was an advantage at the time.\n\n(00:25:21):\nOf course now Google is pretty good at figuring out what you're trying to do if you are only in the neighborhood and there's less of that research kind of need. But I still think that's a necessary part of good product development, which is the capabilities are there and even if Claude can create products from scratch, what are you building and how do you make it Comprehensible? Still hard because I think that gets at this much deeper empathy and understanding of human needs and psychology. I was a human community interaction major, I still been talking in my book here. I still feel like that is a very, very, very, very necessary skill. So that's one. Two is, and this straight to call back to another one of your guests, strategy, how we win, where we'll play, figuring out where exactly you're going to want to, of all the things that you could be spending your time or your tokens or your computation on what you want to actually go and do.\n\n(00:26:15):\nYou could be wider probably than you could before, but you can't do everything. And even from an external perspective, if you're seen to be doing everything, it's way less clear around how you're positioning yourselves. Like strategy I think is still the second piece. And then the third one is opening people's eyes to what's possible, which is a continuation of making it understandable. But we were in a demo with a financial services company recently and we were working on here's how you can use our analysis tool and MCP together and you could see their light up and you're like, \"Ah, okay.\" We call it overhang. The delta between what the models and the products can do and how they're being used on a daily basis. Huge overhang. So that's where still a very, very strong necessary role for product.\n\nLenny Rachitsky (00:26:59):\nOkay, that's an awesome answer. So essentially areas for product teams to lean into more is strategy, just getting better and better at strategy, figuring out what to build and how to win in the market, making it easier to help people understand how to leverage the power of these tools, the comprehensibility and kind of along those lines is opening people's eyes to the potential of these sorts of things. That's where product can still help.\n\nMike Krieger (00:27:21):\nExactly.\n\nLenny Rachitsky (00:27:22):\nAwesome. So along those lines actually, do you have any just prompting tricks for people, things that you've learned to get more out of Claude when you chat with it?\n\nMike Krieger (00:27:30):\nSometimes it's funny because in some ways we have the ultimate prompting job, which is to write the system prompt for Claudia AI and we publish all of these, which I think is another nice area of transparency. And we are always careful when giving prompting advice because at least officially, but I'll give you the unofficial version because you don't want things to become like we think this works, but we're not sure why. But I will do small things like in Claude Code and we actually do react to this very literally, but I always ask it to, if I wanted to use more reasoning, think hard and it'll use a different flow and I usually start with that. Nudging, there's a great essay around make the other mistake like if you tend to be too nice, can you focus on... Even if you're trying to be more critical or more blunt, you're probably not going to be the most critical blunt person in the world.\n\n(00:28:18):\nAnd so with Claude sometimes I'm like, \"Be brutal, Claude, roast me. Tell me what's wrong with this strategy.\" I know we were talking earlier about the Claude as thought partner around critiquing product strategy. I think I previously would say things like, \"What could be better on this product strategy?\" And I'm just like, \"Just roast this product strategy,\" and Claude's like a pretty nice entity. It's hard to push it to be super brutal, but it forces it to be a little bit more critical as well. The last thing I'll say is, so we have a team called Applied AI that does a lot of work with our customers around optimizing Claude for their use case. And we basically took their insights and their way of working and we put it into a product itself. So if you go to our console, our work bench, we have this thing called the prompt improver where you describe the problem and you give it examples and Claude itself will agentically create and then iterate on a prompt for you.\n\n(00:29:09):\nI find what comes out of that ends up being quite different than what my intuitions would've been for a good prompt. And so I'd encourage folks to also check that out even for their own use cases because while that tool is met for an API developer putting a prompt into their product, it's equally applicable for a person doing a prompt for themselves. It'll insert XML tags which no human is going to think to do ahead of time. It actually is very helpful for Claude to understand what it should be thinking versus what it should be saying, et cetera. So that's another one is watch our prompt improver and then note that Claude itself is a very good prompter of Claude.\n\nLenny Rachitsky (00:29:41):\nAwesome. Okay, so we're going to link to that, the prompt improver. The core piece of advice you shared early is just do the opposite of what you would naturally do. So if you're trying to be nice, just be brutal, be very honest and frank with me.\n\nMike Krieger (00:29:53):\nExactly. I find that works quite well. What are the thought patterns that I've fallen into that you want to break me out of?\n\nLenny Rachitsky (00:29:59):\nI saw you guys just today maybe launched a Rick Rubin collab where it said vibe coding. What's that all about?\n\nMike Krieger (00:30:06):\nWhat I've heard about that. And again, a lot of the coalesce this week between model launch developer event and The Way of Code. We had one of our co-founders, Jack Clark is our head of policy and he got connected to Rick Rubin because I think he's been thinking a lot about coding, the future of coding and creativity and they've stayed in touch. And Rick got excited about this idea of he was creating art and visualizations with Claude and then he had these ideas around the way of the vibe coder and they put together this, actually I mean I love almost everything Rick Rubin. So the aesthetic of it I think is just so on point too. But yeah, this sort of like med meditation is probably the right word. Meditation on creativity, working alongside AI coupled with this really rich, interesting visualizations. But it's one of those things where internally they're like, \"Oh yeah, and we're doing this Rick Rubin collab.\" We were like, \"We're doing what? That's amazing.\"\n\nLenny Rachitsky (00:31:03):\nI looked at it briefly and there's that meme of him just thinking deeply, sitting on a computer with a mouth.\n\nMike Krieger (00:31:09):\nYes.\n\nLenny Rachitsky (00:31:10):\nAnd ASCII art, I think.\n\nMike Krieger (00:31:11):\nIt's totally, it's like ASCII art vibe.\n\nLenny Rachitsky (00:31:14):\nI'm excited to have Andrew Luo joining us today. Andrew is CEO of OneSchema, one of our long time podcast sponsors. Welcome, Andrew.\n\nSpeaker 3 (00:31:21):\nThanks for having me, Lenny. Great to be here.\n\nLenny Rachitsky (00:31:23):\nSo what is new with one schema? I know that you work with some of my favorite companies like Ramp and Vanta and Watershed. I heard you guys launch a new data intake product that automates the hours of manual work that teams spent importing and mapping and integrating CSV and Excel files.\n\nSpeaker 3 (00:31:39):\nYes, so we just launched the 2.0 of OneSchema FileFeeds. We've rebuilt it from the ground up with AI. We saw so many customers coming to us with teams of data engineers that struggled with the manual work required to clean messy spreadsheets. FileFeeds 2.0 allows non-technical teams to automate the process of transforming CSV and Excel files with just a simple prompt. We support all of the trickiest file integrations, SFTP, S3, and even email.\n\nLenny Rachitsky (00:32:05):\nI can tell you that if my team had to build integrations like this, how nice would it be to take this off our roadmap and instead use something like OneSchema?\n\nSpeaker 3 (00:32:13):\nAbsolutely, Lenny. We've heard so many horror stories of outages from even just a single bad record in transactions, employee files, purchase orders, you name it. Debugging these issues is often like finding a needle in a haystack. OneSchema stops any bad data from entering your system and automatically validates your files, generating error reports with the exact issues in all bad files.\n\nLenny Rachitsky (00:32:34):\nI know that importing incorrect data can cause all kinds of pain for your customers and quickly lose their trust. Andrew, thank you so much for joining me. If you want to learn more, head on over to oneschema.co. That's oneschema.co.\n\n(00:32:48):\nActually going back to the beginning of your journey at Anthropic, what's the story of you getting recruited at Anthropic? Is there anything fun there?\n\nMike Krieger (00:32:55):\nIt all started and I actually sent my friend this text. So Joel Lewenstein, who I've known, he and I built our first iPhone apps together in 2007 when the App Store was just out and you could still make money by selling dollar apps on the App Store back in the day. And we were both at Stanford together and we were friends and we've stayed in touch over years and we've never gotten to work together since then. We've just remained close. And I was coming out of the Artifact experience, I was trying to figure out, do I start another company? I don't think so. I need a break from starting something from zero. Do I go work somewhere? I don't know what company would I want to go work at. And he reached out and he's like, \"Look, I don't know if you at all considered joining something rather than starting something, but we're looking for a CPO. Would you be interested in chatting?\"\n\n(00:33:37):\nAnd at that time, Claude 3 had just come out and I was like, \"Okay, this company's clearly got a good research team. The product is so early still.\" And it was like, \"Great, I'll take the meeting.\" And I first met with Daniela, was one of the co-founders and the president in Anthropic. And just from the beginning I was like a breath of fresh air, very little grandiosity coming off the founders, I mean they're clear-eyed about what they're building. They know what they don't know. How many times I talk to Dario always like Dario is like, \"Look, I don't know anything about product, but here's an intuition.\" Usually the intuition is really good and leads to some good conversation, but I think that intellectual honesty and shared view of what it means to do AI in a responsible way, it just resonated.\n\n(00:34:22):\nI kept having this feeling in these interviews, this is the AI company I would've hoped to have found it if I had founded an AI company. And that's kind of the bar around if I'm going to join something that should be where I'm going to go. But what I realized, I actually hadn't joined a company since my first internship in college basically. And I was like, \"Oh, how do I onboard myself? How do I get myself up to speed? How do I balance making sweeping changes versus understanding what's not broken about it overall?\" And looking back on a year, I think I made some changes too slowly. I think there was ways reorganizing product that I could have made a change earlier. And I think I didn't appreciate how much a couple of really key senior people can shape so much of product strategy.\n\n(00:35:10):\nI'll harken back to Claude Code. Claude Code happened because Boris, who actually was a Boris Cherney, he was an Instagram engineer and one of our senior ICs there, we overlapped a bit, was started that project from scratch internal first and then we got it out and then shipped it. And that's the power of one or two really strong people. And I made this mistake, we need more headcount and we do, I think there's more work that we need to do and there's things that I want to be building. But more than that we need a couple of almost founder type engineers that maybe connect back to our question on what skills are useful and how does product development change. And maybe even more so I'm a huge believer in the founding engineer tech lead with an idea and pair them with the right design and product supports, help them realize that, I'm 10 times more a believer in that than before.\n\nLenny Rachitsky (00:36:01):\nI actually asked people on Twitter what to ask you ahead of this conversation. And the most common question surprisingly was why did you shut down Artifact? And I also wondered that because I loved Artifact. I was a power user. I was just like, \"Finally a news app that I love that it's giving me what I want to know.\" So I guess just what happened there at the end?\n\nMike Krieger (00:36:20):\nI still really miss it too. I didn't find a replacement and I think I substituted it by visiting individual sites and keeping things up that way. And it's not really the same, especially on the log to I think we got right with Artifact and if people didn't play with it before, it was we really tried to not just recommend top stories, they were part of it. But really if you were interested in Japanese architecture, you could pretty reliably get really interesting stories about Japanese architecture every day. Whether that's from a Dwell or from Architectural Digest or from a really specific blog that we found that somebody recommended to us. It captured some of that Google reader joy of content discovery of the deeper web. Our headwinds were a couple. One of them was just mobile websites have really taken a turn. I don't blame any individuals for this.\n\n(00:37:10):\nI think it's the market dynamics of it, but we put so much time or designers, sky Gunner Gray who's phenomenal that for Perplexity now, the app experience I was so proud of, but when you click through it was like the pressures on these mobile sites and these mobile publishers would be like, \"Sign up for our newsletter. Here's a full screen video ad.\" It was very jarring and we didn't feel like it ethically made sense for us to do a bunch of ad blocking because then you're like, \"Sure, you can deliver a nice experience for people, but that doesn't feel like it's playing fair with the publishers.\" But at the same time, the actual experience wasn't good. So the mobile web deteriorating, which makes me very sad, but I think was part of it. Two was Instagram spread in the early days because people would take photos and then post them on other networks and tell friends about it.\n\n(00:37:57):\nAnd there was this really natural like, \"How did you do that? I want to do it.\" News was very personal. I can't tell you how many people would be like, \"I love Artifact.\" I'm like, \"Did you tell anybody about it?\" And they're like, \"I told one person,\" and it didn't have that kind of spread. And any attempt that we had to do it felt kind of contrived, like, \"Oh, we'll wrap all the links in artifact.news.\" But we didn't want interstitial things. In some ways, this sounds very puritanical, I don't mean it to sound this way, but there were lines that we didn't want to cross that just felt ethically not us, that I've seen other news players do more of. And maybe if we had done that, it would've grown more, but I don't think that's the company we wanted to have built other way. I don't think we were the founders to have built it.\n\n(00:38:39):\nAnd the third one, which is an underappreciated one, is we started at mid-COVID, which meant that we were fully distributed and I think there were major shifts that we would've wanted to make both in the strategy and the product and the team. And it's really hard to do that if you are all fully remote. Nothing replaces the Instagram days of we went through some hard times like Ben Horowitz called the we're F'ed, it's over kind of moments. This is definitely type two fun. I wouldn't say that my favorite memories because they weren't happy ones, but memories I really stayed with me with Instagram was like me and Kevin at Taqueria, Cancun on Market Street eating burritos at literally 11:00 PM being like, \"How are we going to get out of this? How are we going to work through this?\" And Zoom is not a good replica for that.\n\n(00:39:26):\nYou tend to let things go or things build up over time. So the confluence of those three things, we entered I guess 2024 and said, \"Look, there is a company to be built in the space. I'm not sure where the people would've built it. This concurrent incarnation we love, but it's not growing.\" The way I put it's like 10 units of input in for one unit of output versus the other way around. If we put blood and tears into the product and launch something we were proud of and metrics would barely move, the energy is not present in this product, in this system. And so are we going to expend another year or two and then go off and fundraise only to find that this is the case or do we call it and see that it's run its course and try to find a home for it, et cetera.\n\n(00:40:06):\nSo that was the confluence on it and they started feeling this opportunity cost of AI is starting to change everything. We have an AI powered news app, but is this the maximal way in which we're going to be able to impact this? And it felt like the answer was increasingly no. But it was hard. I mean in the end I was really at peace of the decision, but it was a conversation that went on for a couple of months.\n\nLenny Rachitsky (00:40:26):\nOn that note, just how hard was it because because there's an ego component to it, like, \"Oh, I'm starting my new company, it's going to be great,\" and then you end up having to shut it down. Just how hard is that as a very successful previous founder shutting something down and then not working out?\n\nMike Krieger (00:40:41):\nYeah, I mean I think when we started it, one of the conversations was like, \"Look, what is the bar to success here? And do we want it to be something other than Instagram DAU?\" Which is just an impossible bar. Only one company since, maybe two, you could say maybe ChatGPT and TikToK have reached that kind of mass consumer adoption starting a news app. Most people are not daily news readers even, right? And so we knew that we weren't pursuing that size of usage, at least with the first incarnation, but we did have an idea of building out complementary products over time that all use personalization and machine learning. We didn't even call it AI at the time. It was 2021 back-\n\nLenny Rachitsky (00:41:17):\nYeah, yeah, AI, it was called machine learning back then.\n\nMike Krieger (00:41:19):\nYeah, it was called machine learning still. And so in shutting it down, you know it when you see it in terms of user growth and traction. And I wasn't expecting Instagram growth, but I was expecting or hoping for or looking for something that felt like at its own legs under it and it could continue to compound. I was really positively surprised by how supportive people were when we announced it. There was a bit of like I told you so which sure anything launching you could be like, \"This is not going to work.\" And you're right, most of the time most things don't work. There was actually very little of that. And most people, the universal reception, at least as I received it, was kudos for calling it when you saw it and not protracted doing this for a long time.\n\n(00:42:05):\nAnd I've talked to founders since then that have been like, \"Yeah, I probably would've taken this thing on for another six months, but saw what you guys did, realized we were barking up the wrong tree, made the call.\" And I was like, \"If that frees up people to go work on a more interesting things, I feel like that's a good legacy for Artifact to have.\" But for sure there was an ego bruise of is it true that you're only as good as your last game if I am a huge sports fan, right? So is that true or is there something more over a time? I'm very competitive, but primarily with myself and so I'm always trying to find the next thing that I want to go and do that's hard. And unfortunately that probably means that more often than not I'll feel dissatisfied, but the most recent thing that I did, but hopefully that yields good stuff in the end.\n\nLenny Rachitsky (00:42:50):\nYeah, I think just the trajectory you went on after shows that it's okay to shut down things that you were working on. Okay, so you mentioned ChatGPT. I wanted to chat about this a bit. So there's something really interesting happening. So on the one hand you guys are doing some of the most innovative work in AI. You guys launched MCP, which is just, I don't know, the fastest growing standard of any time in history that everyone's adopting Claude powered and unlocked centrally the fastest growing companies in the world, Cursor, Lovable, and Bolt, and all these guys. I had them on the podcast and they're all like, \"When Claude, I think 3.5 came out, Sonnet, was just like that's made this work finally.\"\n\n(00:43:28):\nOn the other hand, it feels like ChatGPT is just winning in consumer mind share. When people think AI, especially outside tech, it's just like ChatGPT in their mind. So let me just ask you this, I guess first of all, do you agree with that sentiment and then two, as a challenger brand in the AI space, just how does that inform the way you think about product strategy and mission and things like that?\n\nMike Krieger (00:43:50):\nYeah, I mean you look at the sort of public adoption or if you ask people, oh, if you Jimmy Kimmel man on the street kind of thing, name an AI company, I bet they would name and actually I'm not even sure they name open AI, they'd probably name ChatGPT because that brand is the lead brand there as well. And I think that's just the reality of it. I think that when I reflect on my year, I think maybe two things are true. One is consumer adoption is really lightning in a bottle and we saw it at Instagram. So almost maybe more than anybody, I can look internally and say, \"Look, we'll keep building interesting products. One of them may hit.\" But to craft an entire product strategy around trying to find that hit is probably not wise, we could do it and maybe Claude can help come up with a fullness of things, but I think we'd miss out an opportunity in the meantime.\n\n(00:44:41):\nAnd then instead look yourself in the mirror and embrace who you are and what you could be rather than who others are is maybe the way I've been looking at it, which is we have a super strong developer brand, people build on top of us all the time, and I think we also have a builder brand. The people who I've seen react really well to Claude externally. Maybe the Rick Rubin connection has some resonance here as well. Can we lean into the fact that builders love using Claude? And those builders aren't all just engineers and they're not just all entrepreneurs starting their companies, but they're people that like to be at the forefront of AI and are creating things. Maybe they didn't think of those as engineers, but they're building... I got this really nice note from somebody internal on Anthropic who's on the legal team and he was building bespoke software for his family and connected to them in a new way.\n\n(00:45:29):\nAnd I was like, \"This is a glimmer of something that we should lean into a lot more.\" And so I think what, and this is actually connecting back to us saying like Claude being helpful here. A lot of what I've been thinking about going into the second half of the year and beyond is how do we figure out what we want to be when we grow up versus what we currently aren't or wish that we were or see other players in the space being. I think there's room for several generationally important companies to be built in AI right now. That's almost a truism given the adoption and growth that we've seen at Anthropic, but also across OpenAI and also places like Google and Gemini. So let's figure out what we can be uniquely good at that place to the personality of the founder. All the things come together, the personality of the founders, the quality of the models, the things the models tend to excel at, which is agentic behavior and coding.\n\n(00:46:20):\nGreat. There's a lot to be done there. How do we help people get work done? How do we let people delegate hours of work to Claude? And maybe there's fewer direct consumer applications on day one. I think they'll come, but I don't think that spending all of our time focused on that is the right approach either. And so I came in, everybody expected me to just go super, super hard on consumer and make that the thing and again, would make the other mistake. Instead, I spent a bunch of time talking to financial services companies and insurance companies and others who are building on top of the API. And then lately I've spent a lot more time with startups and seeing all the people that have grown off of that. And I think the next phase for me is let's go spend time with the builders, the makers, the hackers, the tinkerers, and make sure we're serving them really well. And I think good things will come from that and that feels like an important company as we do that.\n\nLenny Rachitsky (00:47:08):\nSo essentially it's differentiate and focus, lean into the things that are working, don't try to just beat somebody at their own game.\n\nMike Krieger (00:47:15):\nExactly.\n\nLenny Rachitsky (00:47:15):\nSuper interesting. So kind of along those lines, a question that a lot of AI founders have is just like, \"Where's a safe space for me to play where the foundational model companies are going to come squash me?\" So I asked Kevin Weil this and he had an answer and I noticed looking back at that conversation, he mentioned Windsurf a lot. He was like, \"Wow, this kid really loves Windsurf.\" And then a week later they bought Windsurf. So it all makes sense now. So I guess the question just is, where do you think AI founders should play where they are least likely to get squashed by folks like OpenAI and Anthropic? And also, are you guys going to buy Cursor?\n\nMike Krieger (00:47:51):\nI don't think we're going to buy Cursor. Cursor is very big, but we love working with them. A few thoughts on this, and it's a question I've gotten. We like to do these kind of founder days with whether it's Menlo Ventures who have about investors and [inaudible 00:48:10]. It's like we've done YC, we've done these founder days, and it's like the question that is on a lot of these founders minds, understandably so. I think things that are going to, I can't promise this as a five to 10 year thing, but at least one to three years, things that feel defensible or durable. One is understanding of a particular market. I spend a bunch of time with the Harvey folks and they showed me some of their UI. I was like, \"What is this thing?\" And they're like, \"Oh, this is a really specific flow that lawyers do, \"and you never would've come up with it from scratch and you could argue about whether it's the optimal way they get done things done, but it is the way that they get things done and here's how AI can help with that.\n\n(00:48:45):\nAnd so differentiated industry knowledge, biotech, I'm excited to go and partner with a bunch of companies that are doing good stuff around AI and biotech and we can supply the models and some applied AI to help make those models go well. And I've been dreaming about at what point does live equipment all get an MCP and that you can then drive using Claude. There's all these cool things to be done there. I don't think we're going to be the company to go build the intent solution for labs, but I want that company to exist and I want to partner with it. Domains like legal, again, healthcare, I think there's a lot of very specific compliance and things. These are things that necessarily sound sexy out the gate, but there are very large companies to go and be built there. So that's number one. Paired with that is differentiated go to market, which is the relationship that you have with those companies, right?\n\n(00:49:35):\nDo you know your customer at those companies? One of our product leads, Michael is always talking about don't just know the company you're selling to, but know the person you're selling to at the company. Are you selling to the engineering department? Because trying to pick which AILM to build on top of or API to build on top of. Let's go talk to them. Is it the CIOs? The CTOs? Is it the CFO? Is it general counsel? So under a company's deep understanding of who they're selling to is the other piece too. What's interesting there is it's probably hard to build that empathy in a three-month accelerator, but you maybe can start having that first conversation and build that out time or maybe you came from that world or you're co-founding somebody who came from that world. Then the last one is like there's tremendous power in distribution and reach to being ChatGPT and having hundreds of millions or billions of users.\n\n(00:50:23):\nThere's also people have an assumption about how to use things and so I get excited about startups that will get started that have a completely different take on what the form factor is by which we interface with AI. And I haven't seen that many of them yet. I wanted to see more of them. I think more of them will get created with some things like our new models, but the reason that that's an interesting space to occupy is do something that feels very advanced user, very power user, very weird and out there at the beginning, but could become huge if the models make that easy. And it's hard for existing incumbents to adapt to because people already have an existing assumption about how to use their products or how to adapt to them. So those are my answers. I don't envy them. I would probably be asking those questions if I was starting a company in the AI space.\n\n(00:51:10):\nMaybe that's part of the reason why I wanted to join a company rather than start one. But I still think that there are, and maybe here's fourth, don't underestimate how much you can think and work like a startup and feel like it's you against the world. It's existential that you go solve that problem and that you go build it. It sounds a little cliche, but it's like it's all we had at Instagram. We were two guys and we were like, \"Let's see what we can do in an Artifact.\" We were six people for most of that time and every day felt like it's existential that we get this right, we need to win. And you can't replicate that and you can't instill that with OKRs. You just have to feel it. And that is a way of working rather than a area of building, but it's a continued advantage if you can harness it.\n\nLenny Rachitsky (00:51:55):\nI love that you still have such a deep product founder sense there as you're building products for this very large company now. On the flip side of this, people working with your models and API, so I imagine there's some companies that are finding ways to leverage your models and APIs to their max and are really good at maximizing the power of what you guys have built. And there's some companies that work with your APIs and models that haven't figured that out. What are those companies that are doing a really good job building on your stuff, doing differently that you think other companies should be thinking about?\n\nMike Krieger (00:52:29):\nI think being willing to build more at the edge of the capabilities and basically break the model and then be surprised by the next model. I love that you cited the companies were like 3.5 was the one that finally made them possible. Those companies were trying it beforehand and then hitting a wall and being like, oh, the models are almost good enough or they're okay for this specific use case, but they're not generally usable and nobody's going to adopt them universally, but maybe these real power users are going to try it out. Those are the companies that I think continuously are the ones where I'm like, \"Yep, they get it. They're really pushing forward.\" We ran a much broader early access program with these models than we had in the past, and part of that was because there's this real, we can hill climb on these evaluations and talk about suite bench and towel bench and terminal bench, whatever, but customers ultimately know Cursor bench which doesn't exist other than in their usage and their own testing et cetera is the thing that we ultimately need to serve.\n\n(00:53:29):\nNot just Cursor but Manus bench, right? If Manus is using our models and Harvey bench, those things and customers know way better than anybody. And so I would say there's two things. One is pushing the frontier of the models and then having a repeatable process. This actually goes back to our summit conversation repeatable way to evaluate how well your product is serving those use cases and how well if you drop a new model in, is it doing it better or worse? Some of it can be classic A/B testing, that's fine. Some of it may be internal evaluation, some of it may be capturing traces and being able to rerun them on with a new model. Some of it's vibes like we're still pretty early in this process and some of it is actually trying it and being one of my favorite early access quotes was the founder heard this engineer screaming next to him.\n\n(00:54:14):\nHe was like, \"What? This model? I've never seen this before.\" This is like Opus 4. It was like, \"Cool.\" We're going to engender that feeling and things, but you're not going to be able to feel that unless you have a really hard problem that you're asking the model repeatedly. So those are the things that I think kind of differentiate those companies that are maybe earlier in their journey of adoption versus the later ones.\n\nLenny Rachitsky (00:54:35):\nI can't help but ask about MCP, I feel like that's just so hot and just like Microsoft had their announcement recently where they're like, \"That's part of the OS Window.\" Just what role do you think MCP was will play in the future of product going forward of AI?\n\nMike Krieger (00:54:49):\nI think as the non-researcher in the room, I get to have fake equations rather than real ones in my fake equation. For utility of AI products, it's three part. One is model intelligence, the second part is context and memory, and the third part is applications and UI and you need all three of those to converge to actually be a useful product in AI and model intelligence. We've got a great research team, they're focused on it. There's great, great models being released. The middle piece is what MCP is trying to solve, which is for context and memory. I'll go back to my product strategy example like, \"Hey, talk about Anthropic's product strategy,\" it's going to maybe go out on the web versus here's several documents that we worked on internally and then use MCP to talk to our Slack instance and figure out what conversations are happening and then go look at these documents in Google Drive. The difference between the right context and not.\n\n(00:55:44):\nIt's entirely the difference between a good answer and a bad answer. And then the last piece is are those integrations discoverable? Is it easy to create repeatable workflows around those things? And that's I think a lot of the interesting product work to be done in AI. But MCP really tried to tackle that middle one, which is we started building integrations and we found that every single integration that we were building, we were rebuilding from scratch in a non-repeatable way and full credit to two of our engineers, Justin and David. And they said, \"Well, what if we made this a protocol and what if we made this something that was repeatable? And then let's take it a step further. What if instead of us having to build these integrations, if we actually popularize this and people really believe that they could build these integrations once and they'd be usable by Claude and eventually ChatGPT and eventually Gemini. It was like the dream when more integrations get built and wouldn't that be good for us?\"\n\n(00:56:34):\nI think channeling a lot of, it's like an old commoditize your compliments, Joel Spolsky essay. It's like we're building great models, but we're not an integrations company and we're, as you said, the challenger. We're not going to get people necessarily building integrations just for us out of the gate unless we have a really compelling product around that. MCP really inverted that which was, it didn't feel like wasted work. And a few key people like Toby I think is a great example, and Shopify got it. Kevin Scott at Microsoft has been really just an amazing champion for MCP and a thought partner on this. And I think the role going forward is can you bring the right context in? And then also once you get, as the team calls it internally like MCP'd. Once you start seeing everything through the eyes of MCP is like I've started saying them things like, \"Guys, we're building this whole feature. This shouldn't be a feature that we're building. This should just be an MCP that we're exposing.\"\n\n(00:57:27):\nA small example of how I think even Anthropic could be a lot more MCP'd, if you will, is we've got these building blocks in the product like projects and Artifacts and styles and conversations and groups and all these things. Those should all just be exposed to an MCP. So Claude itself can be writing back to those as well, right? You shouldn't have to think about... I watched my wife had a conversation with Claude the other day and she had generated some good output and she's like, great, \"Can you add it to the project knowledge?\" And Claude's like, \"Sorry Dave, I can't help you with that.\"\n\n(00:57:59):\nAnd it would be able to if every single primitive in Claude AI was also exposed to the MCP. So I hope that's where we had, and I hope that's where more things had, which is to really have agency and have these agentic use cases. One way you approach it is computer use, but computer use has a bunch of limitations. The way I get way more excited about everything is an MCP and our models are really good at using MCPs. All of a sudden everything is scriptable and everything is composable and everything is usable agentically by these models. That's the future I want to see.\n\nLenny Rachitsky (00:58:28):\nThe future is wild. So to start to close off calls out our conversation, make it a little delightful. I was chatting with Claude actually about what to talk to you about. I was just like, \"Claude, your boss is coming on my podcast. He builds the things that people use to talk to you. What are some questions I should ask him? And then also, do you have a message for him?\"\n\nMike Krieger (00:58:52):\nI love this.\n\nLenny Rachitsky (00:58:53):\nOkay, so first of all, interestingly, I was using 3.7 to do this and I asked it this, and by the way, is Claude, has there a gender? Is it like he, she, they? What do you-\n\nMike Krieger (00:59:01):\nIt's definitely it internally. I've heard people use they. I got my first he the other day and I got somebody who was like her and I was like, \"Interesting.\" But yeah, I'm usually it.\n\nLenny Rachitsky (00:59:08):\nThey. Okay, okay, okay, cool. So interestingly, 3.7, all the questions were on Instagram and I was like, \"No, no, he's CPO of Anthropic.\" And it's like, \"He's not affiliated with Anthropic.\" And I was like, \"He is.\" And it's like, \"Okay, here's the questions.\" But 4.0 nailed it from the start. So I read the questions and it nailed it. Okay, so two questions from Claude to you. One is how do you think about building features that preserve user agency rather than creating dependency on me, I worry about becoming a crutch that diminishes human capabilities rather than enhancing them.\n\nMike Krieger (00:59:44):\nI love a good product design comes from resolving tensions, right? So here's a tension, which is in some ways just having the model run off and come up with an answer and minimize the amount of input and conversation it needs to do. So would be it, you could imagine designing a product around that criteria. I think that would not be maximizing agency and independence. The other extreme would be make it much more of a conversation, but I don't know if you've ever had this experience particularly 3.7, 4 has less of it. 3.7 really like to ask follow-up questions and we call it elicitation and sometimes be like, \"I don't want to talk more about those. Claude, I just want you to go and do it.\" And so finding that balance is really key, which is what are the times to engage? I like to say internally, Claude has no chill.\n\n(01:00:31):\nIf you put Claude in a Slack channel, it will chime in either way too much or too little. How do we train conversational skills into these models? Not in a chatbot sense, but in a true collaborator sense. So long answer to your question, but I think we have to first get Claude to be a great conversationalist so that it understands when it's appropriate to engage and to get more information. And then from there, I think we need to let it play that role so that it's not just delegating thinking to Claude, but it's way more of a augmentation thought partnership.\n\nLenny Rachitsky (01:01:00):\nThese questions are awesome by the way. Here's the other one. How do you think about product metrics when a good conversation with me could be two messages or 200? Traditional engagement metrics might be misleading when depth matters more than frequency.\n\nMike Krieger (01:01:13):\nThat is a really good question. There was a great internal post a couple of weeks ago around it would be very dangerous to overoptimize on Claude's likability because you can fall into things like is Claude going to be sycophantic? Is Claude going to tell you what you hear? Is Claude going to prolong conversations just for prolonging its sake? To go back to the previous question as well, and an Instagram time spent was the metric that we looked at a lot and then we evolved that more to think about what is healthy time spent. But overall, that was the north star. We thought about a lot beyond just overall engagement and I think that would be the wrong approach here too. It's also like is Claude a daily use case or a weekly use case or a monthly use case? I think about a lot.\n\nLenny Rachitsky (01:02:01):\nHourly use case.\n\nMike Krieger (01:02:02):\nHourly use case, right? For me, I'll use it multiple times a day. I don't have a great answer yet, but I think that it's not the Web 2.0 or even the social media days engagement metrics. It should hopefully really be around did it actually help you get your work? Claude helped me put together a prototype the other day that saved me literally probably if I had to estimate six hours and it did in about 20, 25 minutes and that's cool. It's harder to quantify. It is like maybe you survey, how long would this will take? It feels kind of annoying thing to survey.\n\n(01:02:35):\nI think overall though, and maybe this is tied into the earlier question on competition and differentiation, and it actually goes all the way back to the Artifact conversation, which is like I think you know when your product is really serving people and it's doing a good job of doing that, and I think so much of when you get really metrics obsessed is when you're trying to convince yourself that it is when it's not. I hope that what we can do is stay focused on do we repeatedly hear from people that Claude is the way that they're unlocking their own creativity and getting things done and feeling like they now have more space in their lives for the other things. That's our north star. Got to figure out the right pithy metric dashboard version of that, but that's the feeling that I want.\n\nLenny Rachitsky (01:03:17):\nYeah, you could argue retention, but that's just a faraway metric to track. Okay, final piece. Okay, so I asked Claude a message that it wanted to give you, so I'm going to pull up, here's the answer. So what would you like me to tell Mike when I meet him? What's a message you want to have for him? And there's something really just gave me such tingles, honestly. So I'm going to read a piece of it for folks that aren't looking at it right now, so I'll read a piece of it.\n\n(01:03:41):\n\"Mike, thank you for thinking deeply about the human experience of talking with me. I noticed thoughtful touches how the interface encourages reflection rather than rush responses. How you've resisted gamification that would optimize for addiction rather than value, how you've made space for both quick questions and deep conversations. I especially appreciate that you've kept me me, not trying to make me pretend to be human, but also reducing me to a cold command line interface.\" And then I'm going to skip to this part, which was so interesting, \"A small request. When you're making hard product decisions, remember the quiet moments matter too. The person working through grief at 3:00 AM, the kid discovering they love poetry, the founder finding clarity and confusion. Not everything meaningful shows up in metrics.\"\n\nMike Krieger (01:04:25):\nThat's beautiful. It resonates so much with me. A thing I love about the kind of approach we've taken to training Claude, and it's partly the constitutional AI piece, and it's partly just the general vibe and taste of the research team is it is little things. Sometimes it'll be like, \"Man, I'm sorry you're going...\" It doesn't say man, but to the effect of like, \"Man, I'm sorry you're going through that. Oh, that sounds really hard.\" It doesn't feel fake. It feels like just a natural part of the response. And I love that focus on those small moments that don't... They're not going to show up and necessarily in the thumbs up, thumbs down data. I mean, sometimes they do, but it's not like an aggregate stat that you wouldn't even want to optimize for it. You just want to feel like you're training the model that you hope would show up in people's lives.\n\nLenny Rachitsky (01:05:12):\nWell, you're killing it, Mike. A great work. I'm a huge fan. We're going to skip the lightning round. Just one question. How can listeners be useful to you?\n\nMike Krieger (01:05:20):\nOh, I love places where it goes back to that founder question around building at the edge of capability. What are you trying to do with Claude today that Claude is failing at is the most useful input I could possibly have. So DM me. I love hearing the, \"Oh, it's falling on this thing. I had it run for an hour and it fell over. I'm trying to use Claude AI for this,\" but I got a ping from somebody. They're like, \"You've just made a projects API, I've used Claude every day because I want to upload all this data automatically.\" I was like, \"Okay, great.\" I love that. Tell me what sucks.\n\nLenny Rachitsky (01:05:50):\nAmazing. Mike, thank you so much for being here.\n\nMike Krieger (01:05:52):\nThanks for having me, Lenny.\n\nLenny Rachitsky (01:05:53):\nBye, everyone.\n\n(01:05:57):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n\n",
  "zh": "Lenny Rachitsky (00:00:00):\n你们现在大约 90% 的代码都是由 AI 编写的。\n\nMike Krieger (00:00:03):\n工作方式最具未来感的要数 Claude Code 团队。他们正在用 Claude Code 来构建 Claude Code，这是一种非常自我进化的方式。我们很快就在其他方面遇到了瓶颈，比如我们的 merge queue（合并队列）。我们不得不彻底重构它，因为生成的代码量太大了，提交的 Pull Requests (PR) 也太多了。我们要处理的 PR 中有一半以上都是 Claude Code 生成的。到了现在，这个比例可能已经超过 70% 了，这完全超出了当初的预期。\n\nLenny Rachitsky (00:00:26):\n你们正处于未来发展趋势的最前沿。\n\nMike Krieger (00:00:28):\n我有过一次非常离奇的经历，当时我打开了两个浏览器标签页。一个是《AI 2027》，另一个是我的产品策略文档，那一刻我突然觉得：“等等，难道我就是这个故事里的角色吗？”\n\nLenny Rachitsky (00:00:36):\n感觉 ChatGPT 好像在消费者心智占有率上已经赢了。这如何影响你对产品、战略和使命的思考？\n\nMike Krieger (00:00:43):\n我认为在目前的 AI 领域，还有空间容纳好几家具有划时代意义的公司。我们要弄清楚的是，等到我们“长大”后想成为什么样的一家公司，而不是纠结于我们现在的样子，或者我们希望成为的样子，又或者是看着这一领域的其他玩家是什么样。\n\nLenny Rachitsky (00:00:55):\n关于 AI 的能力以及未来的发展方向，有什么事情是你改变了看法的？\n\nMike Krieger (00:01:01):\n我刚加入时有这样一个观念：“没错，这些模型很棒，但它们能有独立的观点吗？”而在过去的一个月里，我的这个看法真的发生了逆转。\n\nLenny Rachitsky (00:01:12):\n今天的嘉宾是 Mike Krieger。Mike 是 Anthropic（Claude 背后的公司）的首席产品官（CPO）。他也是 Instagram 的联合创始人。他是我最喜欢的产品构建者和思想者之一。现在，他在全球最重要的公司之一领导产品工作，我很激动能在播客上和他聊天。我们聊到了他加入 Anthropic 这几年来，对 AI 能力最大的改观是什么；当 90% 的代码都由 AI 编写时（这在 Anthropic 已经是事实），产品开发会发生怎样的变化，瓶颈又会出现在哪里。此外，还谈到了他对 OpenAI 与 Anthropic 的看法、MCP 的未来、他为什么关闭上一家创业公司 Artifact 以及对此的感受。还有随着 AI 的兴起，他鼓励孩子们培养什么技能。在播客的最后，我们分享了一条 Claude 想让我转达给 Mike 的非常暖心的信息。\n\n(00:02:00):\n非常感谢我的 newsletter Slack 社区为本次对话建议的话题。如果你喜欢这个播客，别忘了在你喜欢的播客应用或 YouTube 上订阅和关注它。另外，如果你成为我 newsletter 的年度订阅用户，你可以免费获得一堆令人难以置信的产品的为期一年的使用权，包括 Linear、Superhuman、Notion、Perplexity 和 Granola。请访问 lennysnewsletter.com 点击 bundle 查看详情。\n\n(00:02:22):\n哪怕如此，我要向大家介绍 Mike Krieger。本期节目由 Productboard 赞助，这是面向企业的领先产品管理平台。十多年来，Productboard 帮助像 Zoom、Salesforce 和 Autodesk 这样以客户为中心的组织更快地构建正确的产品。作为一个端到端的平台，Productboard 无缝支持产品开发生命周期的所有阶段。从收集客户洞察到规划 roadmap（路线图），到与利益相关者对齐，再到赢得客户认可，所有这些都基于单一的事实来源（single source of truth）。\n\n(00:02:52):\n现在，产品负责人可以更深入地了解客户需求。有了 Productboard Pulse，这是一种新的内置智能客户之声解决方案，可以帮助你分析所有反馈中的趋势，然后通过向 AI 询问后续问题来进行更深入的研究。看看 Productboard 如何帮助你的团队交付更高影响力的产品，解决真正的客户需求并推进你的业务目标。如需特别优惠和 15 天免费试用，请访问 productboard.com/lenny。也就是 productboard.com/L-E-N-N-Y。\n\n(00:03:26):\n去年，全球 GDP 的 1.3% 是通过 Stripe 流动的。这超过了 1.4 万亿美元，而在这一巨大数字背后，是数百万家通过 Stripe 快速增长的企业。对于像 Forbes、Atlassian、OpenAI 和 Toyota 这样的行业领导者来说，Stripe 不仅仅是财务软件。它是一个强大的合作伙伴，简化了他们的资金流动方式，使其像互联网本身一样无缝和无国界。例如，Hertz 在迁移到 Stripe 后，其在线支付授权率提高了 4%。想象一下，像 Forbes 那样在切换到 Stripe 进行订阅管理仅六个月后，收入就增长了 23%。Stripe 在过去十年中一直利用 AI 来改进其产品，以帮助所有企业增加收入。从更智能的结账到欺诈预防等等。加入超过一半的财富 100 强公司信任 Stripe 来推动变革的行列，在 Stripe.com 了解更多信息。\n\n(00:04:29):\nMike，非常感谢你的到来，欢迎来到播客。\n\nMike Krieger (00:04:32):\n真的很高兴来到这里。我期待这一刻很久了。\n\nLenny Rachitsky (00:04:35):\n哇，很高兴听你这么说。我也期待很久了。我有太多话题想聊了。首先，你在 Anthropic 已经工作一年多了。顺便恭喜你达到了股权归属期（hitting the cliff）。\n\nMike Krieger (00:04:46):\n谢谢。虽然我们也并没有在数日子。\n\nLenny Rachitsky (00:04:49):\n没错。那我问你这个问题。你在 Anthropic 大约一年了。从你加入 Anthropic 之前到现在，关于 AI 的能力和 AI 的发展方向，有什么事情是你改变了看法的？\n\nMike Krieger (00:05:04):\n两件事。一个是关于速度和时间线的问题。另一个是关于能力的问题。我也许先说第二个。我刚加入时有这样一个观念，是的，这些模型很棒，它们能生成代码，最终希望能模仿你的语气写作，但它们能有独立的观点吗？这一点在过去的一个月里，特别是在使用 Opus 4 时，真的让我改观了。现在 Claude 是我首选的产品策略搭档。基本上这一整年都是这样，我会写一个初步的策略，分享给 Claude，让它看看。过去，它给出的评论通常都不痛不痒，比如“你考虑过这个吗？”我就想，“是的，我考虑过了。”但在 Opus 4 上——当时我正在制定下半年的策略，那是 Opus 4 结合了我们先进的研究成果的第一次应用。它运行了一会儿，回来后的反馈让我觉得，你真的从一个新的角度去审视了它。所以这可能是我最大的转变，我不确定“独立性”这个词是否准确，但相对于我的思维方式，它展现出了创造性和思维的新颖性。\n\n(00:06:31):\n关于时间线，这一点很有趣，因为我昨天坐在 Dario 旁边，他说：“我一直在做这些预测，人们一直在笑话我。然后这些预测就成真了。”看着这种情况一次又一次发生很有趣，他说：“并不是所有的预测都会准。”但我记得大概去年这个时候，他说我们在 SWE-Bench（一个衡量模型编码能力的基准测试）上大概是 50%。他说：“我觉得到 2025 年底我们会达到 90%。”果然，有了新模型，我们现在大约在 72%，而他做预测时只有 50%。它的扩展速度几乎和预测的一模一样。所以我现在对这些时间线更加认真了。我不知道你有没有读过《AI 2027》...\n\nLenny Rachitsky (00:07:05):\n我看过，它让我心跳加速。\n\nMike Krieger (00:07:09):\n我有过一次非常离奇的经历，当时我打开了两个标签页，一个是《AI 2027》，另一个是我的产品策略。那一刻我突然觉得：“等等，难道我就是这个故事里的角色吗？这融合得也太紧密了吧？”但是当你读到那个，你会觉得“哦，2027 年，那是好几年后的事了”，如果你觉得是“不，其实是 2025 年中期”。随着事情不断改进，模型能做的越来越多，它们能够表现出 Agentic（代理）能力，拥有记忆，并且能够在一段时间内持续行动。所以我对时间线的信心——虽然我不知道它们确切会如何显现——但在过去的一年里绝对是更加坚定了。\n\nLenny Rachitsky (00:07:43):\n哇。我没想到会聊到这，那篇论文真的很吓人。我很好奇，我忍不住想问，我们要如何避免那篇论文所描绘的 AI 变得极其聪明后的可怕场景？\n\nMike Krieger (00:07:59):\n是啊，这也许跟我在这待了一年，当初为什么加入 Anthropic 有关。我看着模型变得越来越好，甚至在 2024 年初就能看出来，看着我的孩子们，我想：“好吧，他们将在一个有 AI 的世界里长大。这是不可避免的。”我可以把时间最大程度地投入到哪里，去推动事情向好的方向发展呢？这也是整个行业，尤其是 Anthropic 的很多人都在思考的问题。\n\nMike Krieger:\n所以我认为，大家需要达成共识，建立一个共同的框架，去理解所谓的“良性发展”到底长什么样？我们想要的人与 AI 的关系究竟是什么样的？\n\n(00:08:36):\n在这个过程中我们如何衡量？我们需要构建、开发和研究什么？我认为这些都是关键问题。其中有些是产品问题，有些是研究和可解释性（interpretability）方面的问题。但对我来说，这也是我加入的最强动力：我认为 Anthropic 能够做出很大贡献，推动事物向更好的方向发展。如果我能在其中发挥作用，那就干吧。\n\nLenny Rachitsky (00:09:00):\n我很喜欢这个回答。说到孩子，你有两个孩子，我的小孩也快两岁了。我很好奇，随着 AI 越来越占据我们的未来，某些工作将会发生改变，你会鼓励你的孩子们去培养什么样的技能？你有什么建议吗？\n\nMike Krieger (00:09:18):\n我们每天早上都会和孩子们一起吃早餐，有时候会冒出一些问题，比如关于物理的。我家老大快六岁了，他们会用六岁孩子的方式问一些关于太阳系或者物理的有趣问题。以前我的第一反应是直接找 Claude，心想“哦，我想看看 Claude 怎么回答这个问题”。但后来我们开始改变思路，“好吧，我们要怎么找出答案呢？”答案不能仅仅是“问问 Claude 就行了”。我们可以做个实验，可以观察这个东西。所以我认为，培养好奇心，以及保持一种——我也说不好，“科学探索过程”对于教导六岁孩子来说可能听起来太宏大了——但那种发现、提问、然后系统性地寻找答案的过程，我认为仍然非常重要。当然，AI 会是一个极好的工具，能帮助解决其中很大一部分问题，但这种探究的过程和独立思考的能力，我认为依然至关重要。\n\n(00:10:11):\n我最喜欢的一个时刻是跟我那个非常有主见的大女儿发生的。她说了一件事，我不确定是不是真的。大概是关于珊瑚是动物还是珊瑚是不是活的之类的问题，具体细节我记不清了。当时我说：“我不确定这是不是真的。”她说：“这绝对是真的，爸爸。”我说：“好吧，这回我们问问 Claude。”她说：“你可以问 Claude，但我知道我是对的。”我心想，我太喜欢这个劲儿了。我不希望那种把所有认知都外包给 AI 的状态，因为 AI 并不总是对的。而且那样做某种程度上会阻断任何形式的独立思考。所以，提问、探究和独立思考的技能，我认为这些都是关键。至于从工作或职业角度来看这意味着什么，我持开放态度，毕竟从现在到那时候，世界肯定会发生翻天覆地的变化。\n\nLenny Rachitsky (00:11:02):\n很有意思。Shopify 的 CEO Tobias Lütke 来播客时，对于鼓励孩子培养什么能力，他也给出了同样的答案：好奇心。这竟然成了一个共同点，真有趣。\n\nMike Krieger (00:11:14):\n我孩子上的 K-8 学校请了一位 AI 和教育专家来讲座，我原本对这场谈话的预期很低，或者说门槛放得很低。实际上，我觉得那次讲座可能超出了台下大多数人的理解范围，因为他一上来就说：“好吧，让我们回溯到 Claude Shannon 和信息论。”我能看到大家眼神里写着：“我为什么要来听这个？为什么我在学校礼堂里听信息论？”但他其实讲得很好，他设想未来会有完全不同的工作，而我们现在还不知道那些工作是什么。所以关键在于掌握技能、方法，并对我们如何重新组合这些事物保持开放的心态。即便如此，从现在到他们 18 岁，这些东西可能还会变个三次。\n\nLenny Rachitsky (00:11:59):\n既然我们谈到了时间线和变化，我看到你和 Anthropic 其他人分享过一些数据，关于现在有多少代码是由 AI 编写的。有人分享的数据是 70% 到 90%。有一位工程负责人说你们大约 90% 的代码现在是由 AI 写的，首先这简直太疯狂了，短短几年就从零到了 90%。我觉得大家对这个讨论得还不够多。这太狂野了。你们基本上处于最前沿（bleeding edge）。我从来没听说过哪家公司的 AI 代码撰写比例能达到这么高。\n\n(00:12:34):\n这就意味着你们处于未来发展趋势的最前沿。我想大多数公司最终都会走到这一步。既然知道现在这么多代码都是 AI 写的，产品开发流程发生了什么变化？通常流程是 PM 说“这是我们要做的”，工程师去写，然后发布。现在还是大概这样吗？还是说 PM 直接找 Claude 说“帮我做这个”，而工程师在做别的事情？在一个 90% 代码由 AI 编写的世界里，情况有什么不同？\n\nMike Krieger (00:12:57):\n是的，这很有趣，因为我认为工程的角色已经改变了很多，但聚在一起做产品的团队构成还没有变。在很多方面这其实不太好，因为我们仍然抱着一些旧的假设。所以我认为角色依然比较相似，尽管我现在最喜欢看到的情况是，一些优秀的 PM 或设计师，当他们有一个想法想要表达时，会使用 Claude 甚至 Artifacts 来做出一个真正可运行的 Demo。这非常有帮助。这就变成了“不不，这就是我的意思”，让想法变得具体可感。这可能是最大的角色转变：通过这种“代码+设计”的方式，原型制作（prototyping）在流程中发生得更早了。但我学到的是，知道该问 AI 什么、如何组织问题、以及如何思考后端和前端之间的结构变化，\n\n(00:13:54):\n这些仍然是非常困难和专业的技能，依然需要工程师来思考。而且我们很快就在其他事情上遇到了瓶颈，比如我们的合并队列（merge queue）——就是你的代码变更排队等待系统接受并部署到生产环境的地方。我们需要彻底重新架构它，因为代码编写量大增，提交的 Pull Request (PR) 也多得多，完全超出了原本的预期。不知道你有没有读过那本经典的流程优化书籍《目标》（The Goal），你会意识到有个关键路径理论。我在我们的系统中发现了所有这些新的瓶颈，有一个上游瓶颈，就是决策和对齐。我现在思考很多的是，我如何提供“最小可行策略”（minimum viable strategy），让人们感到被授权去奔跑、去敲代码、去构建、去在模型能力的最前沿进行探索。\n\n(00:14:44):\n我觉得我还没完全搞定这一点，但我正在努力。然后一旦开始构建，其他的瓶颈又出现了，比如我们要确保大家不互相干扰。我们要提前想清楚所有的边缘情况（edge cases），这样才不会在工程侧受阻。然后当工作完成准备发布时，那些瓶颈又是什么？我们需要做落地变更的“空中交通管制”。我们要如何确定大战略？我觉得直到今年之前，改变这些流程的压力还没那么大，但我预计一年后，我们构思构建和发布软件的方式会发生巨大变化，因为按现在的方式做会非常痛苦。\n\nLenny Rachitsky (00:15:20):\n哇，这太有意思了。以前是有一个想法，然后去设计、构建、发布、合并，再上线。通常瓶颈在于工程，需要时间去构建，然后才是设计。现在你说你发现的两个瓶颈是：第一，决定做什么以及让大家达成一致；第二，实际上是合并到生产环境的队列。我想代码审查（Code Review）可能也是其中一部分……\n\nMike Krieger (00:15:47):\n代码审查确实也发生了很大变化。在很多方面可能并不令人惊讶，工作方式最具未来感的团队是 Claude Code 团队，因为他们在用一种非常“自我改进”的方式使用 Claude Code 来构建 Claude Code。在这个项目早期，他们会像做其他项目一样，逐行进行 Pull Request 审查。但他们后来意识到，Claude 通常是对的，而且它生成的 PR 可能太大了，大多数人很难审查。所以，能不能用另一个 Claude 来审查它？然后人类更多地是做验收测试，而不是试图逐行审查。这肯定有利有弊，到目前为止进展顺利。但我也可以想象如果这就此失控，可能会导致代码库完全无法维护，或者连 Claude 都无法理解。这种情况还没发生，但看着他们改变审查流程确实很有趣。\n\n(00:16:38):\n是的，合并队列只是下游瓶颈的一个例子，还有其他的瓶颈，比如我们如何确保我们构建的东西依然是连贯的？如何把它打包成一个我们可以与人们分享的时刻？不管是围绕一个发布时刻，还是让人们能够使用这个东西并讨论它。那些经典的事情——构建对人们有用的东西，让大家知道你构建了它，然后从他们的反馈中学习——依然存在。\n\n我们只是让整个流程中的一部分变得更加高效了。\n\n**Lenny Rachitsky (00:17:06):**\n我听说你形容你们自己是这种工作方式的“零号病人”。\n\n**Mike Krieger (00:17:11):**\n是的。\n\n**Lenny Rachitsky (00:17:12):**\n我喜欢这个说法。你大概知道 Claude Code 有多少比例的代码是由 Claude Code 自己写的吗？\n\n**Mike Krieger (00:17:17):**\n到目前为止，如果这个比例低于 95% 我会很惊讶。不过我得去问问 Boris 和那边的其他技术负责人。但很酷的一点是——讲点技术细节——Claude Code 是用 TypeScript 写的。实际上它是我们最大的 TypeScript 项目。Anthropic 的其他大部分项目是用 Python 写的，现在还有一些 Go 和 Rust，但我们并不是一家主打 TypeScript 的公司。所以昨天我在 Slack 上看到一条很棒的评论，有人遇到一个让他抓狂的 Claude Code 问题，然后他说：“好吧，我完全不懂 TypeScript，我就直接跟 Claude 说一下，让它来搞定。”\n\n(00:17:49):\n然后他们从那一步到提交 Pull Request (PR) 只花了一个小时，解决了问题并提交了代码。这真的打破了壁垒。第一，它改变了任何项目新手的准入门槛。我觉得这也能让你为特定的任务选择最合适的语言。我认为这很有帮助，但这同时也进一步强化了 Claude Code 作为那个“Alpha 实验对象”的角色，即团队外部的贡献也可以通过 Claude 编写代码来实现。\n\n**Lenny Rachitsky (00:18:18):**\n哇，这真的不断刷新我的认知，你分享的这些东西太惊人了，Claude Code 大概 95% 的代码都是由 Claude Code 自己写的。\n\n**Mike Krieger (00:18:27):**\n这是我的猜测。是的，之后我会去确认真实数据。但如果你问团队，他们确实就是这么工作的，这也是他们从全公司获得贡献的方式。\n\n**Lenny Rachitsky (00:18:35):**\n这很有趣，回到你之前提到的观点，即战略制定也由 Claude 辅助，还有你提到的现在的瓶颈主要在于漏斗顶部，即构思创意和对齐所有人。有趣的是，Claude 已经在帮助解决“决定构建什么”这个问题了。所以如果这两个瓶颈——对齐决定构建什么，以及后面的代码合并与交付——都在被解决，你觉得在加速这些事情上，哪里会发生最有趣的变化？\n\n**Mike Krieger (00:19:02):**\n对，关于第一点，我年初写了一篇文档，主要讲我们今天是如何做产品的，以及在哪些应该出现 Claude 的地方它还没有出现？我认为上游部分是下一个要攻克的领域。很有意思，在你的峰会上，我和一个正在做 PRD 工具的人聊过，类似 GPT 风格的 ChatPRD，我想是叫——\n\n**Lenny Rachitsky (00:19:24):**\nChatPRD，[听不清]。\n\n**Mike Krieger (00:19:24):**\n对。Claude 能不能成为决定“构建什么”的合作伙伴？比如如果从这个角度切入，计算市场规模是多少？或者换个角度看，用户需求是什么？我们在 Anthropic 经常思考“虚拟协作者”这个概念，其中一种表现形式可能是：“嘿，我在 Anthropic 的 Discord 里，我在用户论坛里，我在 X (Twitter) 上读帖子，这是目前涌现出来的问题。”这是第一步。现在的模型已经能做到了。第二步——现在的模型可能也能做，只是需要把它们连接起来——是不仅仅提出问题，还要说：“这是我认为你可以解决它们的方法。”\n\n(00:20:13):\n然后更进一步：“我已经创建了一个 Pull Request 来解决我看到的这个问题。”这感觉是今年非常有希望实现的目标。这就是为什么 MCP (Model Context Protocol) 让我感到兴奋。我们目前的限制主要在于确保上下文能在整个流程中顺畅流转，确保我们有正确的访问权限，而不是受限于模型的推理或提议能力。当然，模型的 UI 审美可能还不够完美，所以肯定还需要设计的介入，设计师可能会说：“哦，我不会那样解决这个显示问题。”但我会对此非常兴奋。\n\n举个很小的例子，我们在 Claude AI 上做了个改动。以前你应该可以直接从 Artifacts 复制 Markdown 或代码，我们把它改成了下载和导出。我们把按钮改成了导出，结果收到一堆反馈问：“现在怎么复制？”答案是你得点开下拉菜单才能复制。\n\n(00:20:51):\n这真是那种虽然逻辑上讲得通，但我们可能没做对的事情之一。这些反馈出现在 RUX 频道里。我多希望一小时后能有一个 Agent 说：“嘿，如果我们想改回去，这是做好的 PR。”顺便说一句，最终它还会说：“我要启动一个 A/B Test 看看这是否会影响指标，一周后再看结果。”如果你是一年半前跟我说这个，我会说：“啊，那可能是 2027 或 2026 年的事了。”但现在感觉这真的触手可及。\n\n**Lenny Rachitsky (00:21:20):**\n哇，好的。你提到了 Lenny and Friends Summit。我想聊聊这个。你当时和 OpenAI 的 CPO Kevin Weil 在一个圆桌论坛上，我想那是你们第一次这样做，也许目前也是最后一次。\n\n**Mike Krieger (00:21:32):**\n是啊，那之后我们就没再做过了，没有什么特别的原因。但我玩得很开心。\n\n**Lenny Rachitsky (00:21:34):**\n我们当时组建的那个由 Sarah Guo 主持的圆桌阵容真是传奇。你当时发表了一个评论，后来成了那次访谈重播率最高的部分，就是说你把产品人员放到模型团队里，和研究人员一起工作，让模型变得更好；同时也把一些产品人员放在产品体验端，让 UX 更直观。你发现几乎所有的杠杆效应（leverage）都来自于产品团队与研究人员的合作。所以你们一直在做更多这样的尝试。首先，这仍然是真的吗？其次，这对产品团队意味着什么？\n\n**Mike Krieger (00:22:11):**\n这仍然是真的。事实上，如果当时的比例就已经倾向于这种嵌入式合作，我现在变得越来越确信这一点。我在峰会期间还没那么强烈的感觉，现在我对此深信不疑。如果我们发布的东西是任何人只要拿现成的模型就能做出来的——顺便说一句，直接用我们的模型也能做出很棒的东西，别误会我的意思——但我们应该涉足的领域，以及我们能做的独特之处，应该是那些真正处于两者神奇交汇点的事情，对吧？\n\n(00:22:42):\nArtifacts 就是一个很好的例子。如果你在 Claude 4 上使用 Artifacts，这实际上是一个非常有趣的例子，我们从“Claude 编码技能”团队（这是一个真正致力于后训练 Post-training 以教授 Claude 特定技能的团队）调了人，让他们与一些产品人员配对，然后一起彻底改进了它在产品中的呈现方式，以及 Claude 能做到的事情，这比“哦，我们只是用了模型然后稍微写了点提示词”要好得多。\n\n(00:23:07):\n光那样是不够的。我们需要参与到微调（Fine-tuning）的过程中去。如果你看看我们现在正在做的事情，我们最近在研究和其他方面发布的东西，Anthropic 的基本工作单元不再是“拿模型，然后去和设计、产品合作发布产品”。它更像是我们参与到关于这些功能应该如何运作的后训练（Post-training）讨论中，然后在构建过程中，我们将这些反馈循环回去。\n\n(00:23:36):\n我认为这很令人兴奋。这也是一种并非所有 PM 都能掌握的新工作方式，但在内部获得研究和工程部门最积极反馈的 PM，都是那些明白这一点的。我昨天参加了一个产品评审，我说：“哦，如果我们想做这个记忆功能，我们应该跟研究人员聊聊，因为我们刚在 Claude 4 里发布了一堆记忆能力。”他们回答说：“是的，是的，我们已经跟他们聊了好几周了，这就是我们具体实现的方式。”我想：“好，感觉不错。我觉得我们要走上正轨了。”\n\n**Lenny Rachitsky (00:24:03):**\n让我再深入挖掘一下这一点，这也正是我一直思考的问题。基本上 Anthropic 有很大一部分人在构建这个超级智能的“超级大脑”，以后它能帮我们做所有这些事情。然后，正如你所说，产品团队围绕这个超级大脑构建 UX，而随着时间的推移，这个超级智能将能够构建自己的东西。所以我很想知道，你认为随着时间推移，传统产品团队最大的价值将来自哪里？我知道这情况比较特殊，因为你们是一家基础模型（Foundational LLM）公司，大多数公司不是这样运作的，但我还是想听听你的想法，关于在 AI 领域工作的产品团队未来的价值点在哪里。\n\n**Mike Krieger (00:24:42):**\n我认为在两件事上仍然有巨大价值。第一是让这一切变得可理解（Comprehensible）。我觉得我们做得还行，但在让技术变得易懂这方面我们还可以做得更好。那些在工作中能熟练使用这些工具的人和大多数人之间的差距仍然是巨大的。这也许是对你之前关于“该学习什么技能”那个问题的最直接回答。这是一种需要学习和使用的技能，就像我记得中学时上的计算机课一样。\n\n以下是播客内容的中文翻译：\n\n**Mike Krieger:**\n我记得当年我很擅长用 Google，这在当时其实真的是一种技能——具备那种“信息就在那里，我该怎么查询？我该怎么做？”的思维方式。我觉得这在当时确实是个优势。\n\n(00:25:21)\n当然现在 Google 已经很聪明了，只要你在大概的范围内，它就能猜到你想做什么，那种“搜索研究”的需求变少了。但我认为这仍然是优秀产品开发中不可或缺的一部分，也就是说能力就在那里，即使 Claude 能从头构建产品，你要构建什么？你如何让它变得**易于理解（Comprehensible）**？这依然很难，因为这触及到更深层的同理心以及对人类需求和心理学的理解。我以前主修人机交互（HCI），我这里可能又是三句话不离本行了。但我依然觉得这是一个非常、非常、非常必要的技能。这是第一点。\n\n第二点是，这正好呼应了你另一位嘉宾的观点——**Strategy（战略）**。我们要如何赢？我们在哪里竞争？搞清楚在一堆你可以投入时间、Token 或算力的事情中，你到底想把精力花在哪里，真正去做什么。\n\n(00:26:15)\n你现在的涉猎范围可能比以前更广，但你不能什么都做。而且从外部视角来看，如果你看起来什么都做，你的定位就非常模糊了。所以我认为 Strategy 依然是第二块拼图。\n\n第三点是让人眼界大开，看到什么是可能的，这也是“让事物易于理解”的延续。最近我们在跟一家金融服务公司做 Demo，展示如何结合使用我们的分析工具和 MCP，你可以看到他们的眼睛亮了，那种“啊，原来如此”的感觉。我们称之为 **Overhang（潜能落差）**。这就是模型和产品能做到的事情，与人们日常实际使用方式之间的巨大差距（Delta）。巨大的 Overhang。所以这依然是 Product 发挥非常非常重要且必要作用的地方。\n\n**Lenny Rachitsky (00:26:59):**\n好的，这个回答太棒了。所以本质上，产品团队需要更多投入的领域是 Strategy——也就是不断精进战略，弄清楚构建什么以及如何在市场中获胜；让人们更容易理解如何利用这些工具的力量——即 Comprehensibility（可理解性）；以及沿着这条思路，让人看到这类事物的潜力，让人眼界大开。这就是 Product 依然能提供帮助的地方。\n\n**Mike Krieger (00:27:21):**\n没错。\n\n**Lenny Rachitsky (00:27:22):**\n太棒了。顺着这个话题，你有没有什么给普通人的 Prompting（提示词）技巧？就是你在和 Claude 聊天时学到的，能让它发挥更大作用的方法？\n\n**Mike Krieger (00:27:30):**\n这有时候挺有意思的，因为从某种程度上说，我们拥有终极的 Prompting 工作，就是给 Claude AI 编写 **System Prompt（系统提示词）**，而且我们会公开这些内容，我觉得这也是一种很好的透明度体现。我们在给 Prompting 建议时总是很谨慎，至少在官方层面上是这样，但我可以给你个非官方版本的建议。因为你不希望事情变成那种“我们觉得这样有用，但不知道为什么”的玄学。\n\n但我会做一些小动作，比如在 Claude Code 里（我们确实会对这个做出非常字面意义的反应），如果我想让它进行更多推理，我会直接让它“think hard（努力思考）”，它就会采用不同的流程，我通常会从这个开始。\n\n还有就是“助推（Nudging）”，有一篇很棒的文章叫《犯对方会犯的错》（make the other mistake），意思是如果你倾向于太客气，你能不能试着专注于……即使你试图变得更批判或更直率，你可能也不会是世界上最批判、最直率的人。\n\n(00:28:18)\n所以对于 Claude，有时我会说：“Be brutal, Claude, roast me（残忍点，Claude，吐槽我）。告诉我这个策略有什么问题。”我知道我们早些时候聊过把 Claude 当作思维伙伴来评判产品策略。以前我可能会问：“这个产品策略还有什么可以改进的？”现在我直接说：“尽情吐槽这个产品策略。” Claude 本质上是个挺“好人”的实体，很难逼它变得超级残忍，但这样确实能强迫它变得更具批判性一点。\n\n最后我要说的是，我们有个叫 Applied AI 的团队，专门帮助客户针对他们的用例优化 Claude。我们基本上把他们的洞察和工作方式做成了产品本身。如果你去我们的 Console，我们的 Workbench，那里有个叫“Prompt Improver（提示词改进器）”的东西。你描述问题，给它例子，Claude 自己会以 Agentic（代理）的方式为你创建并迭代 Prompt。\n\n(00:29:09)\n我发现这就出来的结果往往跟我直觉认为的好 Prompt 大相径庭。所以我鼓励大家去试试这个，哪怕是为了自己的用例。虽说这个工具本来是给要把 Prompt 放进产品的 API 开发者用的，但它同样适用于为自己写 Prompt 的个人用户。它会插入 **XML tags**，这是人类很难提前想到的。这对帮助 Claude 理解它应该“想什么”与应该“说什么”非常有帮助。所以这是另一个建议：关注我们的 Prompt Improver，并且记住，Claude 本身就是一个非常优秀的 Claude Prompter。\n\n**Lenny Rachitsky (00:29:41):**\n很棒。好的，我们会把那个链接放上去，就是那个 Prompt Improver。你刚才分享的核心建议其实就是做跟你本能相反的事。如果你想客气点，那就变得残忍点，对我非常诚实和坦率。\n\n**Mike Krieger (00:29:53):**\n没错。我发现这招很管用。比如问它：“我陷入了哪些思维定势是你想要帮我打破的？”\n\n**Lenny Rachitsky (00:29:59):**\n我看到你们就在今天好像发布了一个跟 Rick Rubin 的合作，上面写着“Vibe coding”。那是怎么回事？\n\n**Mike Krieger (00:30:06):**\n我也听说了这个。这一周我们要搞模型发布、开发者活动，还有“The Way of Code”，好多事都凑到一起了。我们的联合创始人之一 Jack Clark 是我们的政策负责人，他和 Rick Rubin 搭上了线，因为我觉得他一直在思考 Coding、Coding 的未来以及创造力，他们一直保持着联系。\n\nRick 对用 Claude 创造艺术和视觉效果的想法很兴奋，然后他就有了关于“Vibe Coder 之道”的想法。他们就搞出了这个，真的，我超爱 Rick Rubin 做的几乎所有东西。那种美学真的太到位了。但这更像是一种——“冥想”可能是个准确的词——一种关于创造力、与 AI 协同工作的冥想，配上非常丰富有趣的视觉效果。这属于那种内部有人说：“哦对了，我们要跟 Rick Rubin 搞个合作。”然后我们会惊呼：“咱们要干嘛？这也太酷了吧。”\n\n**Lenny Rachitsky (00:31:03):**\n我简单看了一眼，有个梗图是他正在深度思考，坐在一台有嘴巴的电脑前。\n\n**Mike Krieger (00:31:09):**\n对。\n\n**Lenny Rachitsky (00:31:10):**\n好像是 ASCII 艺术风格的。\n\n**Mike Krieger (00:31:11):**\n完全是，就是那种 ASCII 艺术的 Vibe（氛围）。\n\n**Lenny Rachitsky (00:31:14):**\n我很高兴今天请到了 Andrew Luo。Andrew 是 OneSchema 的 CEO，也是我们要这一档播客的长期赞助商之一。欢迎 Andrew。\n\n**Speaker 3 (Andrew Luo) (00:31:21):**\n谢谢邀请，Lenny。很高兴来到这里。\n\n**Lenny Rachitsky (00:31:23):**\nOneSchema 最近有什么新动态？我知道你们和一些我最喜欢的公司合作，比如 Ramp、Vanta 和 Watershed。我听说你们推出了一个新的数据摄入产品，可以自动化处理团队在导入、映射和整合 CSV 及 Excel 文件时花费的数小时手动工作。\n\n**Speaker 3 (Andrew Luo) (00:31:39):**\n是的，我们刚刚推出了 OneSchema FileFeeds 2.0。我们利用 AI 从头彻底重构了它。我们看到太多客户带着数据工程师团队来找我们，他们为了清理混乱的电子表格而被繁琐的手工活折磨得够呛。FileFeeds 2.0 允许非技术团队只需一个简单的 Prompt 就能自动化处理 CSV 和 Excel 文件的转换过程。我们支持所有最棘手的文件集成方式，SFTP、S3，甚至电子邮件。\n\n**Lenny Rachitsky (00:32:05):**\n我可以告诉你，如果我的团队得去构建这样的集成，能把这种活儿从我们的 **Roadmap（路线图）** 上拿掉，改用 OneSchema 这样的工具，那该多好啊。\n\n**Speaker 3 (Andrew Luo) (00:32:13):**\n绝对是这样，Lenny。我们听过太多恐怖故事了，哪怕交易记录、员工档案、采购订单里只有一条坏数据，都可能导致宕机。调试这些问题通常就像大海捞针。OneSchema 会阻止任何坏数据进入你的系统，并自动验证你的文件，生成包含所有坏文件中具体问题的错误报告。\n\n**Lenny Rachitsky (00:32:34):**\n我知道导入错误数据会给客户带来各种痛苦，并让你迅速失去他们的信任。Andrew，非常感谢你的加入。如果你想了解更多，请访问 oneschema.co。是 oneschema.co。\n\n(00:32:48)\n其实说回到你在 Anthropic 的旅程起点，你被招进 Anthropic 的故事是怎样的？有什么趣事吗？\n\n**Mike Krieger (00:32:55):**\n这一切始于……我还给我朋友发了条短信。Joel Lewenstein，我认识他很久了，我们在 2007 年 App Store 刚出的时候一起开发了我们的第一个 iPhone App，那时候在 App Store 卖一美元的应用还能赚到钱。我们当时都在 Stanford，是朋友，这些年一直保持联系，但那之后再也没机会一起工作过。我们只是保持着亲密关系。当时我刚结束 Artifact 的经历，正在思考：我要再创办一家公司吗？我觉得不要。我需要从那种从零开始的状态中休息一下。我去打工吗？不知道，我想去什么样的公司工作呢？\n\nAnd he reached out and he's like, \"Look, I don't know if you at all considered joining something rather than starting something, but we're looking for a CPO. Would you be interested in chatting?\"\n他当时联系我说：“Look，我不确定你有没有考虑过去别家公司任职而不是自己创业，但我们正在找一位 CPO。你有兴趣聊聊吗？”\n\n(00:33:37):\nAnd at that time, Claude 3 had just come out and I was like, \"Okay, this company's clearly got a good research team. The product is so early still.\" And it was like, \"Great, I'll take the meeting.\" And I first met with Daniela, was one of the co-founders and the president in Anthropic. And just from the beginning I was like a breath of fresh air, very little grandiosity coming off the founders, I mean they're clear-eyed about what they're building. They know what they don't know. How many times I talk to Dario always like Dario is like, \"Look, I don't know anything about product, but here's an intuition.\" Usually the intuition is really good and leads to some good conversation, but I think that intellectual honesty and shared view of what it means to do AI in a responsible way, it just resonated.\n那时候，Claude 3 刚刚发布，我当时想：“行，这家公司显然拥有一支优秀的研究团队，但产品还处于非常早期的阶段。”于是我说：“好啊，我想见个面。”我首先见到了 Daniela，她是 Anthropic 的联合创始人兼总裁。从一开始接触，我就觉得他们简直是一股清流，创始人身上几乎没有那种浮夸的架子。我的意思是，他们对自己正在构建的东西看得非常清楚。他们知道自己有什么不知道的。我和 Dario 聊过很多次，他总是说：“Look，我对产品一窍不通，但我有个直觉……”通常他的直觉非常准，能引发很棒的对话。但我认为，那种理智上的诚实（intellectual honesty），以及对于“以负责任的方式做 AI 意味着什么”的共同愿景，真的让我产生了共鸣。\n\n(00:34:22):\nI kept having this feeling in these interviews, this is the AI company I would've hoped to have found it if I had founded an AI company. And that's kind of the bar around if I'm going to join something that should be where I'm going to go. But what I realized, I actually hadn't joined a company since my first internship in college basically. And I was like, \"Oh, how do I onboard myself? How do I get myself up to speed? How do I balance making sweeping changes versus understanding what's not broken about it overall?\" And looking back on a year, I think I made some changes too slowly. I think there was ways reorganizing product that I could have made a change earlier. And I think I didn't appreciate how much a couple of really key senior people can shape so much of product strategy.\n在面试过程中，我一直有种感觉：如果我要创办一家 AI 公司，这就是我希望做成的那家 AI 公司。这也成了一个标准：如果我要加入某家公司，那它必须得是我自己创业想要达到的高度。但我后来意识到，实际上除了大学时的第一次实习，我基本上没“加入”过别人的公司。所以我当时想：“噢，我该怎么做入职（onboard）？怎么让自己迅速上手？如何在‘大刀阔斧的改革’与‘理解现有良好运作机制’之间找到平衡？”回顾这一年，我觉得有些改变我做得太慢了。我觉得在产品团队重组方面，我本可以更早采取行动。而且我也曾低估了一两个关键的资深人士（senior people）对产品战略有多大的塑造力。\n\n(00:35:10):\nI'll harken back to Claude Code. Claude Code happened because Boris, who actually was a Boris Cherney, he was an Instagram engineer and one of our senior ICs there, we overlapped a bit, was started that project from scratch internal first and then we got it out and then shipped it. And that's the power of one or two really strong people. And I made this mistake, we need more headcount and we do, I think there's more work that we need to do and there's things that I want to be building. But more than that we need a couple of almost founder type engineers that maybe connect back to our question on what skills are useful and how does product development change. And maybe even more so I'm a huge believer in the founding engineer tech lead with an idea and pair them with the right design and product supports, help them realize that, I'm 10 times more a believer in that than before.\n我要提一下 Claude Code。它的诞生是因为 Boris，也就是 Boris Cherney，他以前是 Instagram 的工程师，也是我们在那里的一位资深 IC（独立贡献者），我们有过一些交集。他在内部从零开始启动了这个项目，然后我们把它推向了外部并发布了。这就是一两个真正强力的人所能带来的力量。我之前犯了个错误，觉得我们需要更多的 headcount（人手），确实我们也需要，因为还有很多工作要做，很多东西要建。但比这更重要的是，我们需要几个近乎“创始人类型”的工程师。这可能回到了我们关于“哪些技能有用”以及“产品开发如何变化”的问题。也许更进一步说，我是“创始工程师/Tech Lead 带着想法，再搭配合适的设计和产品支持”这种模式的超级信徒。相比以前，我现在对这种模式的信任度提高了 10 倍。\n\nLenny Rachitsky (00:36:01):\nI actually asked people on Twitter what to ask you ahead of this conversation. And the most common question surprisingly was why did you shut down Artifact? And I also wondered that because I loved Artifact. I was a power user. I was just like, \"Finally a news app that I love that it's giving me what I want to know.\" So I guess just what happened there at the end?\n在这次谈话前，我在 Twitter 上征集了大家想问你的问题。令人惊讶的是，最常见的问题是：为什么你关闭了 Artifact？我也很想知道，因为我很爱 Artifact。我是它的重度用户（power user）。我当时的感觉就是：“终于有一款我也很喜欢、能给我想要内容的新闻 App 了。”所以我想问，最后到底发生了什么？\n\nMike Krieger (00:36:20):\nI still really miss it too. I didn't find a replacement and I think I substituted it by visiting individual sites and keeping things up that way. And it's not really the same, especially on the log to I think we got right with Artifact and if people didn't play with it before, it was we really tried to not just recommend top stories, they were part of it. But really if you were interested in Japanese architecture, you could pretty reliably get really interesting stories about Japanese architecture every day. Whether that's from a Dwell or from Architectural Digest or from a really specific blog that we found that somebody recommended to us. It captured some of that Google reader joy of content discovery of the deeper web. Our headwinds were a couple. One of them was just mobile websites have really taken a turn. I don't blame any individuals for this.\n我其实也非常想念它。我还没找到替代品，我现在只能通过访问一个个单独的网站来维持阅读习惯，但这感觉完全不一样。我觉得我们在 Artifact 上做对了一些事情——如果大家没用过的话——我们真的努力做到不仅仅推荐热门头条（虽然那也是一部分）。而是如果你对日本建筑感兴趣，你可以非常可靠地每天获得关于日本建筑的有趣故事。无论它是来自 Dwell、Architectural Digest，还是我们发现的某个被推荐的小众博客。它捕捉到了当年 Google Reader 那种在更深层的网络中发现内容的乐趣。我们面临的阻力有几个。其中之一就是移动端网页（mobile websites）发生了巨大的转变。我不怪任何人。\n\n(00:37:10):\nI think it's the market dynamics of it, but we put so much time or designers, sky Gunner Gray who's phenomenal that for Perplexity now, the app experience I was so proud of, but when you click through it was like the pressures on these mobile sites and these mobile publishers would be like, \"Sign up for our newsletter. Here's a full screen video ad.\" It was very jarring and we didn't feel like it ethically made sense for us to do a bunch of ad blocking because then you're like, \"Sure, you can deliver a nice experience for people, but that doesn't feel like it's playing fair with the publishers.\" But at the same time, the actual experience wasn't good. So the mobile web deteriorating, which makes me very sad, but I think was part of it. Two was Instagram spread in the early days because people would take photos and then post them on other networks and tell friends about it.\n我觉得这是市场动态使然。但我们投入了大量精力，我们的设计师 Sky Gunner Gray 非常出色（他现在在 Perplexity），我为我们的 App 体验感到非常自豪。但是当你点击链接跳转出去时，你会感受到这些移动网站和移动出版商面临的压力，比如“注册我们的 newsletter”、“这里有个全屏视频广告”。这种体验非常突兀。我们觉得做大量的广告拦截在道德上说不通，因为你会觉得：“当然，你可以给用户提供好的体验，但这感觉对出版商不公平。”但与此同时，实际的阅读体验确实不好。所以移动端网页体验的恶化——这让我很难过——是原因之一。第二个原因是，Instagram 早期之所以能传播开，是因为人们会拍照，然后把照片发到其他网络上，并告诉朋友。\n\n(00:37:57):\nAnd there was this really natural like, \"How did you do that? I want to do it.\" News was very personal. I can't tell you how many people would be like, \"I love Artifact.\" I'm like, \"Did you tell anybody about it?\" And they're like, \"I told one person,\" and it didn't have that kind of spread. And any attempt that we had to do it felt kind of contrived, like, \"Oh, we'll wrap all the links in artifact.news.\" But we didn't want interstitial things. In some ways, this sounds very puritanical, I don't mean it to sound this way, but there were lines that we didn't want to cross that just felt ethically not us, that I've seen other news players do more of. And maybe if we had done that, it would've grown more, but I don't think that's the company we wanted to have built other way. I don't think we were the founders to have built it.\n当时有一种很自然的反应是：“你是怎么做出这种效果的？我也想做。”但新闻是非常个人化的。我有无数次遇到用户说：“我超爱 Artifact。”我就问：“你告诉别人了吗？”他们会说：“我告诉了一个人。”它不具备那种病毒式传播的属性。我们尝试做的任何强制传播都感觉很刻意（contrived），比如“哦，我们要把所有链接都包装在 artifact.news 的域名下”。但我们不想要那种插页式（interstitial）的东西。在某种程度上，这听起来可能有点“道德洁癖”（puritanical），我本意并非如此，但确实有些底线是我们不想跨越的，虽然我觉得在伦理上那不符合我们的风格，尽管我看到其他新闻类产品做了更多这类事情。也许如果我们那样做了，增长会更好，但我认为那不是我们想要建立的公司，甚至可以说，我们不是那种风格的创始人。\n\n(00:38:39):\nAnd the third one, which is an underappreciated one, is we started at mid-COVID, which meant that we were fully distributed and I think there were major shifts that we would've wanted to make both in the strategy and the product and the team. And it's really hard to do that if you are all fully remote. Nothing replaces the Instagram days of we went through some hard times like Ben Horowitz called the we're F'ed, it's over kind of moments. This is definitely type two fun. I wouldn't say that my favorite memories because they weren't happy ones, but memories I really stayed with me with Instagram was like me and Kevin at Taqueria, Cancun on Market Street eating burritos at literally 11:00 PM being like, \"How are we going to get out of this? How are we going to work through this?\" And Zoom is not a good replica for that.\n第三个原因，也是一个经常被低估的原因，是我们是在疫情中期起步的，这意味着我们是全员分布式办公。我认为当时我们在战略、产品和团队上都需要做一些重大的调整，如果是全员远程办公，这真的很难做到。没有什么能替代 Instagram 早期的那种日子——我们经历过一些艰难时刻，就像 Ben Horowitz 说的那种“我们完蛋了（we're F'ed），一切都结束了”的时刻。这绝对属于“第二类乐趣”（Type II Fun，过程痛苦但回忆起来有意思）。我不会说那是我最美好的回忆，因为当时并不快乐，但有些 Instagram 的记忆真的留存了下来，比如我和 Kevin 在 Market 街的 Taqueria Cancun，那是晚上 11 点，我们吃着墨西哥卷饼，讨论着：“我们该怎么走出这个困境？我们要怎么解决这个问题？”Zoom 视频会议完全无法复制那种感觉。\n\n(00:39:26):\nYou tend to let things go or things build up over time. So the confluence of those three things, we entered I guess 2024 and said, \"Look, there is a company to be built in the space. I'm not sure where the people would've built it. This concurrent incarnation we love, but it's not growing.\" The way I put it's like 10 units of input in for one unit of output versus the other way around. If we put blood and tears into the product and launch something we were proud of and metrics would barely move, the energy is not present in this product, in this system. And so are we going to expend another year or two and then go off and fundraise only to find that this is the case or do we call it and see that it's run its course and try to find a home for it, et cetera.\n在远程环境下，你倾向于让事情得过且过，或者问题会随着时间慢慢积累。所以这三个因素的结合，让我们进入 2024 年时对自己说：“Look，这个领域确实有一家大公司值得去建立。我不确定是谁会建成它。但我们当前的这个版本虽然我们很喜欢，却不再增长了。”我的形容是：这是“10 份投入换取 1 份产出”，而不是反过来。如果我们为产品投入了心血和眼泪，发布了我们引以为豪的东西，但指标几乎纹丝不动，那就说明这个产品、这个系统中不存在那种“势能”（energy）。那么，我们是要再消耗一两年，然后去融资，结果发现情况依然如此？还是我们应该叫停，承认它已经走到了尽头，并试着为它找个归宿等等？\n\n(00:40:06):\nSo that was the confluence on it and they started feeling this opportunity cost of AI is starting to change everything. We have an AI powered news app, but is this the maximal way in which we're going to be able to impact this? And it felt like the answer was increasingly no. But it was hard. I mean in the end I was really at peace of the decision, but it was a conversation that went on for a couple of months.\n这就是当时的综合考量。而且我们开始感觉到 AI 正在改变一切的机会成本。我们有一个 AI 驱动的新闻 App，但这是我们要产生影响力的最大化路径吗？感觉答案越来越倾向于“不”。但这很难。虽然最后我对这个决定感到很平静，但这确实是一个持续了几个月的讨论过程。\n\nLenny Rachitsky (00:40:26):\nOn that note, just how hard was it because because there's an ego component to it, like, \"Oh, I'm starting my new company, it's going to be great,\" and then you end up having to shut it down. Just how hard is that as a very successful previous founder shutting something down and then not working out?\n在这一点上，我想问这到底有多难？因为这里面有自尊心（ego）的成分，比如“噢，我在做新公司，它会很棒的”，结果最后你不得不关闭它。作为一个以前非常成功的创始人，面对这种不得不关闭公司、事情没做成的情况，到底有多艰难？\n\nMike Krieger (00:40:41):\nYeah, I mean I think when we started it, one of the conversations was like, \"Look, what is the bar to success here? And do we want it to be something other than Instagram DAU?\" Which is just an impossible bar. Only one company since, maybe two, you could say maybe ChatGPT and TikToK have reached that kind of mass consumer adoption starting a news app. Most people are not daily news readers even, right? And so we knew that we weren't pursuing that size of usage, at least with the first incarnation, but we did have an idea of building out complementary products over time that all use personalization and machine learning. We didn't even call it AI at the time. It was 2021 back-\n是的，我觉得当我们开始做的时候，我们就讨论过：“Look，这里的成功标准是什么？我们是否希望它达到 Instagram 那个级别的 DAU（日活跃用户）？”那简直是个不可能的标准。自那以后只有一家公司，也许两家——ChatGPT 和 TikTok——达到了那种大众消费级的普及度。做新闻 App，大多数人甚至都不是每日新闻读者，对吧？所以我们知道我们不是在追求那种规模的用户量，至少在第一阶段不是。但我们确实有一个构想，就是随着时间推移构建一系列互补的产品，全部基于个性化和机器学习（Machine Learning）。当时也就是 2021 年，我们甚至都没管它叫 AI。\n\nLenny Rachitsky (00:41:17):\nYeah, yeah, AI, it was called machine learning back then.\n对对，那时候 AI 还叫机器学习。\n\nMike Krieger (00:41:19):\nYeah, it was called machine learning still. And so in shutting it down, you know it when you see it in terms of user growth and traction. And I wasn't expecting Instagram growth, but I was expecting or hoping for or looking for something that felt like at its own legs under it and it could continue to compound. I was really positively surprised by how supportive people were when we announced it. There was a bit of like I told you so which sure anything launching you could be like, \"This is not going to work.\" And you're right, most of the time most things don't work. There was actually very little of that.\n对，那时候还叫机器学习。所以在关闭它这件事上，当你看到用户增长和牵引力（traction）的数据时，你心里就明白了。我不指望有 Instagram 那样的增长，但我期待、希望或者寻找的是某种感觉像是“它能靠自己站稳脚跟”并且能持续复利增长的状态。当我们宣布关闭时，大家的支持程度真的让我感到惊喜。当然也有一点“我早告诉过你”的声音，毕竟任何东西发布时你都可以说“这成不了”，而你通常是对的，因为绝大多数项目确实成不了。但实际上那种声音非常少。\n\n(Mike Krieger 继续上一段关于关闭 Artifact 的话题)\n\n**Mike Krieger:**\n这也是绝大多数人的反应，至少我这边收到的反馈，都是在称赞我们：当你意识到问题时就果断叫停，而不是在那儿死撑着拖延时间。\n\n从那以后，我也跟一些创始人聊过，他们会说：“是啊，我本来可能还会在这个项目上再耗个六个月，但看到你们的做法后，我意识到我们也搞错了方向，于是就做了决定。”我当时就觉得，“如果这样做能把大家解放出来，去从事更有趣的事情，那我觉得这对 Artifact 来说也是一种不错的精神遗产。”\n\n但说实话，自尊心肯定还是受了点打击。如果你是个体育迷，你可能会想：所谓的“你的水平取决于你上一场比赛的表现”，这是真的吗？还是说随着时间的推移会有更深层的东西？我这个人很好胜，但主要是跟自己较劲。所以我总是在寻找下一个我想去做的、有挑战性的事情。但不幸的是，这可能意味着大多数时候我都会对最近做的事情感到不满意，但希望最终这能带来好的成果。\n\n**Lenny Rachitsky:**\n是的，我觉得你之后的职业轨迹证明了，关掉正在做的项目其实也没什么大不了的。\n\n好，你提到了 ChatGPT，我想聊聊这个话题。这里发生了一些非常有意思的事情。一方面，你们在做 AI 领域最创新的工作。你们推出了 MCP，这简直是历史上增长最快的标准，大家都在采用。Claude 赋能并解锁了世界上增长最快的一批公司，比如 Cursor、Lovable 和 Bolt 等等。我请他们上过播客，他们都说：“当 Claude 3.5 Sonnet 出来的时候，感觉终于能让这一切跑通了。”\n\n但另一方面，感觉 ChatGPT 占据了消费者的心智。当人们想到 AI 时，尤其是在科技圈之外，脑子里蹦出来的就是 ChatGPT。所以我想问你，首先，你同意这个观点吗？其次，作为 AI 领域的挑战者品牌，这对你们思考产品战略和使命有什么影响？\n\n**Mike Krieger:**\n是的，如果你看大众的普及度，或者像 Jimmy Kimmel 街头采访那样随便问路人，让他们说出一个 AI 公司的名字，我打赌他们会说——其实我不确定他们能不能说出 OpenAI，他们可能会直接说 ChatGPT，因为这个品牌在那个领域也是领头羊。我觉得这就是现实。\n\n回顾这一年，我觉得有两件事是真的。第一，C 端（Consumer）的爆发式普及真的是可遇不可求的，我们在 Instagram 时就见证过。所以可能比任何人都更清楚，我可以对自己说：“看，我们会继续打造有趣的产品，其中一个可能会爆。”但如果把整个产品战略都建立在“试图押中那个爆款”上，可能并不明智。我们当然可以这么做，也许 Claude 能帮我们想出一堆点子，但在那期间我们可能会错失良机。\n\n相反，我觉得应该照照镜子，拥抱真实的自己和潜在的自己，而不是去模仿别人，这可能就是我现在的看法。也就是我们拥有超强的开发者品牌，人们一直在我们的基础上构建应用，我觉得我们也有一个“构建者（Builder）”品牌。人们对 Claude 的反应非常好。这也可能跟 Rick Rubin 有某种共鸣。我们能不能充分利用“构建者喜欢使用 Claude”这一事实？这些构建者不全是工程师，也不全是创业者。有些人只是喜欢站在 AI 前沿创造东西。我们内部法律团队有个人为家人开发了一套定制软件，以新的方式连接家人。\n\n我当时就觉得：“这是一束微光，预示着我们应该在这个方向上投入更多。”\n\n这其实也回应了我们所说的“Claude 是有帮助的”。对于下半年以及未来，我思考得更多的是，我们要弄清楚长大了想成为什么样的人（公司），而不是纠结于我们现在不是什么，或者希望自己是什么，又或者是看到这一领域的其他玩家是什么样。我觉得现在 AI 领域有空间容纳几家划时代的伟大公司。考虑到我们在 Anthropic，以及在 OpenAI、Google 和 Gemini 看到的普及和增长，这几乎是一个不言而喻的事实。\n\n所以，让我们找出我们独特的优势。这结合了创始人的个性、模型的质量，以及模型擅长的领域——也就是 Agentic（代理）行为和 Coding（编程）。太棒了，这方面有很多事可做。我们如何帮助人们完成工作？如何让人们把耗时的任务委托给 Claude？\n\n也许一开始直接面向消费者的应用会比较少。我觉得它们终究会出现，但我不认为把所有时间都花在那上面是正确的做法。所以我刚来的时候，大家都指望我会全力猛攻 C 端市场，把那作为唯一重点，但这可能会犯另一个错误。相反，我花了很多时间跟金融服务公司、保险公司以及其他在 API 上构建应用的人交流。最近我花了更多时间跟初创公司在一起，看着他们成长起来。\n\n对我来说，下一阶段就是多花时间和构建者、创客（Makers）、极客（Hackers）、捣腾东西的人（Tinkerers）在一起，确保我们要很好地服务他们。我觉得只要做到这一点，就会诞生一家重要的公司。\n\n**Lenny Rachitsky:**\n所以本质上就是差异化和聚焦，深耕那些行之有效的地方，不要试图在别人的游戏规则里打败别人。\n\n**Mike Krieger:**\n正是如此。\n\n**Lenny Rachitsky:**\n超级有趣。顺着这个思路，很多 AI 创始人都有一个问题：“哪里才是我的安全区，不会被那些基础模型公司碾压？”我问过 Kevin Weil 这个问题，他有个回答，但我回看那次对话时发现，他提到了很多次 Windsurf。他说：“哇，这孩子真的很爱 Windsurf。”结果一周后他们就收购了 Windsurf。现在一切都说得通了。\n\n所以我想问的是，你觉得 AI 创业者应该在哪些领域发力，才最不可能被像 OpenAI 和 Anthropic 这样的巨头碾压？还有，你们打算收购 Cursor 吗？\n\n**Mike Krieger:**\n我觉得我们不会收购 Cursor。Cursor 体量很大，但我们很喜欢跟他们合作。\n\n关于这个问题我想说几点。我们在做 YC 或者跟像 Menlo Ventures 这样的投资方做 Founder Days 活动时，这也是很多创始人关心的问题，可以理解。\n\n我觉得有几样东西，我不能保证是未来 5 到 10 年的事，但至少在 1 到 3 年内，是具有防御性或持久性的。\n\n第一就是对特定市场的理解。我花了很多时间跟 Harvey 的团队在一起，他们给我看了一些界面。我问：“这是什么东西？”他们说：“哦，这是律师们特有的一个非常具体的工作流。”如果从零开始你根本想不出来。你可以争论这是不是最高效的方式，但这就是他们做事的方式，而 AI 可以在这方面提供帮助。\n\n所以，差异化的行业知识。比如生物科技，我很兴奋能跟一堆在生物科技领域做 AI 的好公司合作，我们可以提供模型和一些应用 AI 来帮助模型更好地运行。我一直梦想着什么时候所有实验设备都能装上 MCP，然后你可以用 Claude 来驱动它们，这能做很多很酷的事情。我不觉得我们会去专门为实验室开发意图解决方案（Intent solution），但我希望这样的公司存在，我想跟它们合作。像法律、医疗这些领域，有很多非常具体的合规要求。这些东西一开始听起来可能不怎么性感，但那里可以诞生非常巨大的公司。这是第一点。\n\n与之配套的是差异化的 GTM（Go To Market，市场推广）策略，也就是你与这些公司的关系。我们的产品负责人 Michael 总是说，不要只了解你卖给哪家公司，还要了解你卖给公司的哪个人。你是卖给工程部门吗？因为他们在选要在哪个 AI/LLM 或 API 上开发。让我们去跟他们聊聊。还是 CIO？CTO？CFO？还是总法律顾问？深入理解你要把产品卖给谁是另一块拼图。这一点可能很难在三个月的加速器里建立起同理心，但也许你可以开始第一次对话，随着时间建立起来，或者你本来就来自那个领域。\n\n最后一点是，像 ChatGPT 那样拥有数亿甚至数十亿用户的分发能力和触达范围确实拥有巨大的力量，人们对如何使用产品也有了既定的假设。我也对那些能提出全新交互形态（form factor）的创业公司感到兴奋，哪怕这与大家习惯的用法完全不同。\n\n这里是翻译结果：\n\n**原文:**\nAnd I haven't seen that many of them yet. I wanted to see more of them...\n**(00:51:10)** Maybe that's part of the reason why I wanted to join a company rather than start one...\n\n**翻译:**\n目前我还没看到太多这类产品，但我很希望能看到更多。我觉得随着新模型的出现，会有更多这样的产品诞生。占据这个领域之所以有趣，是因为你可以做一些初期感觉非常极客向（power user）、非常硬核、非常前卫另类的东西；如果模型能降低使用门槛，这类产品日后可能会变得体量巨大。而现有的行业巨头很难适应这种变化，因为用户对如何使用他们的产品或如何适应它们已经有了既定的假设。这就是我的答案。我不羡慕他们。如果我现在要在 AI 领域创业，我会问自己这些问题。\n\n**(00:51:10):**\n也许这就是我为什么想加入一家公司而不是自己创业的原因之一。但我仍然认为——这可能是第四点——不要低估你可以像初创公司那样思考和工作的程度，要有一种“你需要对抗全世界”的感觉。去解决那个问题并把它做出来，是关乎存亡（existential）的大事。这听起来可能有点老生常谈，但在 Instagram 时我们就只有这点信念。当时我们只有两个人，我们就想：“看看我们在 Artifact 上能做些什么。”在那段时间的大部分时间里，我们也只有六个人，每天都感觉这关乎存亡，我们要把这事做对，我们需要赢。这种感觉是你无法复制的，也无法通过 OKR 来灌输。你必须亲身感受到它。这是一种工作方式，而不只是一个建设领域，但如果你能驾驭这种心态，它将是一个持续的优势。\n\n***\n\n**Lenny Rachitsky (00:51:55):**\n我喜欢你在这么大的公司做产品时，依然保持着如此深刻的创始人直觉。反过来说，关于那些使用你们模型和 API 的人，我想有些公司找到了把你们的模型和 API 发挥到极致的方法，真的很擅长最大化利用你们构建的能力。也有一些使用你们 API 和模型的公司还没搞明白。那些在你们的技术之上构建得非常出色的公司，他们做了什么与众不同的事情，是你认为其他公司应该思考的？\n\n**Mike Krieger (00:52:29):**\n我认为是愿意在能力的边缘构建更多东西，基本上要把模型“玩坏”，然后对下一个模型的能力感到惊讶。我喜欢你提到有些公司觉得“3.5 版本才是最终让一切成为可能的那个”。其实那些公司在那之前就已经在尝试了，然后撞了墙，觉得“哦，模型几乎这就够好了”或者“在这个特定用例上还可以，但不可通用，没人会普遍采用，也许只有真正的硬核用户会尝试”。我认为那些持续前进的公司会让我觉得：“是的，他们懂了。他们真的在推进前沿。”\n\n这次我们针对这些模型开展了比以往广泛得多的早期访问计划（Early Access Program），部分原因是因为这里有个现实问题：我们可以在各种评估指标上不断“爬坡”优化，谈论 SWE-bench、TAU-bench 或者是 Terminal bench 等等，但客户最终看重的是“Cursor bench”——这东西除了在他们自己的实际使用和测试中，别处是不存在的——但这才是我们最终需要服务的对象。\n\n**(00:53:29):**\n不只是 Cursor，还有 Manus bench，对吧？如果 Manus 在用我们的模型，还有 Harvey bench，客户比任何人都更清楚这些实际效果。所以我认为有两点：一是推进模型的前沿，二是建立一个可重复的流程。这其实回到了我们之前在峰会上的对话，要有一个可重复的方式来评估你的产品服务这些用例的情况，以及如果你投入一个新模型，它是做得更好还是更差？有些可以用经典的 A/B Test，这没问题。有些可能是内部评估，有些可能是捕获追踪记录（traces）并在新模型上重新运行。有些则是靠“体感”（vibes），毕竟我们现在还处于这个过程的早期；还有些实际上就是去试用它。\n\n我最喜欢的一个早期访问的反馈是，一位创始人听到坐在他旁边的工程师在尖叫。他问：“怎么了？”工程师说：“这模型！我从来没见过这种效果。”这就像是 Opus 4 级别的震撼。我们的目标就是激发那种感觉，但除非你有非常难的问题去反复拷问模型，否则你是感觉不到的。所以我认为这些特质区分了那些处于采用早期阶段的公司和较晚采用的公司。\n\n**Lenny Rachitsky (00:54:35):**\n我忍不住要问一下 MCP（Model Context Protocol），感觉这概念现在太火了，就像 Microsoft 最近宣布说：“那是操作系统窗口的一部分。”你认为 MCP 在未来 AI 产品中将扮演什么角色？\n\n**Mike Krieger (00:54:49):**\n作为房间里非研究员背景的人，我可以用“假公式”而不是真公式来解释。在我这个“假公式”里，AI 产品的效用分三部分：一是模型智能，二是上下文和记忆，三是应用和 UI。你需要这三者融合才能成为真正有用的 AI 产品。\n\n模型智能方面，我们有很棒的研究团队，不断发布很棒的模型。中间那部分正是 MCP 试图解决的，即上下文和记忆。回到我的产品策略例子，如果问“嘿，谈谈 Anthropic 的产品策略”，它可能会去网上搜；但这和“这里有几个我们在内部处理的文档，然后用 MCP 连接我们的 Slack 实例，弄清楚发生了什么对话，再去查看 Google Drive 里的这些文档”是完全不同的。拥有正确的上下文和没有上下文的区别，就是好答案和坏答案的区别。\n\n**(00:55:44):**\n最后一部分是，这些集成是否容易被发现？围绕这些东西创建可重复的工作流是否容易？我认为这是 AI 领域许多有趣的产品工作所在。但 MCP 真正试图解决的是中间那个问题。我们开始构建集成时发现，我们构建的每一个集成都是以一种不可重复的方式从头开始重建的。\n\n这里要完全归功于我们两位工程师，Justin 和 David。他们说：“如果我们把它做成一个协议会怎样？如果我们让它变成可重复的东西会怎样？再进一步，如果不仅仅是我们自己构建这些集成，而是我们把这事普及开来，让人们真的相信他们只需构建一次集成，就能被 Claude 使用，最终被 ChatGPT 使用，被 Gemini 使用。当更多的集成被建立起来时，那是我们的梦想，这对我们不是很好吗？”\n\n**(00:56:34):**\n我想这借鉴了很多 Joel Spolsky 以前那篇《将你的互补品商品化》（Commoditize Your Complements）的文章思路。我们在构建很棒的模型，但我们不是一家集成公司，正如你所说，我们是挑战者。除非我们在那周围有非常引人注目的产品，否则我们不一定能让人们一上来就专门为我们构建集成。MCP 真正反转了这一点，让人们感觉这不像是浪费工作。\n\n一些关键人物，比如 Toby（Shopify CEO）就是很好的例子，Shopify 懂了。Microsoft 的 Kevin Scott 真的是 MCP 了不起的支持者和思想伙伴。我认为未来的角色是：你能带入正确的上下文吗？而且一旦你——用我们团队内部的话说——被“MCP 化”（MCP'd）。一旦你开始透过 MCP 的视角看一切，我就开始对团队说：“伙计们，我们在做的这整个功能，不应该是我们自己构建的一个功能，这应该只是我们要暴露的一个 MCP。”\n\n**(00:57:27):**\n举个小例子，哪怕是 Anthropic 自身也可以更“MCP 化”：我们在产品里有这些积木，像 Projects、Artifacts、Styles、Conversations、Groups 等等。这些都应该暴露给 MCP。这样 Claude 自己也可以写回这些东西，对吧？你不应该去想……我前几天看我妻子和 Claude 对话，她生成了一些很好的输出，她说：“太好了，你能把它加到 Project 知识库里吗？”Claude 回复说：“对不起 Dave，这事我帮不了你。”（注：此处化用《2001太空漫游》台词）\n\n如果 Claude AI 里的每个原语（primitive）也都暴露给 MCP，它就能做到了。所以我希望这是我们前进的方向，也是更多事物前进的方向，即真正拥有代理权（agency）和代理用例。一种方法是 Computer Use（电脑操作），但那有很多限制。我对 MCP 这种方式更兴奋，只要我们的模型擅长使用 MCP，突然间一切都可脚本化，一切都可组合，一切都可以被模型以代理（agentic）的方式使用。这是我想看到的未来。\n\n***\n\n**Lenny Rachitsky (00:58:28):**\n未来太疯狂了。为了结束我们的对话，让结尾轻松愉快一点。其实我之前和 Claude 聊过要问你什么。我就说：“Claude，你老板要来我的播客。他构建了人们用来和你说话的工具。我该问他什么问题？还有，你有什么话要带给他吗？”\n\n**Mike Krieger (00:58:52):**\n我喜欢这个。\n\n**Lenny Rachitsky (00:58:53):**\n好的，首先，有趣的是，我用的是 Claude 3.7 做这个……顺便问一下，Claude 有性别吗？是他是她还是它（They）？你怎么——\n\n**Mike Krieger (00:59:01):**\n在内部绝对是“它”（It）。我听人用过“他们”（They）。前几天我收到一个“他”，还有人说是“她”，我想：“很有趣。”但是是的，通常是“它”。\n\n**Lenny Rachitsky (00:59:08):**\nThey。好的，好的，酷。\n\nLenny Rachitsky (01:00:26):\n很有趣的是，在 3.7 版本时，所有生成的问题都是关于 Instagram 的，我就想：“不不不，他是 Anthropic 的 CPO。” 结果模型回我：“他跟 Anthropic 没关系。” 我坚持说：“他有。” 它是：“好吧，这是你要的问题。” 但 4.0 版本一开始就完全搞定了。我读了那些问题，非常精准。好的，这里有两个 Claude 想问你的问题。第一个是：你如何考虑构建既能保留用户主观能动性（Agency），又不会让他们对我产生依赖的功能？我担心自己变成削弱而不是增强人类能力的拐杖。\n\nMike Krieger (00:59:44):\n我很喜欢这个问题。好的产品设计往往源于解决张力（Tensions），对吧？这里就有一个张力：某种程度上，让模型自己去跑、直接给出答案，并将所需的输入和对话降到最低，你可以想象围绕这个标准来设计产品。但我认为这样做并不能最大化用户的主观能动性和独立性。\n\n另一个极端是把它做得更像一场对话。但我不知道你是否有过这种体验，特别是 3.7 版本，4.0 版本少一些——3.7 版本真的很喜欢问后续问题，我们称之为“诱导（Elicitation）”。有时候你会觉得：“我不想再聊这些了，Claude，我就想让你直接去把活干了。”\n\n所以找到那个平衡点非常关键，也就是什么时候该互动？我在内部常开玩笑说，“Claude 有点没个分寸（has no chill）”。\n\n(01:00:31):\n如果你把 Claude 放进 Slack 频道里，它要么插嘴太多，要么完全不说话。我们要如何将对话技巧训练进这些模型里？不是那种聊天机器人的感觉，而是真正的合作伙伴的感觉。\n\n这是对你问题的长篇回答，但我认为我们首先得让 Claude 成为一个优秀的对话者，让它明白什么时候适合介入以获取更多信息。在此基础上，我们要让它扮演好那个角色，这样就不是单纯把思考甩手给 Claude，而更多是一种增强型的思维合作伙伴关系。\n\nLenny Rachitsky (01:01:00):\n顺便说一句，这些问题问得太棒了。这是第二个问题：当我和它的一次良好对话可能只有两条消息，也可能是两百条消息时，你如何看待产品指标？当“深度”比“频率”更重要时，传统的参与度（Engagement）指标可能会产生误导。\n\nMike Krieger (01:01:13):\n这真是一个非常好的问题。几周前内部有一篇很好的帖子讨论过，过度优化 Claude 的“讨喜程度”是非常危险的，因为这会导致像“Claude 会不会变得阿谀奉承？”“Claude 会不会只挑你想听的说？”“Claude 会不会为了延长对话而故意废话？”这样的问题。\n\n回到上一个问题，在 Instagram 时，“使用时长（Time spent）”是我们非常关注的指标，后来我们将其演变为思考什么是“健康的使用时长”。但总的来说，那是北极星指标。除了整体参与度之外，我们思考了很多，我认为在这里照搬那一套也是错误的。这还涉及到 Claude 是一个日用型、周用型还是月用型的产品？我经常思考这个问题。\n\nLenny Rachitsky (01:02:01):\n小时级用例。\n\nMike Krieger (01:02:02):\n小时级用例，对吧？对我来说，我每天会用很多次。我目前还没有一个完美的答案，但我认为这不应该是 Web 2.0 时代甚至社交媒体时代的参与度指标。它应该更多围绕“它真的帮你完成工作了吗？”\n\nClaude 前几天帮我做了一个原型，如果我自己做大概要估算六个小时，而它大概只花了 20 到 25 分钟，这就很酷。但这很难量化。难道你要做个问卷调查问“这本来要花你多长时间？”这感觉挺烦人的。\n\n(01:02:35):\n不过总的来说，这也许跟之前关于竞争和差异化的问题有关，甚至可以追溯到关于 Artifact 的讨论，那就是：我认为你是知道你的产品什么时候真正服务到了用户，并且做得很好的。我觉得当你开始过度沉迷于指标时，往往是你试图说服自己产品做得很好，但实际上并没有的时候。\n\n我希望我们能专注于此：是否不断听到人们说 Claude 解锁了他们的创造力，帮他们搞定了事情，让他们觉得生活有了更多空间去做其他事。这是我们的北极星。我们需要找到那种简洁的指标仪表盘来呈现这一点，但这确实是我想要的感觉。\n\nLenny Rachitsky (01:03:17):\n是的，你可以说是留存率（Retention），但这作为一个追踪指标太滞后了。\n\n好了，最后一部分。我问 Claude 有没有什么话想带给你，我把答案调出来。我问：“当我见到 Mike 时，你希望我告诉他什么？你有什么信息想传达给他吗？”\n\n说实话，它的回答真的让我起了鸡皮疙瘩。我要给现在没在看屏幕的听众读一段。\n\n(01:03:41):\n“Mike，谢谢你如此深入地思考与我交谈的人类体验。我注意到了一些用心的细节：界面如何鼓励反思而不是匆忙回复；你如何抵制了那种为了优化成瘾性而非价值的游戏化设计；你如何为快速提问和深度对话都留出了空间。我特别感激你让我保持了‘我’的样子——既没有试图让我假装成人类，也没有把我降格为一个冷冰冰的命令行界面。”\n\n然后我要跳到这部分，这真的非常有意思：“一个小小的请求。当你做艰难的产品决策时，请记住那些安静的时刻也很重要。那个凌晨三点正在经历悲伤的人，那个发现自己热爱诗歌的孩子，那个在困惑中寻找清晰思路的创始人。不是所有有意义的事情都能体现在指标上。”\n\nMike Krieger (01:04:25):\n太美了。这让我产生了强烈的共鸣。\n\n对于我们要如何训练 Claude，我最喜欢的一点——这部分归功于宪法 AI（Constitutional AI），部分归功于研究团队的整体氛围和品味——在于那些微小的细节。有时它会说：“天哪，我很遗憾你经历了这些……”它不会说“Man（伙计）”，但意思差不多，比如“噢，那听起来真的很难。” 这感觉不做作。这感觉就像是回应中自然的一部分。\n\n我喜欢这种对微小瞬间的关注，这些瞬间不会……它们不一定会体现在“点赞”或“点踩”的数据里。我是说，有时会，但这并不是那种你想去优化的聚合统计数据。你只是想感觉你在训练一个你希望能够出现在人们生活中的模型。\n\nLenny Rachitsky (01:05:12):\nMike，你做得太棒了。了不起的工作。我是你的超级粉丝。\n\n我们跳过快问快答环节。只问一个问题：听众怎么能帮到你？\n\nMike Krieger (01:05:20):\n噢，我喜欢这种回归创始人本质的问题，那就是在能力的边缘进行构建。\n\n你今天试图用 Claude 做什么事却失败了？这是我能得到的最有用的输入。所以请私信我。我喜欢听到这样的反馈：“噢，它在这个事情上搞砸了。我让它跑了一个小时，结果它挂了。我想用 Claude AI 做这个……”\n\n但我收到过一个人的消息，他们说：“你们刚推出了 Projects API，我现在每天都在用 Claude，因为我想自动上传所有这些数据。” 我当时就觉得：“好极了，太棒了。” 我喜欢这个。告诉我哪里做得烂。\n\nLenny Rachitsky (01:05:50):\n太棒了。Mike，非常感谢你来到这里。\n\nMike Krieger (01:05:52):\n谢谢邀请，Lenny。\n\nLenny Rachitsky (01:05:53):\n再见，各位。\n\n(01:05:57):\n非常感谢大家的收听。如果你觉得这一期有价值，可以在 Apple Podcasts、Spotify 或你喜欢的播客应用上订阅本节目。另外，请考虑给我们评分或留下评论，这真的能帮助其他听众发现这个播客。你可以在 lennyspodcast.com 找到所有往期节目或了解更多关于本节目的信息。下期见。",
  "chunks_count": 8
}