{
  "guest": "Seth Godin",
  "en": "Lenny Rachitsky (00:00):\nBefore you came on, I asked on Twitter, what should I ask Seth Godin? The most recurring theme actually had to do with AI. How do you think all these new AI companies build brands to distinguish and differentiate themselves?\n\nSeth Godin (00:10):\nAI very soon is going to stop being a feature the same way electricity is not a feature. What AI companies and all companies need to do is say, what's in this for the user? What promise do I want to make a difficult promise, a remarkable promise, and then how do I keep it?\n\nLenny Rachitsky (00:26):\nYou wrote a new book. You basically talk about how a great strategy has tension at the center of it.\n\nSeth Godin (00:31):\nTension is at the heart of every art form and every innovation. What we do when we launch a new product, we say, we have this thing that can do X, and now the person is imagining what their life might be like if that were true. If they fall in love with that possibility, now there's tension. Did you tell the truth? Is it going to work for them?\n\nLenny Rachitsky (00:51):\nThere's the section that stuck out to me, these four insights that basically determine what your life is going to be like outside of actually building the product.\n\nSeth Godin (00:59):\nFor a product person, these are the critical choices and you probably have glossed over them.\n\nLenny Rachitsky (01:11):\nToday my guest is Seth Godin. Seth is an absolute legend. He's published 21 books, including 18 international bestsellers. He's been blogging every single day for almost 10,000 days in a row now. His writing and his advice have inspired me and so many people all over the world for the past few decades. He shares wisdom and advice around stuff that everyone can benefit from, including how ideas spread, when to quit, how to lead, how to stand out, and most of all how to change everything. In addition to his writing and speaking, Seth has founded several companies, including Yoyodyne and Squidoo. He also started the altMBA program, and as you'll hear in our conversation, he actually started his career as a product manager. In our conversation, Seth shares advice on how to know if you have good taste and how to build your taste, how to build a brand in an increasingly crowded world of AI startups and AI content, his thoughts on the Jaguar rebrand and also the Tesla Cybertruck.\n\n(02:10):\nWe also delve into his new book, This is Strategy, including why every great strategy has tension at its center, why you need to understand the systems within which you operate in order to build a great strategy and how choosing your customers, your distribution strategy, and how you validate your idea will inform the product you build and the life that you live. We also talk about how he used Claude as a writing assistant in developing this new book.\n\n(02:33):\nThis episode is short and packed with insights, which I know is what you all love. If you enjoy this podcast, don't forget to subscribe and follow it in your favorite podcasting app or YouTube. It's the best way to avoid missing future episodes and helps the podcast tremendously. With that, I bring you Seth Godin.\n\n(02:52):\nSeth, thank you so much for being here and welcome to the podcast.\n\nSeth Godin (02:55):\nWhat a treat, Lenny. Thank you for having me. Lenny was my late mom's nickname, so it's good to say that out loud.\n\nLenny Rachitsky (03:02):\nThat's so cool. I've never heard it used for a woman, and every Lenny out there I've met is wonderful, so I imagine she's wonderful. First, I just want to say how honored I am to have you on this podcast. When I actually started this podcast, I was like, and I was listening to you on Tim Ferriss at that point, and I was like, man, what if one day I get Seth Godin on my podcast? How cool would that be? I've read so many of your books. I have a bunch of them in the bookshelf back there. I reference your stuff all the time, so thank you again for doing this.\n\nSeth Godin (03:29):\nWell, thank you. It's a treat to talk to you.\n\nLenny Rachitsky (03:33):\nToday's episode is brought to you by DX. If you're an engineering leader or on a platform team, at some point your CEO will inevitably ask you for productivity metrics, but measuring engineering organizations is hard and we can all agree that simple metrics like the number of PRs or commits doesn't tell the full story. That's where DX comes in. DX is an engineering intelligence solution designed by leading researchers, including those behind the DORA and space frameworks. It combines quantitative data from developer tools with qualitative feedback from developers to give you a complete view of engineering productivity and the factors affecting you. Learn why some of the world's most iconic companies like Etsy, Dropbox, Twilio, Vercel, and Webflow rely on DX. Visit DX's website at getdx.com/Lenny.\n\n(04:25):\nThis episode is brought to you by Vanta. When it comes to ensuring your company has top-notch security practices, things get complicated fast. Now you can assess risk, secure the trust of your customers and automate compliance for SOC 2, ISO-27001, HIPAA and more with a single platform, Vanta. Vanta's market-leading trust management platform helps you continuously monitor compliance alongside reporting and tracking risk. Plus, you can save hours by completing security questionnaires with Vanta AI. Join thousands of global companies that use Vanta to automate evidence collection, unify risk management, and streamline security reviews. Get $1,000 off Vanta when you go to Vanta.com/Lenny. That's Vanta.com/Lenny.\n\n(05:18):\nI want to start by asking a question that one of your former colleagues suggested I ask you. Wes Kao. I imagine you remember Wes?\n\nSeth Godin (05:25):\nOf course. Wes and I sat in a room just the two of us for years.\n\nLenny Rachitsky (05:29):\nSo what she suggested I ask you, and this question I love, is she... I asked her, what did you learn most from Seth Godin working with him? And she immediately said, it's helping her build better taste and increase her standards, having really high standards. So I want to ask you first of all, just how do you know if you have good taste and high standards and then how do you build good taste and higher standards?\n\nSeth Godin (05:54):\nGreat question. Thank you, Wes. I define good taste as knowing what other people want just before they do. So if you're the only person who wants peanut butter covered licorice, you're entitled to eat peanut butter covered licorice, but you don't have good taste because everyone else thinks that's weird. And people, whether they're jazz musicians or fabric designers are seen as having good taste when they bring something to the world that the world didn't necessarily expect but is glad to see.\n\nLenny Rachitsky (06:25):\nWhat do you find helps? So Wes learned from watching you that she realized, okay, my standards are not nearly as high as they could be. Other than working with you, maybe that's the answer is work with people like you that have really high standards. Just what do you find is most helpful in helping people build taste and also just increase their standards?\n\nSeth Godin (06:46):\nStandards, it's worth understanding what quality is and the people who listen to this podcast know better than most. Quality is not luxury. Quality is not perfection. Quality means meeting spec, and if you meet spec, you're done. If you don't think the spec is good enough, make a better spec. But if you meet spec, you're done. And so what it means to have high standards is that you relentlessly improve the spec in service of the people you're working with and for.\n\n(07:16):\nAnd what it doesn't mean is that you take something that meets spec and refuse to ship it because you're a perfectionist. That's hiding. And so what I learned at Spinnaker where I had my first job, real job as a product manager, was this idea that we weren't there to make perfect for us. We were there to delight the person who was buying the software. And our standards were untouchable. We said, \"If that person, the one we're describing is delighted with what we shipped, it's good. And if they're not, it doesn't matter what kind of excuses we have.\" This is the opposite of what most people in this job do, which is they say, how do I please my boss? And if you're just doing your job, then don't expect to get rewarded for more than just doing your job because we can find lots of people who can just do your job.\n\nLenny Rachitsky (08:10):\nThat reminds me of one of your other really powerful pieces of advice about how no matter your job, this is a tangent, but it really stuck with me once I read your advice here is no matter what job you have, you couldn't love it, enjoy it, be amazing at it, even if you're just like a waitress or whatever. Can you just talk through that? Because that's so powerful.\n\nSeth Godin (08:29):\nWell, I think I got it from the late Reverend Martin Luther King Jr., and the idea is there's no perfect job. A friend of mine, Tim, is a famous jazz saxophonist and he's got to schlep from city to city, and he's got to play to half empty rooms and he is got to deal with this and deal with this. So you're never going to have unlimited artistic freedom. But what we all have is the ability to understand where the boundaries of our work lie and go there.\n\n(09:01):\nAnd if you're a barista and you've chosen to be a barista, maybe because it's the best thing you could get, well you're not going to get the next hour over again. So what would it be like to be the best barista in the world for an hour? Would that be worth it for you? Because I've had menial jobs in food service and I got to tell you, when the boss forces you to be mediocre and bored, there's no amount of money they can pay you to do that job. But if you're there and you have a chance to add delight to someone's day, you're doing that for you, not because you're getting paid.\n\nLenny Rachitsky (09:34):\nAnd you could totally tell these people in the world when you go to a barista that just you can tell, just loves their job. I know imagine she knows this is not her career long-term, but she just embraces it and just has fun with it. There's so much power to that. On a different note, you mentioned that you were product manager, which I did not know. That's amazing. So most of the people listening to this podcast are product managers. They're either product managers, founders, people that want to be founders, and then people that work with product managers. So first of all, I guess could you just share that part of your life? Because I don't think people know that.\n\nSeth Godin (10:05):\nAll right. So the origin story could take all day, but I'm not going to tell the whole thing. I'm going to tell the part that I thought was normal that turned out to be the luckiest thing in the world. The summers between the two years of business school are very important to establish your career arc. I got a job at Spinnaker Software. Spinnaker invented educational computer games. I was the 30th employee. And the summer was spent doing assistant brand manager kind of stuff, going to meetings with the ad agency, writing copy. But at the end of the summer, they had a lovely going away party for me, because I was flying back to California. And then at the end, the president of the company, the chairman of the company and the head of marketing bring me into this side when they say, \"We have a secret project, we want you to work for us while you're at business school and we're all going to pay you almost nothing.\"\n\n(10:52):\n\"Okay, what's the secret project?\" \"We're going to do computer adventure games with illustrations and music based on science fiction novels, and we've already acquired the work of Ray Bradbury and Arthur C. Clarke.\" Now, I had read every science fiction book in the Clearfield Public Library from Asimov to Zelazny. This was a dream come true, but they thought my job was going to be make the packaging and run the ads. And what I discovered, first of all is that I couldn't really go back to business school. So I showed up hardly at all at Stanford and just took a lot of red eyes. But I discovered that the engineers, the development team, they had a lot of people vying for their time. And if I didn't figure out how to get them to give me way more than my fair share of development, I wasn't going to have any products to make next Christmas and then I was going to be out of a job.\n\n(11:46):\nAnd so I started a newsletter internally, I was one of the first people in the world to have desktop publishing because I was a beta tester for the Mac, and in it I would mention anybody in the engineering team who had worked on my project and I would say something good about them. And then I would print it out and put it in every single person's inner office mailbox. And within three months, four months, partly because the project was really good, 40 engineers were working for me and no one was reporting to me. And so I became the de facto product manager and that is when I learned marketing is the product. You don't make a product and then hand it to some marketing yahoo and say, go put a logo on this. That the product we made, and five in a row went gold, saved the company. Though product is why it worked.\n\n(12:38):\nAnd so I was supposed to know how to code but I didn't, but I could be in the room. The last month, RadioShack had bought how many units? 3000 stores times five times five, a lot of units. And if we had missed a date, they were going to cancel the order and the company would go bankrupt, and the software wasn't even close to done. And we didn't have any source control like we do now. There was no cloud, so it was all in my head. So I did not leave the office. I'm not exaggerating this, I did not leave the office for the last 22 days, slept for four hours a night upstairs, and if anyone had a question, I could tell them who to talk to.\n\n(13:19):\nThat was so thrilling. It was so thrilling to make those decisions, to cajole this team, none of whom were in it for the money, to make something we were proud of. And then the stuff ships, everyone else goes home to sleep for a month, but I am the project manager and the marketing guy, so I got to stay at work. And the next day the phone rings and it's Herbie Hancock on the phone, the great jazz musician, and Herbie says, \"The receptionist said you're the person in charge of Fahrenheit 451.\" And I said, \"Herbie? I'm 24 years old, man. Herbie?\" And he went on and on about how he had stayed up all night to play it and that he loved it.\n\nLenny Rachitsky (14:00):\nI love how natural of a product manager you were in these things you shared of just thinking everyone deflecting credit and all these things. It's sign of a great PM. Along these lines, I wanted to ask actually, so you're a PM early on. Now, you obviously spend a lot of time marketing. I know you're saying there's obviously a strong connection between the two, but is there anything you find that people building the product most often miss or misunderstand that just annoys you or do you think they need to hear?\n\nSeth Godin (14:26):\nMaybe I got seven, but I'll try to do them off the top of my head. The first one is this, empathy is not about kindness and empathy is not an option. This is something that you are making for other people. So the whole idea of RTFM, read the manual, I'm angry at you. If you're saying that to your customers, you made a mistake, they did not make a mistake.\n\n(14:49):\nThe second one is that the thing about projects is when you run out of time and you run out of money, the project is over. Don't run out of time, don't run out of money. Good intentions are no reason for an extension. The professional doesn't ask for an extension because the professional understands that things you didn't expect are going to happen. That's part of the deal.\n\n(15:14):\nAnd I guess the third one would be for software, particularly software as a service, if you don't build the network effect into what you are making, you are almost certainly going to fail. You cannot hope that Apple's going to pick you, promote you, and magically have you be successful. The question is, will this work better for my users if they tell other people about it? And if the answer is no, then why would they tell other people about it? And if they don't tell other people about it, no one's going to hear about it. But if the answer is yes, then your marketing problems pretty much solved.\n\nLenny Rachitsky (15:51):\nI feel like each of these is its own book that we could talk through. And I want to come back to this last point and how it relates to the purple cow. I want to spend a little time there, but first I'm going to ask a marketing question. So before you came on, I asked on Twitter, what should I ask Seth Godin? He's coming on my podcast. I got a flood of suggestions. The most recurring theme actually had to do with AI. Actually the co-founder of Intercom asked this question and it echoes what many people are wondering. So his question is how do you think all these new AI companies build brands to distinguish and differentiate themselves in a world that's increasingly filled with AI companies, AI products, AI content?\n\nSeth Godin (16:26):\nWell, the first question is what's a brand? Because it's not a logo. A brand is a promise. It's what do I expect from you. It's would I miss you if you were gone. And Hyatt Hotels has a logo, Nike has a brand. The way we know this is if Nike opened a hotel, we'd know what it would be like. But if Hyatt decided to make sneakers, we have no clue. They might be comfortable, but that's all we would know. And so if you want to build a brand, you got to stand for something and you got to say what you don't do. And the second thing is AI very soon is going to stop being a feature the same way electricity is not a feature. That lots and lots of things run on electricity, but they're not electricity companies. They just happen to use electricity.\n\n(17:13):\nSo what AI companies and all companies need to do is say, what's in this for the user? What promise do I want to make? A difficult promise, a remarkable promise. And then how do I keep it? So making absurd promises might work at the VC level, but it doesn't work when you're talking to consumers because you can only break that promise one time. And so to wrap up the brand part, airlines don't have brands and airlines don't have loyalty. And the way we know this is that the only reason people stick with an airline is for the points, which is bribery. Loyalty is would you pay extra to stick with this? And if you wouldn't pay extra, then the brand has no value.\n\nLenny Rachitsky (17:58):\nI love this phrase, make a promise and keep it. And the AI element, that raises the bar because many more promises are being made, fewer promises are probably being kept. So is the advice there, continue making an ambitious promise and then the key is actually deliver on that and that's what builds you brand?\n\nSeth Godin (18:15):\nYeah. I have a very emotional connection to Claude.ai. I think they have a brand. ChatGPT's reputation with me is not good because it regularly over promises and under delivers and it does it without kindness or humility. Whereas Claude, I don't know how they did it, at least in my experience, brings kindness and humility. So when it doesn't know, it's very clear and it's not lazy and it's not angry at me. And so I happily pay extra for Claude because it has a brand. Whereas ChatGPT for me is just a tool that I use if I have no other options.\n\nLenny Rachitsky (18:55):\nI love the Anthropic/Claude's billboards. \"We're the ones without the drama.\" The AI company without the drama. I was going to save this to the end, but let's actually talk about it. So you mentioned somewhere that you actually use Claude to help you write this book and refine the book, which I think is going to increasingly happen. Could you just share that process of how you did that? What did you do that might be helpful to people to help you write this book?\n\nSeth Godin (19:20):\nWell, to be clear about my brand promise, because it's true, every word that has my name on it, I wrote. Every blog post, every book. I don't have a team. This is my whole staff is me. What I did with Claude and which I encourage people to do in the book is I would upload a list of four things and say, what did I miss? And it would suggest three things to complete the list. And often they would be things I hadn't thought of. And then I could go write about that or I would upload a couple chapters and I would say, what are the claims I'm making here that you don't think that I'm sustaining? And it became this patient editor that is so hard to find in the real world because editors aren't paid enough and given enough time to do their job right. And what I find is if I have a sentence that doesn't sound enough like me, I can ask Claude to help me figure out why that's true.\n\nLenny Rachitsky (20:24):\nI love that tactic of using it to figure out what you missed. I feel like you agree with this. I find that when I write, part of it is I'm putting an idea out there. I want to see what I got wrong and what I missed. And I like that you basically skip that step and don't put it out and just make the thing you put out actually better.\n\nSeth Godin (20:42):\nWell, the thing about blogging every day is at first it felt like how am I going to keep up? But once I could build a queue because I didn't want my streak to end-\n\nLenny Rachitsky (20:55):\nHow long is the streak at this point, by the way?\n\nSeth Godin (20:58):\nPost number 10,000 comes out at the beginning of 2025.\n\nLenny Rachitsky (21:02):\nOh my God. In a row.\n\nSeth Godin (21:04):\nIn a row. Some days there were two. But what I found as I got a little bit of a queue is that I would feel bad because I had something to say, but I couldn't because there was already one in the queue. So I shifted from I have to write something to I get to write something. And now because I've taken the pressure off, I have time to rewrite it because I don't have a shortage of ideas for tomorrow. I have extra ones.\n\nLenny Rachitsky (21:34):\nThis episode is brought to you by Paragon, the developer platform for building native customer-facing integrations with third-party apps. Our native integrations on your product roadmap, whether it's to ingest context from your user's external data and documents, or to sync data and automate tasks across your users' other apps, integrations are mission-critical for B2B software products today. But building these integrations in-house cost and average of three months of engineering according to the 2024 State of Integration survey, which results in difficult roadmap trade-offs. This is why engineering teams at Copy.ai, AI21 and over 100 other B2B SaaS companies use Paragon so they can focus their efforts on core product features, not integrations. The result, they've shipped integrations seven times faster, all while avoiding the never-ending maintenance that comes with rolling your own integrations. Visit useparagon.com/Lenny to see how Paragon can help you accelerate your product's integration roadmap today and get $1,000 in credit on their pro and enterprise plans. That's useparagon.com.\n\n(22:41):\nSo let's talk about your book. You wrote a new book. It's called This is Strategy. I've been reading it over the past week and I've been so into it that I actually left it at my mother-in-law's house. I don't have it with me. So it's called, This is Strategy. It's about how to build strategy and develop a strategy. There's a lot to love about the book, but the section in the middle that is what most stuck out to me that I want to spend a little time on. You have this four sequence of advice that I love, so I'm just going to read it real quick. Choose your customers, choose your future. Choose your competition and choose your future. Choose the source of validation and you choose your future. Choose your distribution, and you're also choosing your future. Can you just talk through these four insights, these four steps that basically determine what your product and life is going to be like outside of actually building the products directly?\n\nSeth Godin (23:31):\nYeah. And for a product person, these are the critical choices and you probably have glossed over them. You have probably assumed it's a given and you've sacrificed your agency over the four most important things you should be choosing. So the first one is picking your customers. If your motto is you can pick anyone and we're anyone, if your hope is that you have to win SEO to get anything, you're not going to succeed. When you choose your smallest viable audience, what language they speak, how much money they have, what problem they're trying to solve, what their technical facility is, whether they're short-tempered, whether they're kind, whether they're going to stick with you, you have chosen everything that's going to go into the product and what your future is going to be like. And so the Humane Pin people, whatever it was called, made a mistake when they picked their customers because they showed up like they had a finished Apple-quality product and they were trying to appeal to the kind of people that would buy on pre-order a finished Apple quality product.\n\n(24:40):\nWhen they shipped something that wasn't that, and they knew it wasn't that, they're doomed. Whereas if you say, here we are in Product Hunt, we're only looking for 400 people. We're looking for people who like the Raspberry Pi. Who wants to wonk with this thing? Now you can dance and you can have all these other things happen because you picked a different customer. If you decide to be a wedding photographer in the Hamptons, well you better expect to have some very spoiled, cranky brides and grooms, and grooms and grooms, and brides and brides, that you have to deal with because you picked your customers. Okay, so then the second one which comes with that is who's your competition? Because if you're competing against Walmart, why are you surprised that they keep lowering their prices? That's what Walmart does, right? That way you decide which space that you're going to operate in. You've built an enormous set of boundaries around what you do.\n\n(25:36):\nThe third one is validation. If you are trying to please your boss, that's what you're going to do. If on the other hand, you can have one difficult conversation with your boss and say, can we agree that I'm not trying to match your taste, I'm trying to match the taste of these 400 people that we've agreed are our customers? Every other meeting is going to go way better from now on because you've made it clear who you're trying to please.\n\n(26:01):\nAnd the last one, choose your distribution matters a lot in the software business. For example, a video game, which is where I started, we were in Target and Lechmere and mass merchants. Our competitors were in Ziploc bags in computer stores. Well, when something like Steam shows up, when something like downloadable shareware shows up, everything about your product changes. So again, these four things are choices, and if you're glossing over them it's because you're afraid.\n\nLenny Rachitsky (26:33):\nAnd I think it's important to note, it's not like you can just change these at will and just like, okay, cool, we'll change your distribution. These are intertwined. But the important point here that I hear is just make sure the product you're building understands this is how you'll be distributed. This is who you're selling to.\n\nSeth Godin (26:49):\nYeah, I mean, so a friend just sent me a business plan. They're making a food product and they're saying, we're going to distribute on Shopify and we're also going to sell to businesses, airports, hotels, and people who need to sell the food. I'm like, there's only two of you. No, that's not what your business... You got to pick, today, before you even turn the page, who are you for and who are you not for?\n\nLenny Rachitsky (27:15):\nAlong the lines of picking your customer reminds me, a friend of mine started a company selling a product to real estate agents and she just warned me, be careful who you're selling to because you're going to be spending a lot of time with these people. Make sure you're ready to be doing that.\n\nSeth Godin (27:28):\nOne of my very first books was a advertising supported directory paid for by law firms. This is not something I want to recommend to anybody.\n\nLenny Rachitsky (27:38):\nAnother great nugget from the book that really stood out to me is this idea of tension. The importance of tension. You basically talk about how a great strategy has tension at the center of it. Why is tension so important to a good strategy?\n\nSeth Godin (27:53):\nOkay, so let's agree that tension and stress aren't the same thing. Stress is generally not good. Stress is two things at the same time, I want to leave, I need to stay. Right? I hate my boss, but I need this job. That's stress. Don't look for stress. Tension is at the heart of every art form and every innovation. Tension is it might not work. Tension is da-da-da-na-na, and the other person says, da-da. Because they need to finish the sentence.\n\n(28:23):\nSo what we do when we launch a new product is we say, we have this thing that can do X, and now the person is imagining what their life might be like if that were true. If they fall in love with that possibility, now there's tension. Did you tell the truth? Is it going to work for them? And when I was a kid, PF Flyers were the sneaker to get, this was before Nike. And the promise of PF Flyers was that they would finally make you fast enough to run away from the bully. And I remember 10 years old walking into that shoe store and there was real tension in my head because I needed to get away from that bully, and I was keeping the PF Flyers people to their promise, and they didn't tell the truth.\n\nLenny Rachitsky (29:08):\nIt comes back to your point about not delivering on the promise that you make to build-\n\nSeth Godin (29:08):\nYes.\n\nLenny Rachitsky (29:13):\n... A great brand, right? Okay, I want to take a little tangent into Purple Cow territory. I have your book right here, by the way. I have many of your books in the back, but I don't want to make my library... Oh, what is that? A milk carton?\n\nSeth Godin (29:26):\nThis is the first 10,000 copies came in milk carton.\n\nLenny Rachitsky (29:28):\nOh man, I missed out on that. Was there any purple milk inside? What color is a purple cow's milk? We'll never know. We'll never know. I know you've talked about this concept a gazillion times. I feel like still people don't actually... Many people haven't heard it. Many people don't truly understand it, and it's the thing that I reference most of your piece of advice. Could you spend a little time just chatting about this topic of the Purple Cow, the importance of being remarkable?\n\nSeth Godin (29:57):\nOkay, so let's start with Steve Blank. I'm sure you've talked about his idea of customer traction. The single best way to tell if a startup's got any hope whatsoever is do the people who engage with you stick around? Do they come back for more? The second piece is, do they tell their friends? And if they tell their friends, what do they say? The word remarkable means worth making a remark about. So I'm not talking about coming up with some viral video that's ridiculous in its gimmickry. I'm saying if you make something where the person's life gets better if they talk about you and you know in advance what you want them to say, then they are more likely to say it. So Marissa Mayer probably created more stock market value than any other product manager I can think of. And the way she did it was there weren't very many people at Google, but she was the one who said, \"No, you can't put another button on the homepage. There are only going to be two buttons on the homepage.\" And over and over and again.\n\n(31:04):\nAt the time I was at Yahoo. Yahoo had the chance to buy Google for $10 million while I was there. That's a whole interesting story. But Yahoo had 183 links on the homepage and Google had two. And the statement built into that is we are making you a promise, and the promise is we are smart enough to take you where you want to go without you spending a lot of time browsing through 183 links. Tell us what you want and we'll take you there. And so I was a tech-forward person, and if a friend came to me lost on the internet, confused about something, I'd just send them to Google because I knew they wouldn't come back to me for more help, because okay, fine, they're gone. It's going to work. That's what to say about Google at its launch is, hey, just type in what you want and you'll find it. They built that into the product. That makes it remarkable because I wanted to tell other people about that because it would raise my status as a tech innovator.\n\nLenny Rachitsky (32:05):\nAnd the implication here, and you talked about this, is that most likely the way you will win is word of mouth. It's hard to win with paid ads. It's hard to win with sales teams unless you're building B2B software. What you need to focus on is how to build something people tell their friends about. And the core of that is being remarkable. And I love just the way you break it down. Being remarkable is being something people remark about.\n\nSeth Godin (32:30):\nYeah, and if you think it's just for small companies, that's how Microsoft beat WordPerfect, because Microsoft Word was the format you needed your coworkers to work in if you were using a modern computer, because if they insisted on using WordPerfect, then you were stuck with WordPerfect. Whereas they had a migration path and once you migrated, you didn't go back. So again, it's in my interest to insist you use Word. So I did.\n\nLenny Rachitsky (32:58):\nThis point about Mercer Mayer of doing this thing that was controversial, it comes back to your point of creating tension. It feels like it created tension both with visitors and internally. There's also these quotes that I have here that are along these lines that you've said in the past, I don't think they're in this book. If it scares you, it might be a good thing to try. And safety is risky. Is there anything you want to say there?\n\nSeth Godin (33:22):\nWell, so one of the things I talk about in the book is that systems are everywhere we look and they're largely invisible, taken for granted. I spend time with high school seniors talking about college. They don't see the college industrial complex. They just think it's normal, because that's what it is to grow up in the suburbs. And what systems do to protect themselves is they invent culture. Culture is the way things are around here. And so if you think something is scary, that's probably because the system wants you to think that.\n\n(33:57):\nAnd so you shouldn't do something foolhardy. You shouldn't be fearless. But what you should do is think about why does it scare me to do this? What system will be offended if I do that? Am I trying to work with the system or am I leveraged enough to help change the system? And so the first people who put up downloadable software, all the feedback was, you can't do that. It'll be pirated. You'll never make a penny. Okay. That might happen, and I can see why that feels scary, but I could also see why the dominant system of software distribution doesn't want me to even experiment with this. But I only worked on the software for five months, let's try it, because if it doesn't work and it gets pirated, I'll just have to make new software. It's okay.\n\nLenny Rachitsky (34:44):\nIt's interesting, the opposite of that was also true with Salesforce. Their whole pitch was no software. It's all in the cloud. Once that became the system, that became the tension and the risky move.\n\nSeth Godin (34:55):\nYeah.\n\nLenny Rachitsky (34:56):\nSo you have this quote, actually. I want to spend more time on the system concept because it's so core to the book, and so core to your advice for how to be better, you have this actual quote. \"What does it mean to be a strategic thinker? It means to see the system.\" What else can you share about it just for people that are trying to become better strategically, to understand what you mean when you talk about the system, how to see the system?\n\nSeth Godin (35:18):\nWe have to invent systems anytime we engage with other human beings, because interoperability is essential. There's a system for how we greet other people in our culture. You shake hands, right hand to right hand. And just show up sometime and give the Vulcan salute instead and watch what happens. It's very awkward because we just needed to get this over with and now that's part of the system. And so systems serve a valuable function until they don't, because then the system starts doing things to support itself, to reinforce itself. So for example, there is a system that says we should interview people for jobs. And the most successful interviews are people where they show that they are like us, they look like us, they went to schools like us, they have privilege and background like us. That is toxic, because it diminishes not just diversity, but our ability to put real talent on the team.\n\n(36:19):\nAnd if you don't see that system and name that system, you're going to keep doing what you were doing. And I was talking to someone yesterday who said they had been working with a company and the last four people that they had hired had been captain of their Ivy League tennis team. Well, clearly there's a pattern here and it's being reinforced by people who don't want to get in trouble, but the system's not helping them. And so yes, we need the metric system and we need the zip code system. Those keep working really well. But if you are trying to show up in a place where dominant players don't want you to succeed, you're going to have to find something in the system that gives you a chance to change the rules.\n\nLenny Rachitsky (37:07):\nThis metaphor that I love that's along these lines of better waves make better surfers, that a lot of your success is driven by choosing the wave versus the skills that you have. Can you just talk about that?\n\nSeth Godin (37:18):\nYeah. So it's surprisingly profound. I don't know where I came up with it, but when I see people who are great at surfing, they're almost always on good waves. And my son who surfs a lot, I have noticed, passes up waves that other people might take waiting for the right wave because he knows he will be able to surf it better. So when you think about which company you're signing up to bring software from, which people you're willing to put on the key roles, are you willing to wait for the superstar who's going to change things or are you in so much of a hurry to make an imaginary deadline that you're going to ship mediocre work? Because all mediocre means is average. And so if you don't want to be mediocre, you better do something different than the other people are doing. Otherwise, you're going to get what the other people are getting.\n\nLenny Rachitsky (38:10):\nAs you talk about this, I'm thinking about, I don't know if you saw Jaguar's rebrand and their whole launch. And it feels like it's been rejected by the system. Any thoughts on that? Maybe what they got wrong or maybe it was genius?\n\nSeth Godin (38:24):\nOkay, so you've picked a topic that I really like to talk about. Jaguar did not rebrand, Jaguar re-logo-ed. And the logo might be a sign that they're trying to rebrand and make a different promise, and they're switching to all electric, which I'm in favor of. But they made, I think, a very significant error, which is if you're going to start a car company, a hundred million or a billion dollars are going to get spent earning trust from people who never heard of you. If you're starting with one of the most iconic and beautiful and beloved car brands that has the luxury of having almost no cars in the world that could undermine what you want it to stand for going forward, it's perfect. Own that, that's brilliant. And to walk away from that so that you could please some art director, I don't understand why you think you're rebranding when you just put a logo on that undermines many of the awareness assets you already had going for you.\n\nLenny Rachitsky (39:28):\nIt feels like they got very, very controversial. They went against the status quo more maybe than they should. I don't know. What would you have done if you were them?\n\nSeth Godin (39:36):\nYou may recall when the International House of Pancakes decided to falsely announce they were changing their name to the International House of Burgers and made a new logo, because they wanted buzz. This is a Wendy's Twitter tactic. Buzz does not sell hamburgers. Oreo's got a lot of buzz when they did that tweet about the Super Bowl blackout. There's no evidence they sold even one more cookie. They're not in the business of entertaining us. So Jaguar isn't going to sell more cars because people like you and I are talking about their re-logoing. What's going to make them sell cars is customer traction. What they need to do is find 50 people who have authority and get them in a car that changes them somehow, that transforms them.\n\n(40:26):\nAnd it's interesting if you think about two things that Tesla did right at the beginning with the model S. The first one is, according to someone I know who worked there at the time, the number one thing people would talk about when they saw you in the parking lot of the supermarket was the door handles, because the door handles popped out. They popped out in a way that's annoying and dangerous, but it was noticeable. So there was a conversation.\n\n(40:52):\nAnd then what would happen is they'd say, what do you think of it? And you'd say, get in the car and you'd switch to ludicrous mode and you'd drive at zero to 60 in 2.4 seconds and they'd start screaming. This was fun for you and told a story to the passenger. This is how customer traction begins because I can't do that in a different car, right? Compare this to the clown car, the Cybertruck, which was intentionally divisive and most people don't want to not only drive one but have one on their block because divisiveness is not selling. That what's selling is being of utility, to help someone get what they want. So here you have a category, the pickup truck, the number one category for all cars in the United States, just sitting there waiting to be taken. You can cross the chasm if you're someone like Tesla. And instead, they decide to pull a stunt, and that's not okay. It's not good product management. It's not good marketing.\n\nLenny Rachitsky (41:56):\nInteresting. So you think Cybertruck are not going to be a success?\n\nSeth Godin (42:00):\nWell, I think, compared to what, right? So the Ford F-150 some years has made more than a hundred percent of Ford's profit, meaning without the Ford 150 pickup truck, there is no Ford. That's how big a category that is. You have a car with momentum and a public company where you've earned the trust of a lot of people. Now you have a category, pickup trucks, that are purchased for a very specific reason to show your neighbors you care about utility. Even if you never use the bed, that's the story of driving a pickup truck. So now, if you bring people in that category who are inherently skeptical of change and inherently skeptical of design trickery, something that is nothing but change and design trickery, no, they're not going to adopt it. You could have sold an enormous number of people who might've bought a Ford 150 instead. That crossing of the chasm is how you become really significant.\n\nLenny Rachitsky (43:01):\nI feel like this alone could be its own separate podcast conversation. I wish we had more time. I'm going to ask one last question, and this is a quote that I found of yours that I also love that is reminiscent of Elon Musk, actually, as we were just talking about this. \"The secret to leadership is simple. Do what you believe. Paint a picture of the future. Go there. People will follow.\" Can you just talk about that?\n\nSeth Godin (43:25):\nI might be a little too glib because what I need to highlight is the painting the picture of the future needs to be based in empathy. You can't paint a picture of where you want to go. You have to paint a picture of where they want to go, and it's this non-narcissism that is where professionals do their work. That you are not entitled to raise money, you're not entitled to have market share, you're not entitled to get a good price because you worked hard. What we can do is be of service. We can open the door to help people get to where they always wanted to go. It's very difficult to change what people want, but it's pretty helpful to offer people a chance to get to where they always wanted to go in the first place.\n\nLenny Rachitsky (44:14):\nSeth, this was a dream come true. I appreciate you coming on the podcast. I appreciate you saying that. Where can people check out your book? Where should people go to learn more about what you're up to? Anything you want to share.\n\nSeth Godin (44:25):\nSo I'm not active on social media, but I do have a blog at Seths.blog. If you go to Seths.blog/TIS, you'll find everything you need to know about the book and the strategy deck and the collectible chocolate bar and whatever other thing I've dreamed up in the meantime.\n\nLenny Rachitsky (44:42):\nChocolate. Seth, thank you so much for being here.\n\nSeth Godin (44:45):\nThese were great questions, Lenny, I could talk to you all day. Thank you,\n\nLenny Rachitsky (44:48):\nI appreciate that. Same. Bye everyone.\n\n(44:52):\nThank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcasts, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at LennysPodcast.com. See you in the next episode.\n\n",
  "zh": "Lenny Rachitsky (00:00):\n在你上来之前，我在 Twitter 上问，我该问 Seth Godin 什么？最常出现的主题其实和 AI（人工智能）有关。你认为所有这些新的 AI 公司该如何建立品牌，从而脱颖而出并实现差异化？\n\nSeth Godin (00:10):\nAI 很快就会不再是一个 Feature（功能/特性），就像电力不再是一个 Feature 一样。AI 公司以及所有公司需要做的是问：这对用户有什么好处？我想做出什么样的承诺——一个困难的承诺，一个了不起的承诺，然后我该如何兑现它？\n\nLenny Rachitsky (00:26):\n你写了一本新书。你基本上谈到了一个伟大的 Strategy（战略）核心是如何存在 Tension（张力）的。\n\nSeth Godin (00:31):\nTension 是每种艺术形式和每项创新的核心。当我们发布新产品时，我们会说，我们有这个可以做 X 的东西，现在人们正在想象如果那是真的，他们的生活会是什么样子。如果他们爱上了那种可能性，现在就有了 Tension。你说了实话吗？它对他们有用吗？\n\nLenny Rachitsky (00:51):\n有一个章节让我印象深刻，这四个 Insights（洞察）基本上决定了你在实际构建产品之外的生活会是什么样子。\n\nSeth Godin (00:59):\n对于一个 Product Person（产品人）来说，这些是关键的选择，而你可能已经忽略了它们。\n\nLenny Rachitsky (01:11):\n今天我的嘉宾是 Seth Godin。Seth 是一个绝对的传奇。他出版了 21 本书，其中包括 18 本国际畅销书。他已经连续近 10,000 天每天写博客了。在过去的几十年里，他的写作和建议激励了我以及全世界这么多的人。他分享的智慧和建议让每个人都能从中受益，包括想法如何传播、何时退出、如何领导、如何脱颖而出，最重要的是如何改变一切。除了写作和演讲，Seth 还创办了几家公司，包括 Yoyodyne 和 Squidoo。他还创办了 altMBA 项目，正如你在我们的对话中听到的，他职业生涯的起点其实是一名 Product Manager（产品经理）。在我们的对话中，Seth 分享了关于如何判断你是否有 Good Taste（好品味）以及如何培养品味的建议；在日益拥挤的 AI 初创公司和 AI 内容世界中如何建立品牌；他对 Jaguar（捷豹）品牌重塑以及 Tesla Cybertruck（特斯拉赛博皮卡）的看法。\n\n(02:10):\n我们还深入探讨了他的新书《这就是战略》(This is Strategy)，包括为什么每一个伟大的战略核心都有 Tension（张力），为什么你需要了解你所运作的 Systems（系统）才能制定伟大的战略，以及选择你的客户、你的 Distribution Strategy（分发策略）和你如何 Validate（验证）你的想法将如何影响你构建的产品和你所过的生活。我们还谈到了他在开发这本新书时，如何使用 Claude 作为 Writing Assistant（写作助手）。\n\n(02:33):\n这一集很短，但充满了洞察，我知道这是你们大家都喜欢的。如果你喜欢这个播客，别忘了在你最喜欢的播客应用或 YouTube 上订阅并关注它。这是避免错过未来剧集的最佳方式，也对播客有巨大的帮助。现在，为您带来 Seth Godin。\n\n(02:52):\nSeth，非常感谢你能来，欢迎来到这个播客。\n\nSeth Godin (02:55):\n真是太荣幸了，Lenny。感谢你邀请我。Lenny 是我已故母亲的昵称，所以能大声说出这个名字感觉很好。\n\nLenny Rachitsky (03:02):\n那太酷了。我从未听说过这个名字用在女性身上，而且我遇到的每一个 Lenny 都很棒，所以我能想象她也很棒。首先，我想说能邀请你参加这个播客我感到多么荣幸。当我开始做这个播客时，那时我正在听你在 Tim Ferriss 节目上的访谈，我在想，天哪，如果有一天我能邀请 Seth Godin 上我的播客，那该多酷啊？我读过你的很多书，我后面的书架上就有很多。我经常引用你的内容，所以再次感谢你参加节目。\n\nSeth Godin (03:29):\n好的，谢谢。能和你交谈也很愉快。\n\nLenny Rachitsky (03:33):\n今天的节目由 DX 赞助。如果你是一名工程主管或在 Platform Team（平台团队）工作，在某些时候，你的 CEO 肯定会向你索要生产力指标，但衡量工程组织是很困难的，我们都同意像 PRs（Pull Requests/拉取请求）或 Commits（代码提交）数量这样简单的指标并不能说明全部情况。这就是 DX 的用武之地。DX 是一种由领先研究人员（包括 DORA 和 SPACE 框架背后的研究人员）设计的工程情报解决方案。它将来自开发者工具的 Quantitative Data（定量数据）与来自开发者的 Qualitative Feedback（定性反馈）结合起来，让你全面了解工程生产力以及影响你的因素。了解为什么一些世界上最具标志性的公司，如 Etsy、Dropbox、Twilio、Vercel 和 Webflow 都依赖 DX。访问 DX 的网站 getdx.com/Lenny。\n\n(04:25):\n这一集由 Vanta 赞助。当涉及到确保你的公司拥有顶级安全实践时，事情很快就会变得复杂。现在，你可以使用单一平台 Vanta 来评估风险、获得客户的信任并自动完成 SOC 2、ISO-27001、HIPAA 等 Compliance（合规）认证。Vanta 市场领先的 Trust Management Platform（信任管理平台）可帮助你持续监控合规性，同时报告和跟踪风险。此外，你还可以通过 Vanta AI 完成安全问卷来节省数小时的时间。加入成千上万家使用 Vanta 自动化证据收集、统一风险管理并简化安全审查的全球公司。去 Vanta.com/Lenny 即可享受 1,000 美元的优惠。就是 Vanta.com/Lenny。\n\n(05:18):\n我想先问一个你以前的同事建议我问的问题。Wes Kao。我想你还记得 Wes 吧？\n\nSeth Godin (05:25):\n当然。Wes 和我曾在一个房间里共事多年，只有我们两个。\n\nLenny Rachitsky (05:29):\n她建议我问的是，我很喜欢这个问题，她说……我问她，在和 Seth Godin 共事期间，你从他身上学到了什么？她立刻说，是帮助她建立更好的 Taste（品味）并提高她的标准，拥有极高的标准。所以我想问你，首先，你如何知道自己是否拥有 Good Taste（好品味）和 High Standards（高标准），然后你如何建立好品味和更高的标准？\n\nSeth Godin (05:54):\n好问题。谢谢 Wes。我将 Good Taste（好品味）定义为：比其他人早一步知道他们想要什么。如果你是唯一一个想要花生酱涂层甘草糖的人，你有权吃它，但你没有好品味，因为其他人都觉得这很奇怪。而人们，无论是爵士音乐家还是面料设计师，当他们给世界带来一些世界并不一定期待、但很高兴看到的东西时，就会被视为拥有好品味。\n\nLenny Rachitsky (06:25):\n你觉得什么会有所帮助？Wes 通过观察你意识到，好吧，我的标准远没有达到应有的高度。除了和你共事之外，也许答案就是和像你这样有极高标准的人一起工作。你觉得在帮助人们建立品味以及提高标准方面，什么是最有帮助的？\n\nSeth Godin (06:46):\n标准，值得去理解什么是 Quality（质量），听这个播客的人比大多数人都更清楚。Quality（质量）不是 Luxury（奢华），Quality 不是 Perfection（完美）。Quality 意味着 Meeting Spec（符合规格/说明书），如果你符合了 Spec，你就完成了。如果你觉得 Spec 不够好，那就制定一个更好的 Spec。但如果你符合了 Spec，你就完成了。因此，拥有 High Standards（高标准）意味着你为了服务于你所共事和为之服务的人，而不懈地改进 Spec。\n\n(07:16):\n这并不意味着你拿着一个符合 Spec 的东西却因为你是一个 Perfectionist（完美主义者）而拒绝 Shipping（发布/交付）。那是躲避。所以我在 Spinnaker 学到的东西（我的第一份工作，真正的 Product Manager/产品经理工作）就是这个想法：我们不是为了创造对我们来说完美的东西。我们是为了让购买软件的人感到 Delight（愉悦）。我们的标准是不可动摇的。我们说：“如果那个人，也就是我们描述的那个人，对我们交付的东西感到满意，那就是好的。如果他们不满意，我们有什么样的借口都不重要。” 这与这个岗位上大多数人的做法恰恰相反，他们会说，我该如何取悦我的老板？如果你只是在做你的工作，那么不要指望除了做你的工作之外还能得到更多回报，因为我们可以找到很多只能做你这份工作的人。\n\nLenny Rachitsky (08:10):\n这让我想起你另一条非常有力的建议，即无论你的工作是什么——这是一个插曲，但我读了你的建议后就一直记在心里——无论你做什么工作，你都可以热爱它、享受它、并在其中表现出色，即使你只是一名女招待之类的。你能谈谈这个吗？因为这很有力量。\n\nSeth Godin (08:29):\n嗯，我想我是从已故的小马丁·路德·金牧师那里学到的，这个想法是：没有完美的工作。我的一个朋友 Tim 是著名的爵士萨克斯演奏家，他必须在城市间奔波，必须在只有一半观众的房间里演奏，必须处理各种各样的事情。所以你永远不会拥有无限的艺术自由。但我们所有人都拥有的能力是，理解我们工作的边界在哪里，并达到那里。\n\n(09:01):\n如果你是一名 Barista（咖啡师），并且你选择了做一名 Barista（也许是因为这是你能得到的最好的工作），那么接下来的一个小时你是无法重来的。那么，成为一个小时内世界上最好的咖啡师会是什么样子呢？这对你来说值得吗？因为我做过餐饮服务方面的卑微工作，我得告诉你，当老板强迫你变得平庸和无聊时，他们付给你多少钱都无法弥补那份工作。但如果你在那里，你有机会为一个人的生活增添一份喜悦，那是为你自己做的，而不是因为你拿了薪水。\n\nLenny Rachitsky (09:34):\n你完全可以从世界上这些人身上看出来，当你去见一个咖啡师时，你可以看出来，她就是热爱她的工作。我想她知道这不是她的长期职业，但她就是全身心投入并享受其中。这很有力量。换个话题，你提到过你曾是 Product Manager（产品经理），我以前不知道。这太棒了。听这个播客的大多数人都是产品经理。他们要么是产品经理，要么是创始人，或者是想成为创始人的人，还有与产品经理共事的人。所以，首先，我想你能分享一下你那段生活吗？因为我觉得人们并不了解那段经历。\n\nSeth Godin (10:05):\n好的。起源故事可以讲上一整天，但我不会讲全部。我要讲我认为很正常、但后来发现是世界上最幸运的那部分。商学院两年之间的暑假对于建立你的职业弧线非常重要。我在 Spinnaker Software 找到了一份工作。Spinnaker 发明了教育类电脑游戏。我是第 30 名员工。那个暑假我都在做 Assistant Brand Manager（助理品牌经理）之类的工作，参加广告代理公司的会议，写文案。但在暑假结束时，他们为我举办了一个愉快的告别派对，因为我要飞回加州。最后，公司总裁、董事长和营销负责人把我带到一边说：“我们有一个秘密项目，我们想让你在读商学院期间为我们工作，我们支付给你的报酬几乎为零。”\n\n以下是这段播客转录内容的完整中文翻译：\n\n(10:52):\n“好吧，那个秘密项目是什么？”“我们要根据科幻小说制作带有插图和音乐的电脑冒险游戏，而且我们已经拿到了雷·布莱伯利（Ray Bradbury）和亚瑟·C·克拉克（Arthur C. Clarke）的作品授权。”当时，我已经读遍了克利尔菲尔德公共图书馆里从阿西莫夫到泽拉兹尼的所有科幻书。这简直是梦想成真。但他们当时觉得我的工作应该是做包装和投放广告。我发现的第一件事是，我真的没法回商学院继续读书了。所以我几乎没在斯坦福露过面，只是不停地坐“红眼航班”（Red eyes，指深夜出发、清晨抵达的航线）。但我发现，工程师和开发团队有很多人在争夺他们的时间。如果我不搞清楚如何让他们分给我远超“公平份额”的开发资源，到明年圣诞节我就拿不出任何产品，然后我就会丢掉工作。\n\n(11:46):\n于是我开始在公司内部办一份简报，我是世界上第一批拥有“桌面出版系统”（Desktop publishing，利用电脑软件进行排版印刷）的人之一，因为我是麦金塔电脑（Mac）的 Beta 测试员（Beta tester，测试阶段使用者）。在简报里，我会提到工程团队中任何参与我项目的人，并夸奖他们。然后我会把它打印出来，塞进每个人的办公室内部邮箱里。在三四个月内，部分原因是项目本身确实很棒，40 名工程师都在为我工作，而实际上没人在行政汇报关系上隶属于我。就这样，我成为了事实上的“产品经理”（Product Manager，简称 PM），也正是那时我学到了：营销即产品（Marketing is the product）。你不是先做一个产品，然后把它扔给某个营销混混说“去给这玩意儿贴个标志”。我们做的那个产品——连续五个项目都达到了“金盘”销量（Went gold，指软件开发完成并进入大规模量产阶段）——救了公司。产品本身才是成功的关键。\n\n(12:38):\n当时我本该懂得如何写代码，但我不会，不过我可以待在现场。在最后一个月，RadioShack（电子产品零售商）买了多少货？3000 家店，每家 5 套再乘以 5，那是很大一笔订货量。如果我们错过日期，他们就会取消订单，公司就会破产，而当时软件离完工还远得很。那时我们没有像现在这样的“源码控制系统”（Source control，代码版本管理工具）。没有云端，所以一切都在我的脑子里。所以我没有离开办公室。我没有夸张，最后 22 天我都没离开过办公室，每晚在楼上睡四个小时。如果有人有问题，我可以告诉他们该去找谁沟通。\n\n(13:19):\n那感觉太刺激了。做这些决策，去游说这个团队（他们中没一个人是为了钱而工作的），去做出一些让我们自豪的东西，这太令人兴奋了。然后产品出货了，其他人都回家睡上一个月，但我既是项目经理又是营销人员，所以我得留在公司。第二天电话响了，是赫比·汉考克（Herbie Hancock）打来的，那位伟大的爵士音乐家。赫比说：“接线员说你是《华氏 451 度》（Fahrenheit 451）项目的负责人。”我说：“赫比？老兄，我才 24 岁。真的是赫比吗？”他在电话里滔滔不绝地讲他如何熬夜玩这个游戏，以及他有多么喜欢它。\n\nLenny Rachitsky (14:00):\n我非常喜欢你在分享中表现出的那种天生的产品经理特质，比如总是把功劳推给别人等等，这是一个优秀 PM 的标志。顺着这个思路，我其实想问：你早期是 PM，而现在显然花了很多时间在营销上。我知道你说过两者之间有很强的联系，但你是否发现产品开发者最常忽略或误解了什么，让你觉得很恼火，或者你认为他们需要听听的建议？\n\nSeth Godin (14:26):\n也许我有七条建议，但我试着凭直觉说几条。第一条是：共情（Empathy）不是关乎仁慈，共情不是一种选项。这是你为他人制作的东西。所以“RTFM”（Read The F***ing Manual，去读那该死的说明书）这种想法——我在生你的气。如果你对你的客户说出这种话，那是你犯了错，而不是他们犯了错。\n\n(14:49):\n第二条是：关于项目的一点是，当你耗尽时间和金钱时，项目就结束了。不要耗尽时间，不要耗尽金钱。良好的意愿不能成为延期的理由。专业人士不会要求延期，因为专业人士明白意料之外的事情总会发生，这是工作的一部分。\n\n(15:14):\n我想第三条是针对软件，特别是“SaaS”（Software as a Service，软件即服务）。如果你不把“网络效应”（Network effect，指产品价值随用户数量增加而提升）构建到你正在制作的东西中，你几乎注定会失败。你不能指望苹果公司会选中你、推广你，然后奇迹般地让你获得成功。问题在于：如果我的用户把这个产品告诉别人，它对他们来说会变得更好用吗？如果答案是否定的，那他们为什么要告诉别人？如果他们不告诉别人，就没人会听说它。但如果答案是肯定的，那么你的营销问题就基本解决了。\n\nLenny Rachitsky (15:51):\n我觉得这里的每一条都可以写成一本书。我想回到最后一点，以及它与“紫牛”（Purple Cow，Seth Godin 提出的概念，指非凡的产品）的关系。我想在那上面多花点时间。但首先，我要问一个营销问题。在你上节目之前，我在 Twitter（现 X）上问大家：“我要采访 Seth Godin，我该问他什么？”我收到了大量的建议。最常出现的主题其实与 AI（人工智能）有关。Intercom 的联合创始人也问了这个问题，这引起了许多人的共鸣。他的问题是：在这个 AI 公司、AI 产品、AI 内容日益泛滥的世界里，你认为这些新的 AI 公司应该如何建立品牌，从而脱颖而出并实现差异化？\n\nSeth Godin (16:26):\n首先要问的问题是：什么是品牌（Brand）？因为它不是一个 Logo（标志）。品牌是一个承诺。它是我对你的预期，是如果你消失了我是否会想念你。凯悦酒店（Hyatt Hotels）有一个 Logo，而耐克（Nike）有一个品牌。我们知道这一点的方法是：如果耐克开了一家酒店，我们大概能想象出它会是什么样；但如果凯悦决定做运动鞋，我们完全没概念。它们可能很舒服，但我们也仅知道这些了。所以，如果你想建立一个品牌，你必须坚持某种立场，并且必须明确你“不做什么”。第二点是，AI 很快就不再会是一个“功能”了，就像电力不是一个功能一样。很多很多东西都在用电运行，但它们不是电力公司，它们只是恰好使用了电。\n\n(17:13):\n所以 AI 公司以及所有公司需要做的是：这对用户有什么好处？我想做出什么样的承诺？一个困难的承诺，一个卓越的承诺。然后我如何兑现它？做出荒唐的承诺可能在 VC（Venture Capital，风险投资）层面有效，但在面对消费者时行不通，因为你只能打破承诺一次。总结一下品牌部分：航空公司没有品牌，航空公司也没有忠诚度。我们知道这一点的原因是，人们坚持选择某家航空公司的唯一原因是为了积分，那是贿赂。忠诚度是“你是否愿意为了坚持选择它而支付额外费用”。如果你不愿意多付钱，那么这个品牌就没有价值。\n\nLenny Rachitsky (17:58):\n我喜欢这句话：“做出承诺并兑现它”。AI 的元素提高了门槛，因为有更多的承诺被做出，而兑现的承诺可能更少。所以建议是：继续做出宏大的承诺，而关键在于实际交付，这才是建立品牌的方式吗？\n\nSeth Godin (18:15):\n是的。我对 Claude.ai 有很深的情感连接。我认为他们有品牌。ChatGPT 在我这儿的名声不太好，因为它经常过度承诺却交付不足，而且表现得缺乏友善或谦逊。而 Claude（我不知道他们是怎么做到的，至少在我的体验中）带来了友善和谦逊。所以当它不知道的时候，它表现得很坦诚，它不懒惰，也不会对我生气。因此，我非常乐意为 Claude 支付额外费用，因为它有品牌。而对我来说，ChatGPT 只是一个我在没有其他选择时才会使用的工具。\n\nLenny Rachitsky (18:55):\n我喜欢 Anthropic/Claude 的广告牌：“我们是没有内斗（Drama）的那一个”。没有内斗的 AI 公司。我本想把这个留到最后，但我们现在就谈谈吧。你曾在某处提到，你实际上是用 Claude 来帮助你写这本书并完善它的，我认为这种情况会越来越多。你能分享一下你是怎么做的吗？你做了哪些可能对大家有帮助的事情来辅助写作？\n\nSeth Godin (19:20):\n首先要明确我的品牌承诺，因为这是真的：每一个署我名字的字，都是我写的。每一篇博客，每一本书。我没有团队，我的全部员工就是我自己。我在书里也鼓励大家这样做，我对 Claude 做的是：我会上传一个包含四项内容的列表，然后问：“我漏掉了什么？”它会建议三项内容来完善这个列表。通常那些是我没想到的。然后我就可以去写那些内容。或者我会上传几个章节，问：“我在这里提出的观点，你觉得有哪些是我没有充分论证的？”它变成了一个极具耐心的编辑。在现实世界中很难找到这样的编辑，因为编辑们的报酬不够高，也没有足够的时间把工作做得尽善尽美。我发现，如果我有一句话听起来不像我的风格，我可以请 Claude 帮我分析为什么会这样。\n\nLenny Rachitsky (20:24):\n我喜欢这种“用它来发现遗漏点”的策略。我觉得你会同意这一点：我发现当我写作时，部分原因是我要把想法表达出来，我想看看我哪里错了，哪里漏了。我喜欢你这种做法，基本上跳过了“发布后再纠错”的步骤，直接让你发布的东西变得更好。\n\nSeth Godin (20:42):\n每天写博客这件事，刚开始感觉“我该怎么坚持下去？”。但一旦我建立了一个队列（Queue，指储备稿件），因为我不想让我的连续记录中断——\n\nLenny Rachitsky (20:55):\n顺便问一下，现在连续坚持多少天了？\n\nSeth Godin (20:58):\n第 10,000 篇将在 2025 年初发布。\n\nLenny Rachitsky (21:02):\n天哪，连续不断。\n\nSeth Godin (21:04):\n连续不断。有些日子发了两篇。随着我有了储备，我发现如果我有话想说却说不出来（因为队列里已经有一篇了），我反而会觉得难受。于是我的心态从“我必须写点什么”转变为“我有机会写点什么”。现在因为我卸下了压力，我有时间去重写，因为我并不缺少明天的点子，我甚至还有富余。\n\nLenny Rachitsky (21:34):\n本集节目由 Paragon 赞助播出。Paragon 是一个为构建原生、面向客户的第三方应用集成（Integrations）而设计的开发者平台。无论您的产品路线图是需要从用户的外部数据和文档中摄取上下文，还是在用户的其他应用之间同步数据和自动化任务，原生集成对于当今的 B2B 软件产品都至关重要。但根据 2024 年集成现状调查，内部构建这些集成平均需要耗费三个月的工程量，这会导致困难的路线图权衡。这就是为什么 Copy.ai、AI21 以及超过 100 家其他 B2B SaaS 公司的工程团队使用 Paragon 的原因，这样他们就可以专注于核心产品功能，而不是集成。结果是，他们交付集成的速度提高了 7 倍，同时避免了自行开发集成带来的无休止维护工作。访问 useparagon.com/Lenny，了解 Paragon 如何帮助您加速产品的集成路线图，并在其专业版和企业版计划中获得 1000 美元的抵用金。地址是 useparagon.com。\n\n(22:41):\n让我们聊聊你的书吧。你写了一本新书，书名是《这就是策略》(This is Strategy)。过去一周我一直在读，读得非常入迷，以至于我不小心把它落在我岳母家了。所以我现在手头没带着它。书名是《这就是策略》，它是关于如何构建策略和制定策略的。这本书里有很多值得称赞的地方，但中间有一部分最让我印象深刻，我想花点时间专门聊聊。你提出了四个关于建议的序列，我非常喜欢，我这就快速读一下：选择你的客户，你就选择了你的未来；选择你的竞争对手，你就选择了你的未来；选择认可 (Validation，指谁的评价对你重要) 的来源，你就选择了你的未来；选择你的分销渠道 (Distribution)，你同样是在选择你的未来。你能详细谈谈这四个洞察吗？除了直接打造产品之外，这四个步骤基本上决定了你的产品和生活会是什么样子。\n\nSeth Godin (23:31):\n是的。对于一个产品人来说，这些都是至关重要的选择，但你可能一直都忽略了它们。你可能觉得这些是既定的事实，从而在最应该由你选择的这四个最重要的事情上牺牲了自己的自主权 (Agency)。第一个是选择你的客户。如果你的座右铭是“你可以选择任何人，而我们就是为任何人准备的”，如果你寄希望于必须赢得 SEO (Search Engine Optimization，搜索引擎优化) 才能获得任何关注，那么你不会成功。当你选择了你的最小可行受众 (Smallest Viable Audience)、他们说什么语言、他们有多少钱、他们试图解决什么问题、他们的技术能力如何、他们是脾气暴躁还是为人友善、他们是否会追随你时，你就已经选择了产品中将要投入的一切，以及你的未来会是什么样子。所以那个 Humane Pin (一款可穿戴 AI 设备) 的团队，不管它叫什么，他们在选择客户时犯了一个错误，因为他们表现得好像拥有一个苹果级别的成品，并且试图吸引那些会预订苹果级别成品的人。\n\n(24:40):\n当他们交付的东西并非如此，而且他们明明知道那不是成品时，他们就注定失败了。反之，如果你说：“我们在 Product Hunt (一个发掘新产品的社交平台) 上，我们只寻找 400 个人。我们寻找的是那些喜欢树莓派 (Raspberry Pi，一种微型电脑主板) 的人，谁想折腾这玩意儿？”那么你就可以大展身手，其他所有事情都会随之发生，因为你选择了一群不同的客户。如果你决定在汉普顿做一名婚礼摄影师，那你最好预见到你会面对一些非常娇气、脾气古怪的新娘和新郎，因为那是你选择的客户。好，接下来的第二个是，谁是你的竞争对手？因为如果你在和沃尔玛 (Walmart) 竞争，为什么你会对他们不断降价感到惊讶？那是沃尔玛的本行，对吧？通过这种方式，你决定了你要在哪个空间运作。你为自己所做的事情构建了一个巨大的边界。\n\n(25:36):\n第三个是认可 (Validation)。如果你试图取悦你的老板，那你就会一直那样做。但另一方面，如果你能和老板进行一次艰难的谈话，说：“我们能否达成共识，我并不是在试图迎合你的品味，我是在尝试迎合那 400 个我们一致认为是目标客户的人的品味？”那么从现在起，其他的每一次会议都会顺利得多，因为你已经明确了你试图取悦谁。\n\n(26:01):\n最后一个，选择你的分销渠道 (Distribution)，这在软件业务中非常重要。例如，在我刚入行的视频游戏领域，我们在 Target 和 Lechmere 等大众零售商销售。而我们的竞争对手还在电脑商店里用密封袋包装软件。当 Steam (一个数字游戏分发平台) 出现时，当可下载的共享软件 (Shareware) 出现时，你产品的一切都会随之改变。再说一次，这四件事都是选择，如果你忽略了它们，那是因为你感到害怕。\n\nLenny Rachitsky (26:33):\n而且我认为有一点很重要，那就是你不能随心所欲地更改这些，比如，“好吧，那我们就改一下分销渠道”。这些是交织在一起的。但我在这里听到的重点是，要确保你正在构建的产品理解：这就是你将被分发的方式，这就是你将要卖给的人。\n\nSeth Godin (26:49):\n是的，我的意思是，刚才有个朋友发给我一份商业计划书。他们正在做一种食品，他们说：“我们要在 Shopify (一个电商平台) 上分发，我们还要卖给企业、机场、酒店以及需要销售食品的人。”我说：“你们一共就两个人。不，那不是你的业务……你必须在翻开下一页之前就选好，你到底是为了谁，而不是为了谁。”\n\nLenny Rachitsky (27:15):\n关于选择客户这一点，让我想起我的一个朋友。她创办了一家向房地产经纪人销售产品的公司，她警告我说：“小心你卖给谁，因为你会花很多时间在这些人身上。确保你准备好和他们打交道。”\n\nSeth Godin (27:28):\n我最早写的书之一是由律师事务所付费的、依靠广告支持的目录。这绝不是我想向任何人推荐的东西。\n\nLenny Rachitsky (27:38):\n书里另一个让我印象深刻的观点是“张力” (Tension) 的概念。张力的重要性。你基本上谈到了一个伟大的策略中心必须有张力。为什么张力对于好的策略如此重要？\n\nSeth Godin (27:53):\n好，我们先达成一致，张力 (Tension) 和压力 (Stress) 不是一回事。压力通常是不好的。压力是同时存在两件事，比如“我想离开，但我必须留下”，对吧？“我讨厌我的老板，但我需要这份工作”。那是压力。不要寻找压力。而张力是每一种艺术形式和每一项创新的核心。张力就是“它可能行不通”。张力就像是“哒-哒-哒-拿-拿——”，然后另一个人说“哒-哒”，因为他们需要完成这个句子。\n\n(28:23):\n所以，当我们发布一个新产品时，我们说：“我们有这个可以做 X 的东西”，现在那个人就在想象如果那是真的，他们的生活会变成什么样。如果他们爱上了那种可能性，现在就产生了张力：你说了实话吗？它对他们有效吗？当我还是个孩子的时候，PF Flyers 是最抢手的运动鞋，那是在耐克 (Nike) 出现之前。PF Flyers 的承诺是它们最终会让你跑得足够快，快到能甩掉那个小霸王。我记得 10 岁那年走进那家鞋店，我脑子里真的很有张力，因为我需要摆脱那个小霸王，我要求 PF Flyers 的人信守承诺，但他们并没有说实话。\n\nLenny Rachitsky (29:08):\n这又回到了你说的关于没有兑现承诺的点，而兑现承诺是建立……\n\nSeth Godin (29:08):\n是的。\n\nLenny Rachitsky (29:13):\n……一个伟大的品牌，对吧？好，我想稍微岔开一下话题，谈谈《紫牛》(Purple Cow) 的领域。顺便说一下，我这里就有你的书。我后面有很多你的书，但我不想让我的书架看起来太……哦，那是什么？一个牛奶盒？\n\nSeth Godin (29:26):\n这是首批 10,000 本书用的牛奶盒包装。\n\nLenny Rachitsky (29:28):\n天哪，我错过了那个。里面有紫色的牛奶吗？紫牛的奶是什么颜色的？我们永远不会知道。永远不会知道。我知道你已经谈过这个概念无数次了。我觉得很多人其实还没听说过，很多人并没有真正理解它，而这是我引用次数最多的你的建议。你能花点时间聊聊“紫牛”这个主题吗？以及变得“非凡” (Remarkable) 的重要性？\n\nSeth Godin (29:57):\n好的，我们先从史蒂夫·布兰克 (Steve Blank，硅谷著名企业家和教授) 开始。我确定你谈过他的“客户牵引力” (Customer Traction，指客户对产品的需求和互动程度) 的想法。判断一家初创公司是否有希望的唯一最好方法是：与你互动的人是否留下来了？他们会再回来吗？第二点是：他们会告诉他们的朋友吗？如果他们告诉朋友，他们会说什么？“Remarkable”这个词的意思是“值得被谈论” (Worth making a remark about)。所以我不是在说搞出一个通过噱头吸引眼球的病毒式视频。我是说，如果你做了一些事情，如果人们谈论你，他们的生活就会变得更好，而且你预先知道你希望他们说什么，那么他们就更有可能去说。玛丽莎·梅耶尔 (Marissa Mayer) 创造的市值可能比我想到的任何其他产品经理都要多。她做这件事的方式是，当时谷歌的人并不多，但她是那个说“不，你不能在首页再放一个按钮，首页只能有两个按钮”的人。这种做法一次又一次地重复。\n\n(31:04):\n当时我在雅虎 (Yahoo)。我在那里的时候，雅虎曾有机会以 1,000 万美元的价格买下谷歌。那是一个非常有趣的故事。但雅虎的首页有 183 个链接，而谷歌只有两个。这其中蕴含的声明是：“我们向你承诺，而这个承诺是我们足够聪明，能带你去你想去的地方，而不需要你花很多时间浏览 183 个链接。告诉我们你想要什么，我们就带你去那里。”所以当时我是一个追求技术先进的人，如果一个朋友在互联网上迷路了，或者对某事感到困惑，我就直接把他们发给谷歌，因为我知道他们不会再回来找我帮忙了，因为，行了，他们解决了，他们走了。这就是谷歌发布时大家说的话：“嘿，只要输入你想要的，你就能找到它。”他们把这一点构建到了产品中。这让它变得“非凡” (Remarkable)，因为我想告诉别人这件事，因为这能提高我作为一个技术创新者的地位。\n\nLenny Rachitsky (32:05):\n这里的含义是，正如你谈到的，你获胜的方式最有可能是通过口碑。靠付费广告很难获胜，靠销售团队也很难获胜，除非你是在构建 B2B (企业对企业) 软件。你需要关注的是如何构建一些人们会告诉朋友的东西。而其中的核心就是变得“非凡” (Remarkable)。我非常喜欢你对它的拆解：变得非凡就是成为人们会“评论” (Remark) 的东西。\n\nSeth Godin (32:30):\n是的。如果你认为这只是针对小公司的，那你就错了，这就是微软如何击败 WordPerfect (当时流行的文字处理软件) 的。因为如果你使用的是现代电脑，Microsoft Word 就是你协作时需要的格式。因为如果同事坚持使用 WordPerfect，那么你就被困在 WordPerfect 中了。而微软提供了一个迁移路径，一旦你迁移了，你就不会再回去了。所以，坚持让你使用 Word 是符合我的利益的。所以我确实这么做了。\n\nLenny Rachitsky (32:58):\n关于玛丽莎·梅耶尔做这种有争议的事情的点，回到了你说的创造张力。感觉这在访问者和内部都创造了张力。我这里还有一些你过去说过的类似的语录，我不觉得它们在这本书里：“如果它让你感到害怕，那可能是一个值得尝试的好事”以及“安全是危险的”。关于这些你想说什么吗？\n\nSeth Godin (33:22):\n嗯，我在书里谈到的一件事是，系统在我们的视野里无处不在，而且它们在很大程度上是隐形的，被视为理所当然。我花时间和高中生谈论大学。他们看不到“大学工业复合体” (College Industrial Complex，指教育体系作为一种庞大的产业运作)，他们只觉得这很正常，因为在郊区长大就是这样的。而系统保护自己的方式就是发明文化。文化就是“我们这里做事的方式”。所以，如果你觉得某件事很可怕，那可能是因为系统想让你这么想。\n\n请直接输出中文翻译：\n\n(33:57):\n所以你不应该做一些鲁莽的事情。你不应该无所畏惧。但你该做的是思考：为什么做这件事会让我感到害怕？如果我这样做，会冒犯到什么样的“系统 (System)”？我是想在这个系统内工作，还是我已经拥有足够的“筹码 (Leveraged)”来帮助改变这个系统？最初那些发布可下载软件的人，收到的所有反馈都是：你不能那样做，会被盗版的，你一分钱也赚不到。好吧，那确实可能会发生，我也能理解为什么那会让人感到害怕。但我也能看出来，为什么当时主流的软件分发系统甚至不想让我进行这种尝试。但我只花了五个月时间开发这个软件，那就试试吧，因为如果失败了或者被盗版了，我也只需要再做一个新软件就行。没关系的。\n\nLenny Rachitsky (34:44):\n很有趣，Salesforce 的情况恰恰相反。他们的核心卖点是“不要软件 (No Software)”。一切都在云端。一旦那成为了主流系统，那反而成了紧张局势的来源和冒险之举。\n\nSeth Godin (34:55):\n是的。\n\nLenny Rachitsky (34:56):\n你其实说过这样一句话。我想在“系统 (System)”这个概念上多花点时间，因为它是这本书的核心，也是你关于如何变得更好的核心建议。你确实说过：“成为一名战略思想家意味着什么？意味着看清系统。”对于那些想要提升战略能力的人，关于你所说的“系统”以及“如何看清系统”，你还能分享些什么吗？\n\nSeth Godin (35:18):\n每当我们与其他人类交往时，我们都必须发明系统，因为“互操作性 (Interoperability，指系统间协同工作的能力)”至关重要。在我们的文化中，有一套关于如何问候他人的系统。你会握手，右手握右手。你可以试着哪天露面时做一个“瓦肯举手礼 (Vulcan salute，源自《星际迷航》的手势)”，看看会发生什么。那会非常尴尬，因为我们本想直接完成问候流程，而现在你破坏了系统的一部分。所以系统在失效前一直发挥着宝贵的功能，因为随后系统会开始为了支持自己、强化自己而运作。例如，有一套系统说我们应该面试求职者。而最成功的面试往往是那些表现得“像我们一样”的人——他们长得像我们，上的学校和我们类似，拥有和我们一样的特权和背景。这是有毒的，因为它不仅削弱了多样性，还削弱了我们将真正人才引入团队的能力。\n\n(36:19):\n如果你看不见这个系统，不点破这个系统，你就会一直重复你正在做的事。我昨天和一个人聊天，他说他一直在和一家公司合作，而他们最近雇佣的四个人竟然都是常春藤盟校 (Ivy League) 网球队的队长。显然，这里存在一种模式，而且这种模式正被那些不想惹麻烦的人不断强化，但这个系统并没有帮到他们。所以，是的，我们需要“公制 (Metric system)”和“邮政编码系统 (Zip code system)”，这些系统运作得非常好。但如果你想出现在一个主流玩家不希望你成功的领域，你就必须在系统中找到一些能让你有机会改变规则的东西。\n\nLenny Rachitsky (37:07):\n我非常喜欢这个相关的比喻：“更好的浪头造就更好的冲浪者”，即你的成功很大程度上取决于选择什么样的“浪头”，而不是你拥有的技能。你能谈谈这个吗？\n\nSeth Godin (37:18):\n是的。这其实非常深奥。我不记得我是怎么想到这个比喻的，但当我看到那些擅长冲浪的人时，他们几乎总是在好浪头上。我的儿子经常冲浪，我注意到他会放弃一些别人可能会抓的浪，而去等待那个正确的浪，因为他知道他能在那道浪上滑得更好。所以当你思考要签约哪家公司来引入软件，或者愿意把哪些人放在关键岗位上时，你是否愿意等待那个能改变局面的“超级巨星 (Superstar)”，还是你为了赶一个虚构的截止日期而急于交付“平庸 (Mediocre)”的作品？因为平庸指的就是平均水平。所以如果你不想平庸，你最好做一些与众不同的事情。否则，你得到的只会是别人都能得到的东西。\n\nLenny Rachitsky (38:10):\n当你谈到这一点时，我在想，不知你是否看到了捷豹 (Jaguar) 的“品牌重塑 (Rebrand)”和他们的整个发布活动。感觉它被系统排斥了。对此有什么看法吗？也许是他们做错了，或者那其实是天才之举？\n\nSeth Godin (38:24):\n好，你挑了一个我非常喜欢谈论的话题。捷豹并不是在“品牌重塑 (Rebrand)”，捷豹只是“更换了 Logo (Re-logo-ed)”。Logo 也许是他们试图重塑品牌并做出不同承诺的一个信号，他们正在转向全电动化，这一点我是支持的。但我觉得他们犯了一个非常严重的错误：如果你要创办一家汽车公司，你得花一亿甚至十亿美元才能从那些从未听说过你的人那里赢得信任。而你现在拥有的是最标志性、最美丽、最受喜爱的汽车品牌之一，而且这个品牌极其难得地在世界上几乎没有什么负面资产会破坏你未来的定位，这简直太完美了。守住它，那是天才。而为了讨好某个艺术总监就背弃它，我不明白你为什么会觉得这是品牌重塑，你只是放上了一个破坏了你原有诸多“认知资产 (Awareness assets)”的 Logo 罢了。\n\nLenny Rachitsky (39:28):\n感觉他们变得非常、非常有争议。他们对抗“现状 (Status quo)”的程度可能超过了应有的限度。我不知道。如果你是他们，你会怎么做？\n\nSeth Godin (39:36):\n你可能记得，当“国际煎饼屋 (International House of Pancakes，简称 IHOP)”决定虚假宣布更名为“国际汉堡屋 (International House of Burgers，简称 IHOB)”并更换新 Logo 时，他们只是为了博取“话题热度 (Buzz)”。这是一种“温蒂汉堡式 (Wendy's)”的推特策略。但话题热度卖不出汉堡。奥利奥 (Oreo) 在超级碗停电时发的那条推特博得了很多关注，但没有证据表明他们因此多卖出了一块饼干。他们不是为了娱乐我们而存在的。所以捷豹不会因为像你我这样的人在谈论他们换 Logo 就卖出更多车。能让他们卖出车的是“客户牵引力 (Customer traction，指产品在市场上的实际拉动力)”。他们需要做的是找到 50 位有影响力的人，让他们坐进一辆能以某种方式改变他们、转化他们的车里。\n\n(40:26):\n如果你回想一下特斯拉在 Model S 初期做的两件事，这非常有趣。第一件事是，据我认识的一位当时在那里工作的人说，当人们在超市停车场看到你时，谈论最多的就是门把手，因为门把手会自动弹出。它们弹出的方式虽然既烦人又危险，但非常引人注目。所以这就引发了对话。\n\n(40:52):\n然后会发生的是，他们会问，你觉得这车怎么样？你会说，上车吧，然后你切换到“狂暴模式 (Ludicrous mode)”，在 2.4 秒内从 0 加速到 60 英里，然后他们就会开始尖叫。这对你来说很有趣，也向乘客讲述了一个故事。这就是客户牵引力的开始，因为我在别的车里做不到这一点，对吧？相比之下，那个像小丑车一样的“赛博皮卡 (Cybertruck)”，它是故意制造对立的，大多数人不仅不想开，甚至不想在自己街区看到它，因为“制造对立”是卖不动货的。真正能卖货的是“实用性 (Utility)”，是帮助别人得到他们想要的东西。所以，皮卡这个类别，全美国最大的车型类别，就在那儿等着被占领。如果你是特斯拉这样的人，你可以“跨越鸿沟 (Cross the chasm，指新技术从早期采用者走向主流市场的过程)”。结果，他们决定搞一个噱头，这就不对了。这不是好的“产品管理 (Product management)”，也不是好的“营销 (Marketing)”。\n\nLenny Rachitsky (41:56):\n有趣。所以你认为赛博皮卡不会成功？\n\nSeth Godin (42:00):\n好吧，我认为，这取决于和谁比，对吧？福特 F-150 在某些年份贡献了福特 100% 以上的利润，这意味着如果没有 F-150 皮卡，就没有福特。这就是这个类别的分量。你拥有一辆有势头的车，以及一家赢得了很多人信任的上市公司。现在你面对的是皮卡这个类别，购买它的人有着非常明确的理由：向邻居展示你注重实用性。即使你从不用货箱，这也是开皮卡的故事。所以现在，如果你把这个类别中那些天生对变革和设计花招持怀疑态度的人拉过来，给他们一个除了变革和设计花招外一无所有的东西，不，他们是不会接受的。你本来可以卖给大量原本可能买福特 F-150 的人。那种“跨越鸿沟”才是让你变得真正举足轻重的方式。\n\nLenny Rachitsky (43:01):\n我觉得光是这个话题就能单独做一期播客了。真希望我们有更多时间。我要问最后一个问题，这是我找到的一句我也非常喜欢的你的名言，这其实让人想起了埃隆·马斯克，正如我们刚才谈到的。“领导力的秘诀很简单：做你所相信的。描绘一幅未来的蓝图。朝那里走。人们会跟随。”你能谈谈这个吗？\n\nSeth Godin (43:25):\n我可能说得太轻巧了，因为我需要强调的是，描绘未来的蓝图需要建立在“同理心 (Empathy)”的基础上。你不能只画一幅你想去的地方。你必须画一幅“他们”想去的地方，这种“非自恋 (Non-narcissism)”才是专业人士开展工作的地方。你没有权利仅仅因为你努力工作了就获得融资、获得市场份额或卖出好价钱。我们能做的是提供“服务 (Service)”。我们可以打开大门，帮助人们到达他们一直想去的地方。改变人们的欲望是非常困难的，但为人们提供一个机会，让他们到达他们原本就想去的地方，是非常有帮助的。\n\nLenny Rachitsky (44:14):\nSeth，这真是梦想成真。非常感谢你参加这档播客。感谢你刚才说的话。人们可以在哪里查看你的书？人们应该去哪里了解更多你的近况？任何你想分享的东西。\n\nSeth Godin (44:25):\n我不怎么活跃在社交媒体上，但我有一个博客：Seths.blog。如果你访问 Seths.blog/TIS，你会找到关于这本书、战略卡牌、可收藏巧克力棒以及我在此期间构思的任何其他东西的所有信息。\n\nLenny Rachitsky (44:42):\n巧克力。Seth，非常感谢你来到这里。\n\nSeth Godin (44:45):\n这些问题很棒，Lenny，我可以跟你聊上一整天。谢谢。\n\nLenny Rachitsky (44:48):\n我也一样。大家再见。\n\n(44:52):\n非常感谢您的收听。如果您觉得内容有价值，可以在 Apple Podcasts、Spotify 或您喜欢的任何播客应用上订阅本节目。此外，请考虑给我们评分或留下评论，因为这真的能帮助其他听众发现这个播客。您可以找到过去所有的剧集，或在 LennysPodcast.com 了解更多关于节目的信息。我们下期再见。",
  "chunks_count": 5
}