{
  "guest": "Shweta Shriva",
  "en": "Shweta Shrivastava (00:00):\nAre you proactively trying to challenge your own assumptions is extremely important, right? As a big enough product manager as well as a seasoned product leader, if you're not doing enough of that, then I think you might not be listening. If there's no conflict, if there's no contention, then something is missing.\nLenny (00:20):\nWelcome to Lenny's podcast where I interview world-class product leaders and growth experts to learn from their hard one experiences building and growing today's most successful products. Today, my guest is Shweta Shrivastava. Shweta is senior director of product management at Waymo, which if you're not familiar with Waymo, they're building self-driving cars that already live on the streets in San Francisco, LA and Phoenix. I actually got to take a ride in one ahead of this chat and you'll hear all about that in this episode.\n(00:48):\nBefore joining Waymo, was chief product officer at Nauto and AI started focusing on driver automation safety. Before that, she was head of product management at Amazon Web Services for their database and analytics services, and before that she was at Cisco. In our conversation, we delve into what it's like to work as a PM at Waymo and how it's both different and similar to software only products.\n(01:09):\nWe talk about their KPIs and goals at Waymo, including how they track progress towards a future of self-driving cars, how they build subtle cues and behaviors into the cars to create trust for the rider and also for other cars on the road. Plus Shweta's biggest lessons about building products and teams across the many companies she's worked at. I can't wait for the future of every car being self-driving, and it was super fun to learn about what goes into making this all happen. With that, I bring you Shweta Shrivastava after a short word from our sponsors.\n(01:40):\nThis episode is brought to you by Vanta, helping you streamline your security compliance to accelerate your growth. Thousands of fast-growing companies like Gusto, Com, Quora and Modern Treasury Trust Vanta to help build, scale, manage and demonstrate their security and compliance programs and get ready for audits in weeks, not months. By offering the most in-demand security and privacy frameworks such as SOC 2, ISO 27001, GDPR, HIPAA, and many more.\n(02:07):\nVanta helps companies obtain the reports they need to accelerate growth, build efficient compliance processes, mitigate risks to their businesses, and build trust with external stakeholders. Over 5,000 fast-growing companies use Vanta to automate up to 90% of the work involved with SOC 2 and these other frameworks. For a limited time, Lenny's podcast listeners get $1,000 off Vanta. Go to vanta.com/lenny. That's V-A-N-T-A.com/lenny to learn more and to claim your discounts. Get started today.\n(02:38):\nThis episode is brought to you by public.com. We want to tell you about their new treasury accounts, which earn a 4.8% yield on your cash. That is higher than a high yield savings account while still being backed by the full faith and credit of the US government. Treasury yields are at a 15-year-high, but buying US Treasuries is super complicated. If you go to a bank or navigate an ancient government website, or at least that was the case. Now you can move your cash into US Treasuries with the flexibility of a bank account.\n(03:09):\nYou can access your cash whenever you want, even before your treasury bills hit maturity. There are no hold periods, no settlement days, just a safe place to park your cash and earn a reliable yield. Public will automatically reinvest your treasury bills at maturity so you don't have to do anything to continue growing your yield. And you can manage your treasuries alongside stocks, ETFs, crypto, and any alternative assets. Do all your investing in one place and earn 4.8% a higher yield than a high yield savings account only with a treasury count at public.com/lenny.\n(03:47):\nShweta, welcome to the podcast.\nShweta Shrivastava (03:49):\nThank you. Great to be here.\nLenny (03:52):\nIt's great to have you. I thought we'd start with just a little bit about what it is you do at Waymo today. What are you and your team's responsible for at Waymo?\nShweta Shrivastava (04:02):\nYes, my team's responsible for three key areas, I would say. One is building a big part of the software that actually runs on board the fully autonomous vehicle and that determines the actual behavior and trajectory of the vehicle. Secondly, building the simulation tools and technologies that are required to validate the performance of the system. And then, a third one of the teams focused on commercially scaling our ride-hailing business, which is one of our key go-to market applications for the technology we're building.\nLenny (04:34):\nSo as you know, I arranged a ride for me in a Waymo in San Francisco. It was actually a really rainy day and it was quite mind blowing. I've never been in a self-driving car that had no driver sitting in the front. I have a Tesla and I turn on self-driving sometimes, but I've never experienced just sitting in the back and this thing just raises you around. Also, just like a memory hat is the app to call the Waymo, it feels like Google Maps except instead of just telling you how to get to a place like a car shows up and just takes you there and then you could change course as you're driving and it's crazy how quickly it became normal.\n(05:08):\nI'm just like, all right, we're just riding around San Francisco in this self-driving car and just sitting in the back and telling you where to go. And so anyway, I'm going to ask you a bunch of questions around this, but I guess thank you for arranging that ride. It was quite special.\nShweta Shrivastava (05:21):\nNo, I'm glad that you were able to do that on a rainy day. So that's a special bonus because, again, the technology has been performing very well, which has been very heartening for us to see.\nLenny (05:30):\nA few questions along these lines, one thing that I noticed that was really cool is we're trying to turn into a lane and there's cars coming in that lane just continuing to move and the car just kind of subtly was inching its way out, communicating through this interesting body language thing of just like, can someone let me in? And it's interesting, there's no eye contact involved and it's just like this, I don't know, gesture that you all have to develop.\n(05:54):\nAnd so, I guess, the question here is just like what have you all learned? And I don't know if you even work on that piece of it, but just, I'm curious how you think about creating this body language of the car communication system to help people understand what it's trying to do.\nShweta Shrivastava (06:07):\nWe're using a lot of human driving data to train our deep models. So it's important to make sure that the behavior of the car doesn't seem robotic, it can feel quite unnatural. And from the get-go, we focused on building a fully autonomous system. So it's important to have that familiarity, that trust, building with the riders where they're not daunted by technology, they don't feel like they're sitting in our walk. It has to feel very human-like, but in a good way. Making it safer than human driving, but then not making it feel unnatural.\n(06:40):\nAnd so we have deep learned models that can understand what the other road users' intent is. So, stuff like which way the pedestrian is looking or what is their body orientation because that could tell you which way they're headed. The road signs or the gestures, somebody is trying to stop the vehicle. The system can understand all those signals.\n(07:04):\nSo because we're using deep learn models trained on human driving, but again sort of in a good way. We discard the bad human driving data. We can mimic human driving behavior in a good way and that's why you saw the behavior that you saw yesterday. Now, one thing to note is we can't also just completely rely on explicit gestures and signs because a lot of driving has also social norms. If you're in a pretty clear section in San Francisco, maybe it's okay for pedestrians to cross even when they don't have a walk sign.\n(07:43):\nAnother city, another intersection might have a different social norm when it comes to pedestrians crossing the four-way stop sign or the crosswalk or what have you. And so, the car also has to learn about those social norms and be able to react to it. So, like I said, we don't realize how sophisticated, how interactive and how social driving really is. And with our artificial intelligence capabilities, we have been able to incorporate a lot of that into our system behavior.\nLenny (08:14):\nSo before Waymo, you worked at non self-driving software companies, you worked at Amazon, Cisco, a few other companies. I'm curious what you've found to be the biggest difference working in a company like Waymo versus a traditional software company.\nShweta Shrivastava (08:29):\nAs I said earlier, it's a highly complex, technically complex, system that we have built and we're improving. And if I may say, it's the most game changing product that anybody would ever work on.\nLenny (08:43):\nI don't know, Amazon's pretty cool, but I totally get you.\nShweta Shrivastava (08:46):\nI worked at Amazon, I'm a fan. And they have been pretty transformational with AWS and on the eCommerce side. But a fully autonomous driving system, it's also a very, very hard problem. So it's transformational from that perspective too. I would say that the PMC has to be able to go technically indeed, compared to what they would do in other software products. They have to be able to get into the details as much as needed. They have to be okay with uncertainty and ambiguity.\n(09:24):\nAgain, I think, that is part and parcel of any product management role, but it's even more so here. This is a long game and so you have to have the tenacity to play the long game and be continuously improving the product and make this thing a broad reality and future. So, those are some of the attributes. I would also say that there is some level of self selection here. You have to be driven by the mission to make the roads safer. We have about 1.35 million debts that happen every year across the world from traffic accidents and most of that is attributable to driving errors and driver distraction.\n(10:04):\nI've been guilty of checking my text messages while driving. I've seen other drivers do that. But a fully autonomous technology, you don't have that risk. That's the risk we're trying to minimize. So they have to be driven by that mission. One other thing is that the concept of MVP, which is so widely popular in the SaaS product management world or product management world, in general, has a whole new meaning here at Waymo when you work in a product like this because safety is on top of mind for all of us and can't really cut corners on safety.\n(10:42):\nThe MVP bar itself for safety is extremely high for us. So, the core product management philosophy also, getting an MVP out there and then iterating with the real world deployment. It applies, but it's just a different bar on that MVP.\nLenny (11:03):\nTouching again on safety and human behavior, I was thinking a little bit as we're chatting about, say of Tesla, which has self-driving car, self-driving capabilities and intellectually I know it's probably going to drive a lot better than I am, but I still feel like I need to disengage it occasionally when I'm on a curvy road. I'm just like, I don't know about this, I don't want to leave room for error if there's something that weird that happens.\n(11:30):\nAnd I imagine someone designing product for that weird behavior where I should probably trust it because it's probably a lot better driver than I am, but I don't know, I feel like I can do a better job. Is there anything you've learned about, I don't know, human behavior or how to design software for these sorts of experiences that maybe surprised you or thought was really interesting or that was really important?\nShweta Shrivastava (11:51):\nSince you mentioned Tesla, I just want to clarify that it's a different system that we are building, which is for Waymo, we started by solving the problem of fully autonomous driving without a human driver at the wheel from the get-go. It's not a driver assist or aid system which relies on the human driver taking over when there's a complex situation. So I think that expectation is built into that kind of a product and so the human folks who are using that product will also have that mindset that, hey, I should be ready to take over when the situation demands because we've built the system from the get-go to work in a fully autonomous mode without a human driver intervention at the wheel.\n(12:38):\nWe had to integrate this into our design philosophy from the very beginning that this has to feel credible, predictable and the writers have to be able to trust the system. So that has been sort of the core of the design philosophy. And so, what happens is, and I heard this from you as well, which resonated with me and I've heard this from a lot of our writers, that for the first five minutes of the ride it's, wow, is this thing really happening.\n(13:10):\nBut then it starts to feel very natural and as if this is how it was always meant to be. After the first five minutes, this is like uneventful. That's exactly how it's supposed to feel, but it's not a happenstance that it feels that way. The naturalness, the smoothness and still adhering to safety at all times are things that are designed into the system. And then we make sure that the rider has visibility into what's happening. If they're not wearing the seatbelt, the rider support would call them. So then they know, okay, there's a human that they can reach out to if they have an issue. They can look at the monitor in the car to understand what the car is seeing. So I think all these little things help develop that trust in the system.\nLenny (13:57):\nOn that same note, what's one thing that your teams have built that creates a lot of trust or maybe it was a surprisingly important element in creating trust in the experience in terms of the product, especially in, I don't know, either the app or in car experience.\nShweta Shrivastava (14:14):\nI don't know if I can point to one thing. Again, this is such a holistic experience that I think it has to be a bunch of small things to make it feel natural, transparent and trustworthy to the writers. And I can give you one example that I don't think I've mentioned in the discussion so far. So, again, because the system is designed to be cautious and defensive but still making adequate progress in the absence of traffic, it will never go above the speed limit. It doesn't go above the speed limit. It sticks or adheres to the speed limit or something that a lot of our riders actually appreciate about the system.\n(14:55):\nNow, it turns out that adhering to the speed limit even without traffic sometimes is not the best thing. You have to go below the speed limit and we realize that for driving in the slopes or the gradients, in clients in San Francisco, there are many of those. The human brain is trained to, or the human drivers are sort of in subconsciously, they slow down when they go downhill in those slopes. The autonomous vehicle doesn't necessarily have to do that if it's safe and if it's staying below the speed limit.\n(15:31):\nBut we learned that this is a more natural driving experience and this is what our riders would also expect in terms of the experience. So that's something that we then modify the behavior on.\nLenny (15:45):\nThat makes sense. I would want it to slow down. On the other hand, if I feel like I could trust that, I wish there was a button to just crazy mode, just go for it. Kind of digging a little bit into the product team's way of working, what are KPIs that you all use to track progress? I don't know, either amongst some of the teams you lead or also just broadly progress on self-driving technology. How do you know you're making progress? Is it just miles driven as something else?\nShweta Shrivastava (16:12):\nThere are tons of these metrics that we analyze on a daily basis, weekly basis depending upon what the metric is. But if I were to categorize them in two broad categories, that'd be the commercial and operational metrics and the system behavior metrics. So, one important thing to note here is that we're in a proof of concept or a pilot phase anymore. This is the service that we are offering to riders. Paid service in Phoenix and also it's open to public in San Francisco, so it's an actual service.\n(16:46):\nAnd so, we're tracking the commercial metrics in terms of the trips per week, the daily or weekly active users and all the funnel metrics that you can think of. Also, the operational metrics, the cost, right? Well, how much is the thing costing us to operate? So that's, I would say, all the stuff on the commercial scaling side. And then on the driver performance, the vehicle driver as the technology name as I alluded to earlier, the driver performance metrics, they span across safety, the compliance to the road rules, our ability to make adequate progress as in not get unduly stopped or stranded in dense traffic situations as an example.\nLenny (17:32):\nWhat are just specific metrics there? Anything you could share just like what is the actual goal in one of those teams?\nShweta Shrivastava (17:38):\nThe goal here is to be able to drive safer than humans. Now, we don't really have one standard human driving benchmark, safety benchmark, that everybody uses, but we do gather enough of that data. We have access to enough of that data to form an opinion on or a metric on or benchmark on what does human driving look like, how many collisions, as an example, a human driver would have every a hundred thousand mile. And then we want to make sure that our performance is better than that.\n(18:19):\nSo that's simplifying, right? And several things go into both calculating the benchmark as well as our performance against that benchmark. But that at the core of it, that's what we're trying to do. So that's on the safety side and then I would say on the stops and strands, which is trying to, which goes in the different direction. Hey, you can be very safe if you're not moving at all. That's not what we're building. We need to make sure that the riders get to their destination on time. So it has to be appropriately assertive and be making the right progress.\n(18:53):\nAnd, so again, how much did the vehicle slow down unduly, right? Or, in how many instances in a given week did it have to rely on a rescue help? Those are the situations that we want to avoid. And then, how much did we slow down the traffic for other users? So we again do extensive benchmarking and look at the priors, et cetera, and really understand would an adequate performance be there and measure our own against that.\nLenny (19:28):\nAwesome. Today's episode is brought to you by Elements. I just recently discovered this stuff actually from another podcast and it is such sweet, salty goodness. Element is a tasty electrolyte drink mix with a science-backed electrolyte ratio. And unlike most electrolyte drinks, there's no sugar coloring, artificial ingredients, gluten or any other BS. Getting enough electrolytes helps prevent and eliminate headaches, muscle cramps, fatigue, sleeplessness and other common symptoms of electrolyte deficiency.\n(19:57):\nElement is the exclusive hydration partner to team US USA Weightlifting and many other Olympic athletes. Also, dozens of NBA and NFL teams and players rely on Element to stay hydrated along with Navy SEAL teams, FBI sniper teams and the Marines. You can try Element totally risk-free. If you don't like it, you can share it with a salty friend and they'll give you your money back, no questions asked. To give it a shot, go to drinklmnt.com/lenny and you'll get a free sample pack with any purchase, which includes one packet of every flavor.\n(20:27):\nMy favorite is watermelon salt. You won't find this offer publicly available, so you have to head to drinklmnt.com/lenny to take advantage of this offer. Stay salty.\n(20:38):\nI'm guessing you're not going to have an answer to when do we think we'll have fully self-driving level five autonomy. So let me ask you a different approach to that question of just what's most in the way of us getting to full self-driving where we don't have to do anything ever? Is it like miles driven? Is it like tech breakthroughs that still have to happen? Is it regulation and just cities being like, okay, it's fine. What's the biggest blocker at this point or bottleneck?\nShweta Shrivastava (21:01):\nSo let me share my opinion on the L5.\nLenny (21:01):\nCool.\nShweta Shrivastava (21:06):\nSo L for those who might not be very familiar with this term, L2, L3 is still very much driver assist. It gets to some level of autonomy but then it relies on the human driver at the wheel to be able to take over complex situations. L4 fully autonomous without a human driver at the wheel and no expectation of a human driver at the wheel. That's what we've been focusing on. L5 would be in any kind of road completely unstructured, off-roading in that kind of an environment, be able to drive without any map, without any priors, what have you.\n(21:44):\nAnd we believe that by offering the kind of service that we are offering in Phoenix and in San Francisco through the rest of this year and other cities in future is it helps realize that the dream of the fully autonomous driving, in a big way, without having to go to L5. So I think that the technology is already there. L5, I'm not sure, maybe that becomes more niche, et cetera. It solves very specific use cases.\n(22:16):\nIn terms of the blocker, I would say, the technology is there, but it still needs improvements. Especially we were not able to drive in snow yet. Something that we have to tackle in future.\nLenny (22:25):\nI could barely drive in slow.\nShweta Shrivastava (22:28):\nYeah. And I don't like to drive in snow. Even I, I avoid snowy days. But that is something that we still have to build as a capability in driving fully in snow now. So that's great.\nLenny (22:39):\nMakes sense. Clearly, there's a lot of little things, a lot of big things and it's a really interesting point about we don't need L5, L4 is great for most people. Maybe a last question along this track and then I want to pivot to a different area. So Waymo's been this long-term investment for Alphabet and many PMs often try to create buy-in and keep buy-in for large investment and large project. I know this is a different scale of investment than what most PMs work through. But is there anything you've learned about keeping leaders bought in and excited and continuing to invest in a project for years and years? Specifically just like tactics that keep people excited and bought into a long-term investment?\nShweta Shrivastava (23:21):\nYeah. So first of all, we are fortunate that we have the backing from Alphabet and other investors. And the autonomous vehicle industry is interesting and I think the last year has been interesting with more consolidation happening. So I think the name of the game here is to show progress, show meaningful progress and meaningful progress, not just in terms of technology but in terms of commercial deployments. That is the rubber meets the road, if you will, phase off of the product.\n(23:54):\nAnd the results have to speak for themselves, for our investors to have the confidence in us. So notwithstanding what's happening to other AB companies in the industry, it's about what we are doing. And then look at the progress that we've been making and where we are headed. And the fact that we've been accelerating our milestones and going through our own expectations, I think, these are very positive signals to our investors as well.\n(24:23):\nAnother startup as well, t's not about you have to do what's the right thing for the business. Your focus is on creating value for the customers, creating value for the riders. You have to build a business that makes sense and the investors see that too. Or we're not going to do something unnatural or something that doesn't align with the business goals in order to gain any short term brownie points with investors. I think it doesn't work that way and the investors will see through that too.\n(24:52):\nDefinitely Alphabet has been our backer for forever. So, it's really about focusing on building the right business and doing the right thing for the users.\nLenny (25:03):\nI think that's a great takeaway that if you're finding that there's a buy-in and continued support for what you're building, focus on momentum and showing success. It's pretty simple if you think about it. And it's hard to cut something that's just showing success. And so, even at the scale of Waymo, it's a great lesson. So that makes sense.\nShweta Shrivastava (25:03):\nAbsolutely.\nLenny (25:24):\nWe talked a bit about other companies you've worked at and so I want to kind of zoom out a little bit. And I just want to ask, you worked at Amazon, Cisco, Waymo now, startup you mentioned. What are just some of the biggest lessons you've learned about building successful teams and successful products?\nShweta Shrivastava (25:40):\nIn terms of the product, whether you're working for a big company or a startup, the core product management tenant is still the same, which is, you have to work backwards from the customer problem or the user problem. Building a technology for the sake of it doesn't really go that far, so you really have to focus on the, what are you building, who are you building it for and what problem are you solving?\n(26:05):\nAnd this applies in any context. And Amazon has this great process where the PMs have to write a press release for the finished product even before they start building the product. That's the first thing that they have to do is to write that press release like the product is about to launch today. What are you telling the users about that product? Really forces them to think about the value proposition more thoroughly.\n(26:33):\nAnd I know many other companies are starting to look at that practice as well, but I find it very effective.\nLenny (26:39):\nDo you do that at Waymo or do you folks do that? Is there kind of a system there or?\nShweta Shrivastava (26:43):\nThe explicit PR FAQ process that Amazon follows is, I think, Waymo has its own version of it. But it is about sort of focusing on the customer problem. Now, Waymo is also a very different kind of product. It's highly integrated. And different types of product management flavors, if you will. Some are more technically focused and technically deep, some are more commercially focused. So they all adapt. They have their versions of working backwards from the customer problem. But that still remains the core tenant in my mind.\n(27:13):\nThe other big lesson, at least working in some of the large companies that I have had is it's also very important to know what you're not building. And this one is not only in big companies, I would say even in startups, it's extremely important to know what you're not building because you could very easily get swayed by customer X telling you to do this, customer y telling you to do that. And a product that tries to be all things to all people usually doesn't end up going anywhere.\n(27:42):\nSo that focus, that prioritization and being crisp about what you're building and what you're not building is very important. And then, in the context of the large companies, what I was going to say was, I think, is the classic innovator's dilemma. The large companies tend to be the market share leaders in their focus areas. And so, the product team and the product leaders can get very incremental in their product strategy and then lo and behold, you see an upstart that comes and disrupts them.\n(28:16):\nAnd so, I have definitely learned the lesson that you need to disrupt yourself before somebody else does because it's going to happen. It's inevitable. And large companies that are constantly challenging themselves and disrupting their own models or their own product capabilities to bring those, even something more transformational for the customers, are the ones that really succeed. And I think this is where the product leaders have to bring in that mindset of, hey, are we getting too complacent or it's time to just.\nLenny (28:46):\nThat's such a good reminder. Is there an example of you doing that or something you worked on where you got the company to commit to something that maybe could have been a threat from a disruptor or maybe even just seen that happening at a company? Just like is there a specific project or investment that comes to mind?\nShweta Shrivastava (29:02):\n[NEW_PARAGRAPH]At Amazon, I was the first PM and then I drove the team around it for a no-code application development platform called Honey Code. So that was a brand new service. Amazon had never delved in that space before. It was more infrastructure focused and this was first of its kind service that the team worked on. And this has played out many times in my career, and so I am a big believer in disrupting yourself before somebody else does it.\nLenny (29:33):\nWhat do you think is the most underrated PM skill that you suggest people, maybe especially early in their career, that they should focus on maybe that they're probably not thinking about?\nShweta Shrivastava (29:42):\nI think the listening and empathy are the top ones. These are very important because I think when folks think about product management, they think about the influencing without authority and prioritization and being able to write with PR, et cetera, all those things are sort of more top of mind. The listening and empathy, I wouldn't say that they are underrated, I think is there's now a lot more recognition that these are sort of core skills if you want to be able to influence a lot without authority.\nBut I think it's easier said than done. You really have to come in with that growth mindset, with that beginner's mindset, be able to absorb and just learn and listen and don't jump in with ideas necessarily, right? Take the time to formulate that opinion to really learn and understand the customer and the market and really be true to that tenant of working backwards from the customer problem, not just say because it's become such a platitude now in the product world.\nLenny (30:42):\nYeah, there's a book. There's a whole book called Working Backwards now.\nShweta Shrivastava (30:46):\nYes. That is the one thing that I would say that somebody who's starting out as a product manager really try to follow that principle. And then listening and empathy is going to go a long way in terms of being able to do that.\nLenny (31:00):\nOn listening and empathy, what do you think helped you most develop those two skills?\nShweta Shrivastava (31:06):\nSo I think for me, part of it was just doing this over and over again in different environments, in different product launches that I have led in different types of companies that I've worked with. In startup as well as big company, the dynamic is different. And, again, the team that you're working with in different companies have a different culture. So, when you're working with let's say an engineering leader, being able to understand what are his or her constraints? Where is he or she coming from? What does impact look like to that person? And then understanding where you're aligned, where you're not aligned are things that you have to develop and start paying a lot more attention to as you rise in your career or go up the ladder.\n[NEW_PARAGRAPH]And I think a lot of that for me came by just being in different kind of situations and different kind of environments.\nLenny (32:08):\nYeah. That's what I often say also, a lot of this just comes from doing it again and again and again. There's not going to take a course and then just I'm a great listener, I'm done.\nShweta Shrivastava (32:18):\nYeah, no, it doesn't.\nLenny (32:19)\nYeah, which is not easy to ... It'd be nice if there's a book you read and then you become a great listener and a great empathizer.\nShweta Shrivastava (32:24):\nWell, I think one take or one that I could share is just challenging your own assumptions. So, I think listening with an open mind but then are you proactively trying to challenge your own assumptions is extremely important. As a big enough product manager as well as a seasoned product leader, if you're not doing enough of that, then I think you might not be listening well, right? Or you might not be picking on the cues. If there's no conflict, if there's no contention, then something is missing.\nLenny (33:03):\nIt's not often you're going to be always right.\nShweta Shrivastava (33:04):\nYeah.\nLenny (33:05):\nMaybe one more question along these lines. You've been promoted many times, now you're in a place where you promote people and I'm curious for someone that maybe wants to get promoted or struggling to get promoted, what would you say are probably the reasons they aren't? Or what do you think people should focus on if they want to just get a promotion and many promotions in their career?\nShweta Shrivastava (33:28):\nI'm going to say something that might sound a little cheeky, but I think the way to get promoted is to not want it too badly. It is about you have to focus on the impact. It's about having an impact and then doing what is right for the business. So not sort of optimizing things for your promotion, which look, we are all ambitious human beings. And there's nothing wrong with wanting a promotion, just to be clear, and there's nothing wrong with being ambitious, but then focus on the impact.\n(34:03):\nAre you working on the right things that will have the right outcome for the business? Because if you are and if you are giving it to your 100%, that will be visible. And making your ambitions known to your manager, to your leader, is a good thing that you should. And so, when the right opportunity comes, at least your leader or manager is aware that, hey, this person wanted to work on something more challenging, so maybe I put her on that project.\n\nBut you have to be focused on really creating the right impact for the company and not optimizing for yourself to get promoted. If you try to maneuver that too much, it becomes visible and it's not a positive signal to the organization when they can see that that's what you're trying to do. And it also distracts you from the things that you need to be focusing on. So, I would say, improve your skillset as a product manager. Make sure that you're made your vision known that you want to work on challenging high visibility projects or products that really test or stretch your skills and then be really dedicated to that cause and work on what has the business impact for the company, do the right things.\nLenny (35:15):\nI really like that advice. I 100% agree with all of that. I have a couple final Waymo questions and then we're going to get to our very exciting lightning round. Just for folks that maybe want to try out Waymo, so maybe just like where's it live now? When do you think it'll roll out to new cities? And then, how do people try it and use it if they live in one of those cities? If that's possible.\nShweta Shrivastava (35:37):\nWe are already in the Phoenix metro area and in San Francisco. So in those cities you can just go and download the app and you can use the service. We have done initial fully autonomous testing in LA. And we're going to be expanding in LA through the rest of the year, so stay tuned for more development on that front. And then, we do have a list of cities that we're going to be rolling out in the coming years, but unfortunately, I can't share that list just as yet.\nLenny (36:04):\nAnd if someone lives in one of those cities, is there a way they could try to get on a wait list or try to use this stuff or is it closed doors right now?\nShweta Shrivastava (36:11):\nSo it is open doors in San Francisco and Phoenix.\nLenny (36:15):\nGot it. So you just sign up and you get on the waitlist and then you might get off?\nShweta Shrivastava (36:17):\nIn Phoenix, I don't even think that there is a wait list.\nLenny (36:20):\nOh wow.\nShweta Shrivastava (36:21):\nOn the waitlist.\nLenny (36:22):\nI got to move to Phoenix. That's cool.\nShweta Shrivastava (36:24):\nOr just wait, just yeah, a little while in San Francisco. But yeah, Phoenix is great. So, if you want to move there, that's totally fine.\nLenny (36:33):\nNo, I'm going to start packing tonight. Just joking. Anything else you want to touch on before we get to our very exciting lightning round?\nShweta Shrivastava (36:40):\nNo, I think we talked about a bunch of things. It's been a great conversation so far.\nLenny (36:45):\nIt's not over yet. We've reached our very exciting lightning round. I have six questions for you. Are you ready?\nShweta Shrivastava (36:51):\nBring it on.\nLenny (36:52):\nOkay, here we go. What are two or three books that you've recommended most to other people?\nShweta Shrivastava (36:58):\nCrossing The Chasm by Geoffrey Moore and Clayton Christensen's Innovator's Dilemma are still sort of the two classics in product management that I have quoted a lot and I have recommended to many folks.\nLenny (37:12):\nAwesome. I've got both in my little bookshelf behind me.\nShweta Shrivastava (37:14):\nYeah, me too.\nLenny (37:15):\nWhat's a favorite recent movie or TV show that you've really enjoyed?\nShweta Shrivastava (37:19):\nI have an eight-year-old daughter, so my viewing choices are very much influenced by what she watches. But let's see, I did enjoy the Top Gun, the new Top Gun movie, Top Gun Maverick quite a bit. We watched it in the theater and visuals were just fantastic. I think it was also inspiring to see what Tom Cruise was able to do and it's quite a feat that he pulled off at this age. It was very inspirational.\nLenny (37:49):\nFully agree. Favorite interview question that you like to ask people?\nShweta Shrivastava (37:53):\nEspecially at the senior levels, I always ask them, when was one time that you failed and what did you learn from it? I've seen that folks who has either say that they've never failed or they're trying a success story as a failure story are usually, they're disingenuous or have not had the depth of experience. So I ask that question and I'm looking for some real solid examples there.\nLenny (38:21):\nAwesome. What's a favorite recent product that you've discovered that you love?\nShweta Shrivastava (38:27):\nI wouldn't say that I recently discovered it. It's on my wishlist to buy very soon. I'm all for sustainable mobility, so I am shopping for a foldable ebike so I can do more mountain biking without doing mountain biking. That's the sustainable part for me, I guess.\nLenny (38:47):\nIs there a specific model or brand that you are most excited about?\nShweta Shrivastava (38:50):\nI would take recommendations from you, but I'm still shopping. I think electric, there are a couple.\nLenny (38:57):\nAll right. Folks who have recommendations, leave suggestions in the comments.\nShweta Shrivastava (39:01):\nPlease do.\nLenny (39:01):\nAnd what's something relatively minor you've changed in your team's product development process that you've found has had a tremendous impact?\nShweta Shrivastava (39:09):\nI wouldn't say that this is a product development process, although, in different parts of phase of my career, I have definitely instituted different types of processes and tools that have helped improve the product development. But I would give you an interesting one that I use a lot in my prior company and then I use a different form of it here in Waymo is what I used to call as the rule of seven. If there have been seven emails in an email thread and you still haven't resolved the issue, just call the person or get in a room huddle, resolve it live.\n(39:43):\nBut the long email exchanges that don't converge and go anywhere I feel are a waste of time for many people. So I'm like, you've got to a limit. Waymo is a bigger company, so the limit's more like 10, but if you haven't resolved something within an X number of emails, please just get on a call, get in a room and get it resolved.\nLenny (40:04):\nI love that. And the idea is it's seven if it's like you and that person going back and forth seven times?\nShweta Shrivastava (40:09):\nYeah. Or all of people are just going back and forth. And then adding more people and then everybody chime in, but where is this thing really headed?\nLenny (40:21):\nI love that. Final question. If anyone gets to ride in a Waymo, what's a pro tip for them to have an awesome experience?\nShweta Shrivastava (40:29):\nBring your favorite playlist, sit back and enjoy the ride.\nLenny (40:33):\nGreat. When I was on my right, I turned on some jazz and it was raining outside. It was real cozy.\nShweta Shrivastava (40:39):\nBut did you actually do it on the ... So, so there's a feature, if you have a Google, you have to download the Google Assistant, but you can actually play your playlist list in the car.\nLenny (40:49):\nThat's cool. No, I chose a station that was in there just like jazz music.\nShweta Shrivastava (40:52):\nOkay. Yeah.\nLenny (40:39):\nYeah. Okay. This is great. All right. Hopefully I get another ride someday.\nShweta Shrivastava (40:56):\nYes, you should.\nLenny (40:57):\nShweta, this was amazing. I am going to start packing my bags for Phoenix. I'm going to sell my car. Everything's going to change\nShweta Shrivastava (41:04):\nExactly what we wish for.\nLenny (41:07):\nThere's your KPI. Thank you again for being here. Two final questions, where can folks find you online if they want to learn more, reach out, ask you maybe some questions, maybe apply to join Waymo if you're hiring, and how can listeners be useful to you?\nShweta Shrivastava (41:20):\nYou can find me on LinkedIn. And then if you are interested in opportunities at Waymo, go to Waymo career web page. You should see all the open positions. It's okay for you to reach out to me on LinkedIn as well for product management roles. How can listeners be useful to me? I would say, hey, sign up for the ride in Phoenix or San Francisco and LA when we open up, give us feedback.\nLenny (41:43):\nAwesome. Shweta, thank you again for being here.\nShweta Shrivastava (41:47):\nThank you. It was great to have this conversation.\nLenny (41:50):\nBye everyone. Thank you so much for listening. If you found this valuable, you can subscribe to the show on Apple Podcast, Spotify, or your favorite podcast app. Also, please consider giving us a rating or leaving a review as that really helps other listeners find the podcast. You can find all past episodes or learn more about the show at lennyspodcast.com. See you in the next episode.\n",
  "zh": "这是一场长期的竞赛，所以你必须有坚持打持久战的韧性，持续改进产品，让这件事成为广泛的现实和未来。所以，这些是一些必备的特质。我还想说，这里存在一定程度的自我筛选。你必须被让道路更安全这个使命所驱动。全球每年因交通事故导致约135万人死亡，其中大部分可归因于驾驶失误和驾驶员分心。\n(10:04):\n我自己也曾在开车时查看短信。我见过其他司机也这样做。但有了完全自动驾驶技术，就没有这种风险了。这就是我们试图降低的风险。所以他们必须被这个使命所驱动。另一件事是MVP（最小可行产品）的概念，在SaaS产品管理领域或整个产品管理领域非常流行，但在Waymo这样的产品中有了全新的含义，因为安全是我们所有人的首要考虑，在安全方面真的不能偷工减料。\n(10:42):\n对我们来说，MVP在安全方面的标准本身就极高。所以，核心的产品管理理念，推出MVP然后通过实际部署迭代，这一点是适用的，但对MVP的标准完全不同。\nLenny (11:03):\n再次谈到安全和人类行为，我们聊天时我想到了Tesla，它有自动驾驶能力。理智上我知道它可能比我开得好得多，但当我在弯曲的道路上时，我仍然觉得需要偶尔关闭它。我就是不太确定，如果发生什么奇怪的事情，我不想留下出错的余地。\n(11:30):\n我想象为这种奇怪行为设计产品的人会怎么想——我应该相信它，因为它可能是比我好得多的驾驶员，但我不知道，我觉得我能做得更好。关于人类行为，或者如何为这类体验设计软件，你有没有学到什么让你感到惊讶的，或者觉得非常有趣或非常重要的东西?\nShweta Shrivastava (11:51):\n既然你提到了Tesla，我想澄清一下，我们正在构建的是一个不同的系统。对于Waymo来说，我们从一开始就致力于解决完全自动驾驶的问题，方向盘上没有人类驾驶员。这不是一个依赖人类驾驶员在复杂情况下接管的驾驶辅助系统。所以我认为这种期望已经内置到那类产品中，使用该产品的人也会有这样的心态：嘿，当情况需要时我应该准备好接管。因为我们从一开始就构建了这个系统，让它在完全自动驾驶模式下工作，无需方向盘上的人类驾驶员干预。\n(12:38):\n我们必须从一开始就将这一点整合到我们的设计理念中：这必须让人感觉可信、可预测，乘客必须能够信任这个系统。所以这一直是设计理念的核心。所以，会发生什么呢，我从你那里也听到了这个，这与我产生了共鸣，我也从很多乘客那里听到过，在乘车的前五分钟，反应是：哇，这真的在发生吗？\n(13:10):\n但之后就开始感觉非常自然，仿佛本来就应该是这样。五分钟后，这就像平淡无奇。这正是它应该给人的感觉，但它以这种方式给人感觉并非偶然。自然、流畅，同时始终遵守安全规则，这些都是设计到系统中的。然后我们确保乘客能够了解正在发生什么。如果他们没有系安全带，乘客支持会打电话给他们。这样他们就知道，好的，如果有问题可以联系到真人。他们可以看车内的显示器，了解汽车看到了什么。所以我认为所有这些小细节都有助于建立对系统的信任。\nLenny (13:57):\n同样的话题，你的团队构建的什么东西创造了很多信任？或者在创造体验信任方面，哪个元素出乎意料地重要？特别是在应用或车内体验方面。\nShweta Shrivastava (14:14):\n我不知道能否指出一件事。同样，这是一种整体体验，我认为必须是一堆小事情才能让乘客感觉自然、透明和值得信赖。我可以举一个到目前为止讨论中还没有提到的例子。所以，再次强调，因为系统被设计为谨慎和防御性的，但在没有交通的情况下仍然保持适当的行驶速度，它永远不会超过限速。它不会超速。它遵守或坚持限速，这是我们很多乘客非常欣赏系统的一点。\n(14:55):\n现在，事实证明，即使没有交通，遵守限速有时也不是最好的做法。你必须低于限速，我们意识到在旧金山的坡道或坡度上驾驶时，有很多这样的情况。人类的大脑经过训练，或者说人类驾驶员潜意识中会在下坡时减速。如果安全且保持在限速以下，自动驾驶汽车不一定要这样做。\n(15:31):\n但我们了解到，这是一种更自然的驾驶体验，也是我们的乘客对体验的期待。所以这是我们后来修改行为的一个方面。\nLenny (15:45):\n这很有道理。我也希望它减速。另一方面，如果我觉得我可以信任它，我希望有一个按钮可以切换到疯狂模式，就放手去开。稍微深入一下产品团队的工作方式，你们用什么KPI来跟踪进度？我不知道，无论是你领导的一些团队，还是整体上自动驾驶技术的进展。你们如何知道自己在进步？只是行驶里程数还是其他什么？\nShweta Shrivastava (16:12):\n我们每天、每周分析大量这些指标，具体取决于指标是什么。但如果我要把它们分为两大类，那就是商业和运营指标，以及系统行为指标。所以，这里要注意的一个重要事项是，我们不再处于概念验证或试点阶段。这是我们向乘客提供的服务。在Phoenix是付费服务，在旧金山也向公众开放，所以这是一个实际的服务。\n(16:46):\n因此，我们在跟踪商业指标，比如每周行程数、日活跃用户或周活跃用户，以及你能想到的所有漏斗指标。还有运营指标，成本，对吧？运营这个东西花费了我们多少钱？所以这是，我想说，商业扩张方面的所有内容。然后在驾驶性能方面，车辆驾驶员，正如我之前提到的技术名称，驾驶性能指标涵盖安全性、对道路规则的遵守、我们充分前进的能力，比如在密集交通情况下不会不当停止或被困。\nLenny (17:32):\n那里有什么具体的指标吗？你能分享一些吗，比如这些团队中的实际目标是什么？\nShweta Shrivastava (17:38):\n这里的目标是能够比人类驾驶得更安全。现在，我们确实没有一个每个人都使用的标准人类驾驶基准、安全基准，但我们确实收集了足够的数据。我们有足够的数据来形成一个关于人类驾驶是什么样子的观点或指标或基准，例如，人类驾驶员每行驶十万英里会发生多少次碰撞。然后我们要确保我们的表现比这更好。\n(18:19):\n所以这是简化了，对吧？无论是计算基准还是我们对该基准的表现，都涉及很多事情。但这就是核心，这就是我们试图做的。所以这是在安全方面，然后我会说在停止和搁浅方面，这是朝着不同的方向。嘿，如果你根本不动，你可以非常安全。但这不是我们正在构建的。我们需要确保乘客按时到达目的地。所以它必须适当自信并取得正确的进展。\n(18:53):\n那么，车辆不当减速了多少，对吧？或者，在给定的一周内，有多少情况下它不得不依赖救援帮助？这些是我们想要避免的情况。然后，我们给其他用户造成了多少交通延误？所以我们再次进行广泛的基准测试，查看先例等，真正了解什么是适当的表现，并衡量我们自己的表现。\nLenny (19:28):\n太棒了。今天的节目由Element赞助。我最近才从另一个播客中发现了这个东西,它真是甜美、咸味的美好。Element是一种美味的电解质饮料混合物，具有科学支持的电解质比例。与大多数电解质饮料不同，它没有糖、色素、人工成分、麸质或其他乱七八糟的东西。获得足够的电解质有助于预防和消除头痛、肌肉痉挛、疲劳、失眠和其他常见的电解质缺乏症状。\n(19:57):\nElement是美国举重队和许多其他奥林匹克运动员的独家补水合作伙伴。此外，数十支NBA和NFL球队及球员依靠Element保持水分,还有海豹突击队、FBI狙击队和海军陆战队。你可以完全无风险地试用Element。\n\n如果你不喜欢，可以分享给一个爱挑剔的朋友，他们会无条件退款。试试看的话，请访问 drinklmnt.com/lenny，任何购买都会获得免费样品套装，包含每种口味各一包。\n(20:27):\n我最喜欢的是西瓜盐味。这个优惠不对外公开，所以你必须访问 drinklmnt.com/lenny 才能享受这个优惠。保持元气满满。\n(20:38):\n我猜你不会回答我们什么时候能实现完全自动驾驶的 L5 级别自动化。所以让我换个角度问这个问题：在实现完全自动驾驶——我们永远不需要做任何操作——的道路上，最大的障碍是什么？是行驶里程数吗？是还需要实现的技术突破吗？还是监管问题，就是城市要说\"好的，没问题\"？目前最大的阻碍或瓶颈是什么？\n\nShweta Shrivastava (21:01):\n让我分享一下我对 L5 的看法。\n\nLenny (21:01):\n好的。\n\nShweta Shrivastava (21:06):\n对于那些可能不太熟悉这个术语的人来说，L2、L3 仍然很大程度上是驾驶辅助。它达到了一定程度的自动化，但仍然依赖方向盘后的人类驾驶员来处理复杂情况。L4 是完全自动驾驶，方向盘后没有人类驾驶员，也不需要人类驾驶员。这就是我们一直专注的方向。L5 则是在任何类型的道路上，完全非结构化的环境，越野那种环境，能够在没有任何地图、没有任何先验信息的情况下驾驶。\n(21:44):\n我们相信，通过提供我们今年在 Phoenix 和 San Francisco 提供的这种服务，以及未来在其他城市提供的服务，它能够在很大程度上帮助实现完全自动驾驶的梦想，而不必达到 L5。所以我认为技术已经成熟了。L5，我不确定，也许那会变得更加小众等等。它解决的是非常特定的用例。\n(22:16):\n至于障碍，我想说，技术是有了，但仍然需要改进。特别是我们还不能在雪地里驾驶。这是我们未来必须解决的问题。\n\nLenny (22:25):\n我在雪地里都很难开车。\n\nShweta Shrivastava (22:28):\n是的。我也不喜欢在雪地里开车。我也会避开下雪天。但这是我们仍然需要构建的能力，在雪地里完全驾驶。所以这很好。\n\nLenny (22:39):\n有道理。显然，有很多小事情，很多大事情，关于我们不需要 L5、L4 对大多数人来说已经很好的观点非常有趣。也许沿着这条线最后一个问题，然后我想转向另一个领域。Waymo 一直是 Alphabet 的长期投资，许多 PM 经常试图为大型投资和大型项目争取支持并保持支持。我知道这与大多数 PM 经历的投资规模不同。但关于保持领导层的支持和兴奋，并在多年中持续投资一个项目，你学到了什么吗？特别是让人们对长期投资保持兴奋和支持的具体策略？\n\nShweta Shrivastava (23:21):\n是的。首先，我们很幸运得到了 Alphabet 和其他投资者的支持。自动驾驶汽车行业很有意思，我认为去年很有意思，发生了更多整合。所以我认为这里的关键是展示进展，展示有意义的进展，不仅仅是技术方面的有意义进展，还有商业部署方面的。那才是产品真正落地的阶段。\n(23:54):\n结果必须自己说话，让我们的投资者对我们有信心。所以无论行业内其他自动驾驶公司发生了什么，重要的是我们在做什么。然后看看我们取得的进展以及我们的方向。而且我们一直在加速我们的里程碑，超越我们自己的预期，我认为这些对我们的投资者来说也是非常积极的信号。\n(24:23):\n另外作为初创公司，你必须做对业务正确的事情。你的重点是为客户创造价值，为乘客创造价值。你必须建立一个有意义的业务，投资者也看到了这一点。我们不会做一些不自然的事情，或者不符合业务目标的事情，只是为了在投资者那里获得短期加分。我认为那样行不通，投资者也会看穿的。\n(24:52):\nAlphabet 一直是我们的支持者。所以，真正重要的是专注于建立正确的业务，为用户做正确的事情。\n\nLenny (25:03):\n我认为这是一个很好的收获，如果你发现对你正在构建的东西有持续的支持，那就专注于动力和展示成功。如果你仔细想想，这很简单。很难砍掉一个不断展示成功的项目。所以，即使在 Waymo 的规模上，这也是一个很好的教训。这说得通。\n\nShweta Shrivastava (25:03):\n完全正确。\n\nLenny (25:24):\n我们聊了一些你工作过的其他公司，所以我想稍微扩大一下视野。我只是想问，你在 Amazon、Cisco、现在的 Waymo 以及你提到的初创公司工作过。关于建立成功的团队和成功的产品，你学到的一些最重要的经验是什么？\n\nShweta Shrivastava (25:40):\n就产品而言，无论你是在大公司还是初创公司工作，核心的产品管理原则仍然是一样的，那就是，你必须从客户问题或用户问题出发反向思考。为了技术而构建技术真的走不了多远，所以你真的必须关注，你在构建什么，你为谁构建，你在解决什么问题？\n(26:05):\n这适用于任何场景。Amazon 有一个很好的流程，PM 必须在开始构建产品之前，为成品写一份新闻稿。这是他们必须做的第一件事，就是写那份新闻稿，就像产品今天即将发布一样。你要告诉用户关于这个产品的什么？这真的迫使他们更彻底地思考价值主张。\n(26:33):\n我知道许多其他公司也开始研究这种做法，但我发现它非常有效。\n\nLenny (26:39):\n你们在 Waymo 这样做吗？你们有这样的系统吗？\n\nShweta Shrivastava (26:43):\nAmazon 遵循的明确的 PR FAQ 流程，我认为 Waymo 有自己的版本。但它是关于专注于客户问题的。现在，Waymo 也是一种非常不同的产品。它是高度集成的。有不同类型的产品管理风格。有些更注重技术和技术深度，有些更注重商业。所以他们都会适应。他们有自己的从客户问题出发的版本。但在我看来，这仍然是核心原则。\n(27:13):\n另一个重要的经验，至少在我工作过的一些大公司中，知道你不构建什么也非常重要。这不仅仅是在大公司，我想说即使在初创公司，知道你不构建什么也极其重要，因为你很容易被客户 X 告诉你做这个、客户 Y 告诉你做那个所左右。一个试图满足所有人所有需求的产品通常不会有什么结果。\n(27:42):\n所以这种专注、这种优先级排序以及明确你在构建什么和不构建什么非常重要。然后，在大公司的背景下，我想说的是，我认为这是经典的创新者困境。大公司往往是其关注领域的市场份额领导者。因此，产品团队和产品领导者在产品策略上可能会变得非常渐进，然后你看，一个新兴公司来了并颠覆了他们。\n(28:16):\n所以，我确实学到了一个教训，那就是你需要在别人颠覆你之前先颠覆自己，因为这是不可避免的。那些不断挑战自己并颠覆自己的模式或产品能力，为客户带来更具变革性的东西的大公司，才是真正成功的公司。我认为这就是产品领导者必须带来的思维方式，嘿，我们是不是变得太自满了，或者是时候了。\n\nLenny (28:46):\n这是一个非常好的提醒。有没有你这样做的例子，或者你参与的某个项目，你让公司承诺了某件事，可能本来会受到颠覆者的威胁，或者只是看到这种情况在公司发生？有没有想到的具体项目或投资？\n\nShweta Shrivastava (29:02):\n在 Amazon，我是第一个 PM，然后我推动了围绕它的团队，开发了一个叫 Honey Code 的无代码应用开发平台。那是一个全新的服务。Amazon 之前从未涉足过那个领域。它更注重基础设施，这是团队开发的第一个此类服务。这在我的职业生涯中多次上演，所以我非常相信在别人颠覆你之前先颠覆自己。\n\nLenny (29:33):\n你认为最被低估的 PM 技能是什么？你建议人们，也许特别是职业生涯早期的人，应该专注于哪些他们可能没有想到的技能？\n\nShweta Shrivastava (29:42):\n我认为倾听和同理心是最重要的。\n\n有推荐的朋友，请在评论区留下建议。\n\nShweta Shrivastava (39:01):\n拜托了。\n\nLenny (39:01):\n那么，在你们团队的产品开发流程中，有什么相对小的改变带来了巨大的影响？\n\nShweta Shrivastava (39:09):\n我不会说这是一个产品开发流程，尽管在我职业生涯的不同阶段，我确实建立了不同类型的流程和工具来帮助改进产品开发。但我想给你分享一个有趣的做法，我在之前的公司经常使用，在 Waymo 这里我用的是它的另一种形式，我把它叫做\"七封邮件规则\"。如果一个邮件线程里已经有七封邮件了，你们还没解决问题，那就直接打电话给对方，或者找个会议室，现场解决。\n\n(39:43):\n那些冗长的邮件往来既不收敛也没有进展，我觉得是在浪费很多人的时间。所以我的原则是，你要有个限度。Waymo 是个更大的公司，所以这个限度大概是 10 封邮件，但如果你在 X 封邮件内还没解决问题，请直接打电话，或者进会议室把它解决掉。\n\nLenny (40:04):\n我喜欢这个。这个想法是，如果是你和那个人来回七次就算七封邮件吗？\n\nShweta Shrivastava (40:09):\n对。或者所有人都在来回讨论，然后又加更多人进来，然后每个人都插话，但这事到底要往哪儿走？\n\nLenny (40:21):\n很喜欢。最后一个问题。如果有人要乘坐 Waymo，有什么小贴士能让他们获得很棒的体验？\n\nShweta Shrivastava (40:29):\n带上你最喜欢的播放列表，坐下来享受旅程。\n\nLenny (40:33):\n太好了。我乘坐的时候，打开了一些爵士乐，外面在下雨，非常惬意。\n\nShweta Shrivastava (40:39):\n但你真的用了那个功能吗？如果你有 Google 账号，你得下载 Google Assistant，然后你就可以在车里播放你的播放列表。\n\nLenny (40:49):\n这很酷。没有，我只是选了里面的一个电台，就是爵士音乐。\n\nShweta Shrivastava (40:52):\n好的，明白了。\n\nLenny (40:39):\n是的。好的，太棒了。希望我有一天能再坐一次。\n\nShweta Shrivastava (40:56):\n你应该的。\n\nLenny (40:57):\nShweta，这太精彩了。我要开始收拾行李去 Phoenix 了。我要把车卖了。一切都要改变了。\n\nShweta Shrivastava (41:04):\n这正是我们希望看到的。\n\nLenny (41:07):\n这就是你的 KPI。再次感谢你来到这里。最后两个问题，如果大家想了解更多、联系你、问你一些问题，或者想申请加入 Waymo（如果你们在招人的话），可以在哪里找到你？听众怎样能帮到你？\n\nShweta Shrivastava (41:20):\n你可以在 LinkedIn 上找到我。如果你对 Waymo 的机会感兴趣，可以去 Waymo 的招聘网页。你会看到所有的开放职位。如果是产品管理相关的职位，也可以在 LinkedIn 上直接联系我。听众怎么帮到我？我想说，嘿，在 Phoenix 或者 San Francisco 注册乘坐，LA 开放的时候也可以，给我们反馈。\n\nLenny (41:43):\n太好了。Shweta，再次感谢你的到来。\n\nShweta Shrivastava (41:47):\n谢谢。很高兴有这次对话。\n\nLenny (41:50):\n大家再见。非常感谢收听。如果你觉得这期内容有价值，可以在 Apple Podcast、Spotify 或你喜欢的播客应用上订阅节目。也请考虑给我们评分或留下评论，这真的能帮助其他听众找到这个播客。你可以在 lennyspodcast.com 找到所有往期节目或了解更多关于节目的信息。下期再见。",
  "chunks_count": 5
}