{
  "guest": "Teaser_2021",
  "en": "Greg Isenberg (00:00):\nI'm Greg Isenberg and I build community. I'm the CEO of Late Checkout, an agency, a studio, a fund where we build some of the most popular internet communities. I'm also an advisor to Reddit.\n\nSahil Bloom (00:14):\nI'm Sahil Bloom. I'm an investor, creator, entrepreneur, writer. I also gave up a grand slam on ESPN in 2012, and I am still waiting for it to land. What is The Room Where it Happens? The Room Where it Happens is the place where the insights are generated. This is the place where the conversations happen, where ideas are batted around, debated, fought over. This is where things actually get created, where you start to have those seeds that are planted and where things are really built. That is the room. It's traditionally been closed. We're opening the door to it. We want you to be here with us as that happens.\n\nGreg Isenberg (00:52):\nIt's a place where we could have honest conversations about how hard startups are, what's interesting to us, how we can collaborate, how we can build businesses together and what the next big thing is. That's what The Room Where it Happens is.\n\nSahil Bloom (01:09):\nIf this podcast were available five years ago for me, I think I would've meaningfully accelerated the trajectory of my own life and my career. And part of that would've been the insights generated. The things I learned from actually listening to people. But the biggest part of it would've been the people I met. The relationships I built with other community members with the hosts, with the guests. That is what is the force multiplier for your career, those networks, how that compounds over time, just as well as any financial investment. That is what I would've gotten out of it.\n\nGreg Isenberg (01:39):\nI probably would've met my co-founder. I probably would've met my early teammates. I probably would've found community. I would be 25 times more informed and 50 times more wealthy. That would've just supercharged my career.\n\nSahil Bloom (01:58):\nGreg and I met in The Room Where it Happens. We met through the confluence of a bunch of chance events. We were in a group text thread together with a handful of friends and became as close as we are today because of that. It was The Room Where it Happens. All of these ideas were being generated and that was what sparked us, originally, to start thinking about this and thinking about how we could scale this so that more of you could be a part of what we had experienced and what we had benefited from.\n\nGreg Isenberg (02:27):\nThe moment that changed my mind about business and opportunity was the first time I ever went to Silicon Valley. I was reading up about all these entrepreneurs, all these investors on places like TechCrunch. And I landed and I expected them to be incredibly great, so much different from you and I. And I started having conversations with them and I realized they weren't smarter than us. They might have had better connections, more money, gone to better schools, but that was it. That was when I realized I could do anything.\n\nSahil Bloom (03:03):\nSo a moment that changed my mind about all of this, about business, opportunity, everything, I got invited by a mentor to go to a fundraiser event. I was 24. I was fresh out of school, very green. And I went to this event. There were all these amazing people there, really impressive people that I was, frankly, quite intimidated by. And I was in these conversations with them and just very quickly realized that there was nothing different about them versus me, but they were in these rooms constantly. They were around different, interesting people. They were having these conversations and that was what was making them different. They were able to generate these insights because they were in these room. And that was the moment I realized I had to just find a way to be in those rooms.\n\nGreg Isenberg (03:49):\nThe gap between what people think business is and what actually happens is what Scott Belsky calls the messy middle. Think of The Social Network, the movie. Mark Zuckerberg starts Facebook and then all of a sudden it's massive. It's this romantic idea that people have about startups and entrepreneurship. In reality, the messy middle, the time in between starting and the outcome is 99% of the process of business and startups and entrepreneurship. And I actually find that messy middle to be the most amount of fun. It's when you rise up, it's when you fall down, it's when you zig and it's when you zag.\n\nSahil Bloom (04:35):\nSo in my mind, the biggest gap between what people think business is versus what it really is, is that aspect of just crawling through the river of shit that exists between where you start and where you finish. It's like The Shawshank Redemption. You got to just go through that period. And to me, that's getting up every day and just getting punched in the gut over and over and over again, and being willing to get up and continue to push through and continue to work with your team, solicit feedback, work with others and just get through it. But that willingness to get punched in the face, to get knocked down and to get back up, no one talks about that. Everyone talks about the successes. You love the glamor you love when someone rings the bell at the New York Stock Exchange, when they IPO, they're billionaire, it's great.\n\n(05:23):\nNo one talks about that middle time when you're just getting punched over and over and over again. What frustrates me most about the current state of podcasts is just that it's one sided. It all ends as soon as you finish the conversation during the interview. It's an interview, you talk to someone, you ask them questions and then it ends and that's it. That's all you get from them. And they might have said something amazing that intrigued you, that sparked your interest. You want to follow up, you want to dig deeper, but that's it. That's all you get and it's over. And so when I think about the opportunity that exists, it's changing that. Fundamentally flipping it on its head, making it a conversation, following up, digging deeper, going further with all the insights. That's how we take this entire thing to a whole new level.\n\nGreg Isenberg (06:08):\nI believe the current state of podcasting sucks. A few people have microphones and it's just not fair. What if you allowed a bunch of people to have microphones so they could connect, so they can collaborate so that they can build community. And that's what we're trying to do with The Room Where it Happens. Yes, we're in the room and we have some microphones, but we're also inviting you in. We want you to ask questions. We want to collaborate with you. We want to build businesses with you. And that's why I wanted to create a new, more modern way of podcasting. What am I most excited about with this show and community?\n\nSahil Bloom (06:46):\nIt has to be seeing the amazing things that come out of this community. It has to be seeing all of you going off and having these great experiences, having new insights that come from it, starting new things, failing, succeeding, all of that. And what it's going to create out in the world is what I'm most excited about. We get to sit here, have conversations. We get to hang out with friends, talk to some amazing guests, but the thing that's going to be best is when we see you take that and run with it 100 times over to create something much bigger than what we are doing here.\n\nGreg Isenberg (07:20):\nWatching where you are today and where you're going to be tomorrow and where you're going to be a week from now, a month, a year, 10 years. We're in this for the long game. And what excites me about... I mean, the reason why I got into community was because I love seeing people progress, advance, do big things. And I know that being a part of The Room Where it Happens, good things will happen to you.\n\nSahil Bloom (07:47):\nSo how are we going to ensure this is different than everything else out there? Two ways. Number one, alcohol. We're going to get everyone really drunk with us and it's going to be fun and we're going to get them loose. Because they're not going to be having the same conversation they're having on to every single other podcast, because they're going to be sitting there drinking with us and it's going to be fun. So that's number one. Number two, we want to learn from you. We want to get better at this. We're in it for the long game. This isn't one episode, this isn't one season. We're going to be doing it. So when you're hearing things, if you want us to improve on stuff, if you have ideas, episodes, be a part of it with us, tell us, message us. You're in the Discord, be there with us, help us improve as we grow, and we'll make sure that it is the best thing that we can possibly create.\n\nGreg Isenberg (08:28):\nAnd you're going to keep us on us. You're going to be in our Discord. You're going to be in our community. And if anything feels not authentic, not great, we're in this together, and we want to make this as authentic as possible.\n\n",
  "zh": "**Greg Isenberg (00:00):**\n我是 Greg Isenberg，我是一名社区建设者。我是 Late Checkout 的 CEO，这是一家代理机构，也是工作室和基金，我们致力于打造互联网上最受欢迎的一些社区。我也是 Reddit 的顾问。\n\n**Sahil Bloom (00:14):**\n我是 Sahil Bloom。我是投资人、创作者、创业者和作家。顺便提一句，2012 年我在 ESPN 上被打出一记大满贯全垒打，到现在我还在等那颗球落地呢。什么是 The Room Where it Happens？这是一个诞生洞察的地方。在这里，对话自然发生，各种想法相互碰撞、辩论、甚至激烈交锋。这里是真正创造事物的地方，是播下种子并构建未来的地方。这就是那个“房间”。传统上这扇门是紧闭的，但现在我们正在把它打开。我们希望在这一切发生时，你也能和我们在一起。\n\n**Greg Isenberg (00:52):**\n在这里，我们可以坦诚地交流创业到底有多难，什么是我们感兴趣的，我们如何协作，如何共同建立业务，以及下一个风口是什么。这就是 The Room Where it Happens。\n\n**Sahil Bloom (01:09):**\n如果五年前能有这档播客，我想我的人生和职业轨迹会得到显著的加速。一部分原因在于这里产生的洞察，在于真正倾听他人所学到的东西。但更重要的部分在于遇到的人——与其他社区成员、主持人、嘉宾建立的关系。这才是你职业生涯的“力量倍增器”，这些人际网络会像任何金融投资一样，随着时间产生复利效应。这本该是我能从中得到的收获。\n\n**Greg Isenberg (01:39):**\n我可能会因此遇到我的 Co-founder，遇到我的早期团队成员，找到归属的社区。我的信息量会是现在的 25 倍，财富会是 50 倍。那绝对会让我的职业生涯像加了涡轮增压一样飞速发展。\n\n**Sahil Bloom (01:58):**\nGreg 和我就是在这个 The Room Where it Happens（发生的房间）里相遇的。我们通过一系列机缘巧合相识。当时我们在同一个群聊里，有几个共同朋友，正是因为那样，我们才变得像今天这样亲密。那就是当时的“房间”。所有的想法都在那里产生，这也最初激发了我们思考：我们如何能把这种模式规模化（Scale），让更多人能参与进来，体验我们所经历和受益的一切。\n\n**Greg Isenberg (02:27):**\n改变我对商业和机会看法的时刻，是我第一次去硅谷的时候。我之前在 TechCrunch 这种地方读过关于这些创业者和投资人的故事。当我落地时，我预期他们会是那种极其伟大、跟我们截然不同的人。但当我开始和他们交谈时，我意识到他们并没有比我们更聪明。他们可能有更好的人脉，更有钱，上过更好的学校，但仅此而已。那一刻我意识到，我可以做任何事情。\n\n**Sahil Bloom (03:03):**\n让我改变对商业、机会以及一切看法的时刻是这样的：一位导师邀请我去参加一个筹款活动。当时我 24 岁，刚离开学校，非常青涩。我去了现场，那里全是了不起的人，坦白说，我被这种阵仗吓到了。但在和他们的谈话中，我很快发现他们和我并没有本质的区别，唯一的不同是他们经常身处这些“房间”里。他们周围围绕着各种有趣的人，进行着这些对话，这才是让他们与众不同的原因。他们能产生这些洞察，是因为他们身在其中。那一刻我意识到，我必须想办法进入那些房间。\n\n**Greg Isenberg (03:49):**\n人们想象中的商业与实际情况之间的差距，就是 Scott Belsky 所说的“混乱的中间阶段”（Messy Middle）。想想电影《社交网络》，Mark Zuckerberg 创办了 Facebook，然后突然间它就变成了庞然大物。这是人们对创业公司的浪漫想象。实际上，这个“混乱的中间阶段”——也就是从开始到结果之间的这段时间——占据了商业、创业过程的 99%。而且我实际上觉得这部分是最有趣的。这是你崛起的时候，跌倒的时候，迂回试探、曲折前行的时候。\n\n**Sahil Bloom (04:35):**\n在我看来，人们对商业的想象与现实之间最大的鸿沟，就是必须像《肖申克的救赎》里那样，爬过那条污秽不堪的河流才能到达终点。你必须经历那段时期。对我来说，那就是每天醒来，感觉肚子上一次又一次地挨重拳，但你必须愿意站起来，继续推进，继续与团队合作，寻求反馈，与他人共事，以此熬过难关。但是，那种愿意被打脸、被击倒然后重新站起来的精神，没人谈论这个。每个人都在谈论成功。大家喜欢光鲜亮丽，喜欢看人在纽交所敲钟，看公司 IPO，看人成为亿万富翁，这很棒。\n\n**(05:23):**\n但没人谈论那段你一次次遭受重击的中间时期。目前播客最让我沮丧的一点是，它们是单向的。采访一结束，对话就停止了。这只是个采访，你跟人聊天，问问题，然后结束，仅此而已。这就是你能得到的全部。嘉宾可能说了一些让你着迷、激发你兴趣的惊人观点，你想跟进，想深挖，但没了，一切都结束了。所以当我思考现存的机会时，我认为是改变这一点。从根本上彻底颠覆它，让它变成一场持续的对话，去跟进，去深挖，去延展那些洞察。这就是我们将整个事情提升到一个全新水平的方式。\n\n**Greg Isenberg (06:08):**\n我认为目前的播客现状糟透了。只有少数人拥有麦克风，这很不公平。如果你让更多人拥有麦克风，让他们去连接，去协作，去建立社区，会怎么样？这就是我们试图通过 The Room Where it Happens 做的。是的，我们在房间里，我们有麦克风，但我们也邀请你进来。我们要你提问，要与你协作，要和你一起建立业务。这就是为什么我想创造一种新的、更现代的播客方式。关于这个节目和社区，我最兴奋的是什么？\n\n**Sahil Bloom (06:46):**\n肯定是可以见证这个社区里涌现出的那些惊人的事物。看到你们所有人走出去，获得很棒的经历，产生新的洞察，开启新的项目，无论是失败还是成功，所有这一切。我最兴奋的是这将给世界带来什么。我们坐在这里对话，和朋友闲聊，与精彩的嘉宾交流，但最棒的事情将是我们看到你们把这些内容拿去，以百倍的努力付诸实践，创造出比我们在这里所做的宏大得多的事物。\n\n**Greg Isenberg (07:20):**\n见证你今天的样子，明天的样子，以及一周、一个月、一年乃至十年后的样子。我们着眼于长线游戏。让我兴奋的是……我的意思是，我投身社区领域的原因就是我喜欢看到人们进步、成长、做大事。我知道，成为 The Room Where it Happens 的一部分，好事就会降临到你身上。\n\n**Sahil Bloom (07:47):**\n那么，我们要如何确保这与外面的其他东西不同呢？两点。第一，酒精。我们要让每个人和我们要喝个痛快，这会很有趣，我们会让大家放松下来。因为当嘉宾坐在这里和我们喝酒时，他们就不会重复在其他播客上说过的那些套话，这会很有趣。这是第一点。第二，我们想向你们学习。我们想做得更好。这是长期的，不是一集或一季。所以当你听到某些内容，如果你希望我们改进，如果你有想法、想要某种剧集，请参与进来，告诉我们，给我们发消息。你们都在 Discord 里，和我们在一起，帮助我们在成长中改进，我们会确保把它打造成我们能做出的最好的东西。\n\n**Greg Isenberg (08:28):**\n你们要监督我们保持真诚。你们会在我们的 Discord 里，在我们的社区里。如果有什么感觉不真实、不够好，我们是一条船上的，我们要把这件事做得尽可能真实。",
  "chunks_count": 1
}