{
  "guest": {
    "name": "Ada Chen Rekhi",
    "title": "Co-founder & Executive Coach",
    "company": "Notejoy"
  },
  "keyTakeaways": [
    "Use 'Curiosity Loops' to make better decisions by asking specific, unbiased questions to a curated group of trusted peers.",
    "Apply the 'Explore and Exploit' framework to your career: optimize for variety and learning in the early stages (explore), and depth and leverage in later stages (exploit).",
    "Avoid the 'Boiling Frog' syndrome by constantly evaluating if your current role is providing learning value or if you are victim to inertia.",
    "Define your personal values to create an 'inner scorecard' rather than relying on an 'outer scorecard' (status, money, titles) for career satisfaction.",
    "Practice 'Eating Your Vegetables' by forcing exposure to uncomfortable but necessary skills (like networking or content creation) 10-12 times until they become manageable.",
    "Most professionals do not need a long-term executive coach; often a specific skill coach, a peer group, or a 'curiosity loop' is more effective.",
    "When receiving feedback, distinguish between the quality of the work and personal attacks, especially when working with close friends or partners.",
    "Women and minorities in tech often miss 'unwritten rules' of the game because peers are afraid to give honest feedback on things like executive presence."
  ],
  "methodologies": [
    {
      "name": "Curiosity Loops",
      "category": "career-leadership",
      "summary": "A structured approach to gathering contextual advice by soliciting feedback from a small, curated group of people using specific, unbiased questions.",
      "principles": [
        "Ask a specific, non-biased question (don't reveal your own opinion first).",
        "Curate the right group: Subject Matter Experts and people who know you personally.",
        "Keep the ask lightweight to ensure high response rates.",
        "Close the loop by processing the data, making a decision, and thanking the contributors."
      ],
      "quote": "A curiosity loop is essentially going to a whole bunch of people... and asking them, 'Hey, here are nine topics... What are two or three of the topics that resonate with you and why?'"
    },
    {
      "name": "Explore and Exploit Framework",
      "category": "career-leadership",
      "summary": "A career strategy model adapted from computer science and growth marketing that dictates when to broaden experiences versus when to deepen expertise.",
      "principles": [
        "Explore Mode: In early career, maximize for variety of experiences and hypothesis testing to find fit.",
        "Exploit Mode: Once a strong fit is found, maximize leverage and go deep into that specific domain.",
        "Prioritize learning over titles or compensation during the exploration phase.",
        "Be willing to leave a 'good' situation if the learning curve flattens (don't be the boiling frog)."
      ],
      "quote": "It really comes down in a nutshell to this career concept of explore and exploit... You're either in a mode of explorer where you have a bunch of unknowns... Or you're exploiting, where you actually have found something that's really rich."
    },
    {
      "name": "Values-Based Inner Scorecard",
      "category": "career-leadership",
      "summary": "A decision-making framework that uses a stack-ranked list of personal values to evaluate career opportunities, counteracting the pressure of external validation.",
      "principles": [
        "Identify and stack rank core personal values (e.g., adventure, autonomy, relationships).",
        "Use these values to filter major decisions, distinguishing between what looks good externally vs. what feels good internally.",
        "Recognize the 'Ego Monster' (outer scorecard) and consciously choose alignment with self.",
        "Re-evaluate values periodically as life stages change."
      ],
      "quote": "I think that's a terrible trap that we should all try to avoid... getting to that next level where it's usually a mix of career success, but also meaningfulness and alignment in the work that we're doing with our values."
    }
  ],
  "filename": "Ada Chen Rekhi"
}