{
  "guest": {
    "name": "Adam Fishman",
    "title": "EIR & Program Partner",
    "company": "Reforge",
    "background": "Former CPO at Imperfect Foods, VP of Product/Growth at Patreon, VP of Growth at Lyft. Expert in growth leadership and hiring."
  },
  "episodeSummary": "Adam Fishman discusses his comprehensive Growth Competency Model for hiring and evaluating talent, explains why onboarding is a critical retention lever rather than just conversion, and shares his 'PMF' framework for evaluating potential employers.",
  "methodologies": [
    {
      "name": "The Growth Competency Model",
      "category": "Talent & Leadership",
      "summary": "A comprehensive framework for evaluating growth practitioners across four key dimensions to ensure a balanced team, rather than hunting for a non-existent 'unicorn' individual.",
      "principles": [
        "Don't look for one person who is an 11/10 in everything.",
        "Balance skills across the team to cover gaps.",
        "Use the model to give concrete feedback (e.g., 'improve loop modeling' vs 'be more strategic')."
      ],
      "problemItSolves": "Founders hiring the wrong growth profile (e.g., seeking a silver bullet) and lack of canonical standards for growth careers.",
      "whenToUse": "During hiring to define role requirements, or during performance reviews to identify skill gaps.",
      "commonMistakes": "Hiring a senior strategist when you need an executor (or vice versa); failing to test for basic execution skills.",
      "quote": "The goal of the competency model is not to find a unicorn human being... The goal is to create a well-rounded team.",
      "realWorldExample": "Hiring Ben Lauzier at Lyft (strong execution/customer knowledge) vs. Sean at Patreon (internal transfer with deep customer context).",
      "visualizationType": "MindMap",
      "visualizationData": {
        "centralConcept": "Growth Competency Model",
        "branches": [
          {
            "name": "Growth Execution",
            "subBranches": [
              "Channel Fluency",
              "Experimentation",
              "Productizing Learnings"
            ]
          },
          {
            "name": "Customer Knowledge",
            "subBranches": [
              "Data Fluency/Instrumentation",
              "User Psychology",
              "Narrative/Creative Approach"
            ]
          },
          {
            "name": "Growth Strategy",
            "subBranches": [
              "Growth Loop Modeling",
              "Capital Allocation/Forecasting",
              "Prioritization/Roadmapping"
            ]
          },
          {
            "name": "Communication & Influence",
            "subBranches": [
              "Strategic Communication",
              "Team Leadership",
              "Stakeholder Management"
            ]
          }
        ]
      }
    },
    {
      "name": "Opinionated Defaults",
      "category": "Product Design / Onboarding",
      "summary": "A product design principle where the platform uses data to pre-select the best choices for the user, making it 'hard to do the wrong thing' and 'easy to do the right thing.'",
      "principles": [
        "Identify high-propensity behaviors using data.",
        "Set those behaviors as the default state.",
        "Add friction to changing the default if the change leads to lower success."
      ],
      "problemItSolves": "User paralysis during onboarding and users setting themselves up for failure by making suboptimal configuration choices.",
      "whenToUse": "Designing complex setup flows (like creator pages or hosting settings) where users lack the expertise to choose correctly.",
      "commonMistakes": "Offering a 'blank slate' or 'neutral' setup; assuming more choice equals better user experience.",
      "quote": "Making it hard to do the wrong thing... and easy to do the right thing but not eliminating choice.",
      "realWorldExample": "Patreon defaulting creators to a 3-tier pricing model (proven to work) rather than 1 tier or 40 tiers; Airbnb defaulting hosts to 'Instant Book'.",
      "visualizationType": "DosDonts",
      "visualizationData": {
        "comparisonTopic": "Designing User Configuration",
        "dos": [
          "Do: Pre-select options correlated with high retention.",
          "Do: Add friction (warnings/steps) when users deviate to suboptimal settings.",
          "Do: Base defaults on aggregate success data (e.g., top 10% of users)."
        ],
        "donts": [
          "Don't: Present a blank canvas/empty state.",
          "Don't: Treat all configuration options as equally valid.",
          "Don't: Force users to 'guess' the right settings without guidance."
        ]
      }
    },
    {
      "name": "PMF for Candidates",
      "category": "Career Strategy",
      "summary": "A decision-making framework for job seekers to evaluate potential employers based on three non-negotiable pillars: People, Mission, and Financials.",
      "principles": [
        "Time is your scarcest resource; invest it like a VC invests money.",
        "Do not settle for 2 out of 3.",
        "Conduct 'due diligence' including backchannel references on future bosses."
      ],
      "problemItSolves": "Joining a company that looks good on paper but has a toxic culture, no runway, or a mission you don't care about.",
      "whenToUse": "When evaluating a job offer or deciding between multiple companies.",
      "commonMistakes": "Shortcuting criteria; getting dazzled by the brand but ignoring the people or financial health.",
      "quote": "You should have a set of criteria that you are unapologetically rigorous around.",
      "realWorldExample": "Adam's mistake at Imperfect Foods (Great Mission/Financials, but 'People' aspect failed due to C-suite infighting).",
      "visualizationType": "Scorecard",
      "visualizationData": {
        "evaluationTarget": "Company Evaluation (PMF)",
        "metrics": [
          {
            "category": "People",
            "criteria": "Can I have hard conversations? Do I respect the leadership?",
            "weight": "High"
          },
          {
            "category": "Mission",
            "criteria": "Does the company improve lives? Is the outcome worth the effort?",
            "weight": "High"
          },
          {
            "category": "Financials",
            "criteria": "Fiscal discipline, runway, and sustainable unit economics.",
            "weight": "High"
          }
        ],
        "scoringSystem": "Pass/Fail (Must have all 3)"
      }
    }
  ],
  "filename": "Adam Fishman"
}