{
  "guest": {
    "name": "Adam Grenier",
    "title": "Advisor & Investor",
    "company": "Reforge / A16Z (Scout) / Self-Employed",
    "background": "Former Head of Growth Marketing & Innovation at Uber, VP of Product & Marketing at Lambda School, and VP of Marketing at Masterclass. Currently advises startups and invests."
  },
  "episodeSummary": "Adam Grenier joins Lenny to discuss the evolution of growth marketing, offering a framework for evaluating emerging acquisition channels like TikTok or influencers. He defines the 'Growth CMO' role, contrasting it with traditional marketing leadership, and emphasizes the integration of product and marketing. The conversation also covers mental health, distinguishing between burnout and depression in high-pressure tech environments.",
  "methodologies": [
    {
      "name": "Emerging Channel Evaluation Framework",
      "category": "Growth Strategy",
      "summary": "A three-step framework to determine if a company should invest resources into a new or unproven acquisition channel, focusing on strategic fit, channel maturity, and internal readiness.",
      "principles": [
        "Strategic Overlap: Ensure the channel's strengths align with customer needs and company goals.",
        "Channel DNA: Assess the channel's trajectory, risk of change, and monetization model.",
        "Company DNA: Evaluate internal risk tolerance, resource bandwidth, and the stability of existing channels."
      ],
      "problemItSolves": "Prevents teams from wasting resources on 'hot' new channels (like Clubhouse or VR) that don't align with their business model or stage.",
      "whenToUse": "When deciding whether to launch an experiment on a new platform (e.g., TikTok, Influencers, OTT).",
      "commonMistakes": "Jumping into a channel just because it is trending without checking if it serves the specific customer need; expecting immediate scalable results from an immature platform.",
      "quote": "Start by assuming you no longer have product market fit... It's a different market now... But if you just assume you need to launch a new channel to fix this problem, you're going to be wrong.",
      "realWorldExample": "Spotify and Clubhouse (Good overlap: Audio-first, discovery needs); Hotel Tonight and Facebook Mobile Ads (Monetization alignment).",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "1. Assess Strategic Overlap (Customer Needs + Company Goals + Channel Strengths)",
          "2. Analyze Channel DNA (Trajectory, Volatility, Monetization Model)",
          "3. Evaluate Company DNA (Risk Appetite, Team Bandwidth, Current Channel Mix)"
        ]
      }
    },
    {
      "name": "The Growth CMO Model",
      "category": "Organizational Structure",
      "summary": "A leadership model that shifts marketing from a siloed, campaign-based function to an iterative, data-driven discipline deeply integrated with product development.",
      "principles": [
        "Integration: Marketing and Product are 'married at the hip' rather than separate silos.",
        "Iteration: Shift from long-term rigid planning to agile sprints and rapid feedback loops.",
        "Full-Funnel Experimentation: Apply testing rigor to brand, retention, and creative, not just acquisition.",
        "Data Orientation: Use data to drive decisions across brand investments and customer lifecycle."
      ],
      "problemItSolves": "Resolves the friction between traditional CMOs and modern product-led organizations, where traditional methods fail to adapt to rapid changes.",
      "whenToUse": "When hiring marketing leadership for a tech/product-driven company or restructuring the marketing function.",
      "commonMistakes": "Hiring a traditional brand CMO for an early-stage product company; treating brand as a 'campaign' rather than an iterative investment.",
      "quote": "Product is no longer a part of marketing... they're married at the hip. They're one and the same.",
      "realWorldExample": "Coca-Cola's early coupon strategy (an early example of marketplace dynamics and growth thinking applied to product distribution).",
      "visualizationType": "BeforeAfter",
      "visualizationData": {
        "before": "Traditional CMO",
        "after": "Growth CMO",
        "changes": [
          "Campaign-based → Iterative & Ongoing",
          "Siloed from Product → Integrated with Product",
          "Annual/Multi-year Planning → Agile Sprints",
          "Brand as 'Action' → Brand as Investment Loop",
          "Learning-focused → Performance & Data-driven"
        ]
      }
    }
  ],
  "filename": "Adam Grenier"
}