{
  "guest": {
    "name": "Adam Fishman",
    "title": "EIR at Reforge, Former CPO at Imperfect Foods & VP Product/Growth at Patreon",
    "company": "Reforge"
  },
  "keyTakeaways": [
    "Onboarding is the only part of the product experience that 100% of users encounter, making it critical for delivering on the brand promise.",
    "Effective onboarding drives retention more than just conversion; getting users to habit formation early shifts the entire retention curve.",
    "When hiring for growth, look for 'smart and driven' generalists (execution + customer knowledge) for early roles, and specialists (SEO/Paid) only when scaling specific channels.",
    "Use 'Opinionated Defaults' in product design to guide users toward behaviors that data shows lead to success, rather than offering neutral choices.",
    "Don't redesign onboarding just for the sake of it; only iterate when you have net new insights about customers or the growth model.",
    "Productizing learnings involves taking successful human interventions (like concierge onboarding) and building them into scalable software features.",
    "Candidates should evaluate companies like investors using the 'PMF' framework: People, Mission, and Financials.",
    "Back-channel referencing is as important for candidates interviewing at companies as it is for companies hiring candidates."
  ],
  "methodologies": [
    {
      "name": "The Growth Competency Model",
      "category": "career-leadership",
      "summary": "A comprehensive framework for hiring and evaluating growth talent, breaking down the role into four distinct quadrants to ensure a balanced team rather than hunting for non-existent 'unicorns'.",
      "principles": [
        "Growth Execution: Channel fluency, experimentation, and productizing learnings.",
        "Customer Knowledge: Data fluency, user psychology, and qualitative research.",
        "Growth Strategy: Loop modeling, capital allocation, and prioritization.",
        "Communication and Influence: Strategic communication, team leadership, and stakeholder management."
      ],
      "quote": "The goal of the competency model is not to find a unicorn human being that is an 11 out of 10 on every one of these things, because frankly, that person doesn't exist."
    },
    {
      "name": "Opinionated Defaults",
      "category": "product-strategy",
      "summary": "A design strategy used during onboarding where the product sets default choices (like pricing tiers or settings) based on what data suggests yields the highest success rate for the user.",
      "principles": [
        "Identify behaviors of your most successful users.",
        "Set defaults that mirror those successful behaviors to guide new users.",
        "Make it difficult (add friction) to choose the 'wrong' or less optimal path.",
        "Allow choice, but strongly bias the UX toward the path of highest value."
      ],
      "quote": "Opinionated defaults, which is basically making it hard to do the wrong thing... and easy to do the right thing but not eliminating choice."
    },
    {
      "name": "PMF for Candidates",
      "category": "career-leadership",
      "summary": "A decision-making framework for job seekers to rigorously evaluate potential employers, treating their time investment with the same due diligence as a financial investor.",
      "principles": [
        "People: Can you have productive disagreements with the team? Do you respect the leadership?",
        "Mission: Does the company's success result in a net positive outcome for people beyond just financial gain?",
        "Financials: Does the company practice fiscal discipline and have a realistic view of the future?",
        "Conduct back-channel references on the company and leadership."
      ],
      "quote": "You should have a set of criteria that you are unapologetically rigorous around and you should learn how to evaluate companies against that set of criteria."
    }
  ],
  "filename": "Adam Fishman"
}