{
  "guest": {
    "name": "Adam Grenier",
    "title": "Former Head of Growth Marketing and Innovation",
    "company": "Uber"
  },
  "keyTakeaways": [
    "When market conditions change significantly (like economic downturns), assume you have lost product-market fit and must re-validate your core audience.",
    "Do not invest in emerging acquisition channels (like TikTok or VR) until you have established volume on foundational channels like Google and Facebook.",
    "The 'Growth CMO' is a necessary evolution of the role that applies agile product methodologies to marketing, erasing the silo between the two departments.",
    "Distinguish between burnout and depression: burnout often manifests as exhaustion but retains adaptability, while depression often leads to a loss of adaptability and interest in outside hobbies.",
    "Most emerging channels fail (~95%); limit experiments to under a quarter unless there are strong qualitative signals of momentum.",
    "A channel's monetization strategy is a key indicator of its viability; if your business model aligns with how the channel makes money, you have a strategic advantage.",
    "Product and marketing are no longer separate disciplines; in modern tech, the product itself is the primary driver of marketing."
  ],
  "methodologies": [
    {
      "name": "Emerging Channel Evaluation Framework",
      "category": "growth-metrics",
      "summary": "A strategic framework for deciding when and how to invest resources into new, hype-cycle acquisition channels versus established platforms.",
      "principles": [
        "Assess the overlap between Customer Needs, Company Goals, and the specific Strengths of the Medium.",
        "Analyze Channel DNA: Consider the channel's lifecycle stage, stability, and alignment with your monetization model.",
        "Analyze Company DNA: Evaluate your risk tolerance and whether you have a stable foundation on core channels before diversifying."
      ],
      "quote": "There's very few companies that I recommend saying, 'Yes, go put energy on this brand new channel that you don't know how to scale yet before you've figured out some type of volume on Google and Facebook.'"
    },
    {
      "name": "The Growth CMO Model",
      "category": "career-leadership",
      "summary": "A leadership approach that replaces traditional, campaign-based marketing with data-driven, iterative cycles borrowed from agile product development.",
      "principles": [
        "Treat brand and retention as measurable, iterative experiments rather than static assets.",
        "Operate marketing on sprint cycles similar to product engineering.",
        "Ensure marketing leaders possess T-shaped skills, balancing deep expertise in one area with broad understanding of product and data.",
        "Integrate product and marketing teams completely; product decisions are marketing decisions."
      ],
      "quote": "In my mind, the world that we live in now, product is no longer a part of marketing, but it's actually they're married at the hip. They're one and the same."
    }
  ],
  "filename": "Adam Grenier"
}