{
  "guest": {
    "name": "Aishwarya Naresh Reganti & Kiriti Badam",
    "title": "AI Researcher / Member of Technical Staff (Codex)",
    "company": "Independent / OpenAI"
  },
  "keyTakeaways": [
    "Building AI products requires managing non-determinism in both user input (natural language) and model output (probabilistic generation).",
    "There is a fundamental trade-off between agency and control; as you give an agent more autonomy, you relinquish human control, which requires building trust incrementally.",
    "Do not start with fully autonomous 'V3' agents; begin with 'V1' systems that offer suggestions (high control, low agency) to gather data and calibrate behavior.",
    "Evals are necessary but insufficient; they must be paired with production monitoring and 'vibes' checks because users will interact with the system in unpredictable ways.",
    "The 'One-click agent' is a marketing myth; successful integration requires months of messy data cleaning and workflow mapping.",
    "Pain is the new moat: in an era of cheap building, the competitive advantage lies in the difficult work of implementation, integration, and learning what doesn't work.",
    "Leaders must rebuild their intuition by being hands-on with AI tools daily, as old software intuitions may no longer apply.",
    "Future agents will move from reactive tasks to proactive background work, anticipating user needs and fixing issues before they are flagged."
  ],
  "methodologies": [
    {
      "name": "Continuous Calibration, Continuous Development (CCCD)",
      "category": "execution",
      "summary": "An iterative software development lifecycle specifically designed for AI products to handle non-determinism. It focuses on deploying lower-agency versions to gather data, analyzing emerging error patterns, and recalibrating the system before increasing autonomy.",
      "principles": [
        "Scope capability and curate datasets before building.",
        "Deploy to production to identify emerging patterns that static evals miss.",
        "Continuously calibrate the system based on actual user behavior.",
        "Recalibrate whenever models change (e.g., GPT-4 to GPT-5) or user behavior evolves."
      ],
      "quote": "The idea is just behavior calibration and not losing user trust as you do that behavior calibration."
    },
    {
      "name": "The Agency-Control Graduation Framework",
      "category": "product-strategy",
      "summary": "A strategy for rolling out AI features by starting with high human control and low AI agency, then gradually inverting that ratio as reliability is proven. This prevents eroding trust and allows for data collection on human decision-making.",
      "principles": [
        "V1 (Copilot/Drafting): AI suggests, Human decides (High Control, Low Agency).",
        "V2 (Orchestration): AI executes multi-step workflows with review.",
        "V3 (Autonomy): AI acts independently (Low Control, High Agency).",
        "Use early stages to log human corrections to build the flywheel for automation."
      ],
      "quote": "Every time you hand over decision-making capabilities to agentic systems, you're kind of relinquishing some amount of control on your end."
    },
    {
      "name": "Problem-First Workflow Analysis",
      "category": "product-strategy",
      "summary": "Instead of applying AI generally, teams must obsessively deconstruct specific workflows to identify where AI adds value versus where deterministic code is better. Success comes from deep domain mapping rather than model sophistication.",
      "principles": [
        "Don't let solution complexity distract from the problem definition.",
        "Map taxonomies and data structures explicitly; agents fail on messy enterprise data.",
        "Subject Matter Experts (SMEs) are critical for defining ground truth.",
        "Avoid 'slapping a chat interface' on data; reconstruct the process."
      ],
      "quote": "In all this advancements of the AI, one easy, slippery slope is to keep thinking about complexities of the solution and forget the problem that you're trying to solve."
    }
  ],
  "filename": "Aishwarya Naresh Reganti + Kiriti Badam"
}