{
  "guest": {
    "name": "Alisa Cohn",
    "title": "Executive Coach & Author",
    "company": "Alisa Cohn Coaching",
    "background": "Named the Top Startup Coach in the World at the Thinkers50 Marshall Goldsmith Coaching Awards. Author of 'From Start-Up to Grown-Up'. Coach to leaders at Etsy, Venmo, DraftKings, and The New York Times."
  },
  "episodeSummary": "Executive coach Alisa Cohn breaks down the specific scripts and frameworks for handling the hardest parts of leadership: having delicate conversations, firing employees, aligning with co-founders, and running effective meetings. She emphasizes that a leader's job is to drive results rather than make employees happy.",
  "methodologies": [
    {
      "name": "The Founder Prenup",
      "category": "Team Alignment",
      "summary": "A set of critical discussion topics for co-founders to align on before starting a company (or to revisit periodically), designed to prevent the 65% of startup failures caused by co-founder conflict.",
      "principles": [
        "Clarify core values explicitly (e.g., Excellence vs. Work-Life Balance).",
        "Define the vision of success (e.g., IPO vs. Lifestyle business).",
        "Establish conflict resolution protocols before conflict happens.",
        "Determine decision-making hierarchy (who wins when you disagree)."
      ],
      "problemItSolves": "Prevents co-founder breakups and toxic misalignments that destroy startups later in their lifecycle.",
      "whenToUse": "Before signing incorporation documents, when bringing on a new co-founder, or annually as a relationship health check.",
      "commonMistakes": "Assuming you align because you are friends; avoiding the conversation because it feels awkward or unromantic.",
      "quote": "If you act in a certain way... you think they're acting strangely, but actually, they're acting in accordance with their values.",
      "realWorldExample": "Two co-founders realized too late that one wanted a massive venture outcome and the other wanted a small shop where they knew everyone's name, leading to a painful split.",
      "visualizationType": "Checklist",
      "visualizationData": {
        "title": "Founder Compatibility Checklist",
        "items": [
          "Values Clarification: List top 3-5 core values and compare.",
          "Vision of Success: Define the end game (IPO, Acquisition, Freedom).",
          "Conflict Style: How do we argue? (Seething vs. Exploding).",
          "Decision Protocol: When we disagree, who decides? (Vote, CEO, Expert?).",
          "Culture Definition: Results-driven vs. Family-feel?",
          "Operating Style: Communication preferences and pet peeves."
        ]
      }
    },
    {
      "name": "Delicate Conversation Scripts",
      "category": "Management & Communication",
      "summary": "A structured approach to delivering difficult feedback (performance issues, firing, promotion denial) that relies on observable facts rather than judgment, reducing defensiveness and clarifying expectations.",
      "principles": [
        "Use observable facts/data, not judgments or feelings.",
        "Link the feedback to the employee's career goals or company success.",
        "Manage your own mindset: Do not do it to vent; do it to help them improve.",
        "Prepare for the emotional reaction (defensiveness/tears) and hold the line."
      ],
      "problemItSolves": "Managers avoiding necessary feedback due to fear of upsetting employees, leading to mediocrity and eventual firing surprises.",
      "whenToUse": "Performance reviews, addressing behavioral issues, denying promotions, or firing.",
      "commonMistakes": "Being vague to be 'nice', focusing on personality rather than behavior, or backing down when the employee gets emotional.",
      "quote": "My observation is that you're getting a little bit emotional... but ultimately, we really have to have this conversation.",
      "realWorldExample": "A manager told an employee she wasn't getting a promotion because she lacked specific skills, but framed it as wanting to help her build those skills for the future, maintaining the relationship.",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "title": "The Feedback Script Flow",
        "steps": [
          "1. The Neutral Opening: 'I want to chat with you about [Topic]...'",
          "2. The Observable Evidence: 'What I am hearing/observing is [Specific Fact]...'",
          "3. The Shared Reality: 'We both know that to be successful here [Expectation]...'",
          "4. The Stakes: 'If this doesn't change, [Consequence]...'",
          "5. The Pause: Check for reaction/defensiveness.",
          "6. The Future: 'I want to help you succeed by [Next Steps]...'"
        ]
      }
    },
    {
      "name": "The Meeting Closing Ritual",
      "category": "Productivity & Operations",
      "summary": "A set of three specific questions asked at the very end of every meeting to ensure alignment, accountability, and proper communication flow.",
      "principles": [
        "Meetings are useless if alignment isn't captured immediately.",
        "People leave meetings with different interpretations of what happened.",
        "Decisions must be communicated to those not in the room.",
        "Assigning specific names and dates is non-negotiable."
      ],
      "problemItSolves": "The 'meeting hangover' where people re-meet to discuss the same things because no clear decisions or actions were recorded.",
      "whenToUse": "The last 5-10 minutes of every executive or team meeting.",
      "commonMistakes": "Running the meeting until the last second and skipping the wrap-up; assuming everyone heard the same thing.",
      "quote": "My three questions to end the meeting are: What did we decide here? Who needs to do what by when? And who else needs to know?",
      "realWorldExample": "An executive team goes around the room answering 'What did we decide?' and realizes they have six different answers, forcing them to clarify before leaving.",
      "visualizationType": "Checklist",
      "visualizationData": {
        "title": "The 3-Question Meeting Gate",
        "items": [
          "Question 1: What exactly did we decide here? (Ensure consensus)",
          "Question 2: Who needs to do what by when? (Assign Accountability)",
          "Question 3: Who else needs to know? (Communication Cascade)"
        ]
      }
    }
  ],
  "filename": "Alisa Cohn"
}