{
  "guest": {
    "name": "Alisa Cohn",
    "title": "Executive Coach & Author",
    "company": "Alisa Cohn Coaching"
  },
  "keyTakeaways": [
    "A leader's primary job is not to make employees happy, but to drive results and facilitate success; happiness is often a byproduct of a winning culture.",
    "Difficult conversations should rely on 'observable facts' rather than judgments to reduce defensiveness.",
    "When delivering bad news (like denying a promotion), be direct immediately, explain the reasoning, and provide 'hope for the future' regarding their career path.",
    "Before firing someone, have a 'deal breaker' conversation that sets a clear timeline (e.g., 30 days) for specific changes, ensuring the termination is never a surprise.",
    "Co-founders should establish a 'Founder Prenup' to align on values, conflict resolution styles, and the company vision before starting.",
    "Positive feedback requires the same level of specificity and preparation as negative feedback to be effective and build trust.",
    "Meetings should always end with three specific questions to prevent circular discussions and ensure accountability."
  ],
  "methodologies": [
    {
      "name": "The Founder Prenup",
      "category": "team-culture",
      "summary": "A structured set of conversations and questions for potential co-founders to address before starting a company to prevent future conflict and failure.",
      "principles": [
        "Clarify and compare core values (e.g., excellence vs. work-life balance).",
        "Define what success and the long-term vision look like for each founder.",
        "Discuss personal conflict resolution styles (e.g., immediate discussion vs. processing time).",
        "Establish a decision-making protocol for when disagreements occur."
      ],
      "quote": "65% of startups fail because of conflict with founders or the founding team. So it's really essential to get this right."
    },
    {
      "name": "Delicate Conversation Scripts",
      "category": "career-leadership",
      "summary": "A framework for conducting difficult conversations (feedback, firing, non-promotions) that minimizes emotion and maximizes clarity.",
      "principles": [
        "State the purpose clearly and upfront (e.g., 'I have some disappointing news').",
        "Focus on 'observable facts' and what is being 'heard' rather than personal attacks.",
        "Pause the conversation if the recipient becomes overly defensive or emotional.",
        "End with clear next steps or a 'hope for the future' to maintain the relationship."
      ],
      "quote": "My three questions to end the meeting are: What did we decide here? Who needs to do what by when? And who else needs to know?"
    },
    {
      "name": "The Meeting Closing Ritual",
      "category": "execution",
      "summary": "A specific protocol used at the end of every meeting to ensure alignment, accountability, and communication flow.",
      "principles": [
        "Ask: 'What did we decide here?' to force alignment on the outcome.",
        "Ask: 'Who needs to do what by when?' to assign clear deliverables.",
        "Ask: 'Who else needs to know?' to ensure information cascades correctly to the rest of the organization."
      ],
      "quote": "If you can capture those, articulate those as deliverables, I promise you, you're going to have better meetings."
    }
  ],
  "filename": "Alisa Cohn"
}