{
  "guest": {
    "name": "Ami Vora",
    "title": "Chief Product Officer",
    "company": "Faire",
    "background": "Former VP at Meta (Facebook, WhatsApp, Instagram)"
  },
  "episodeSummary": "Ami Vora shares insights on high-impact product leadership, covering strategies for effective product reviews, the power of metaphors in product alignment, and how to set distinct goals to prevent teams from overlapping. She emphasizes execution over strategy and the importance of 'fascinating' curiosity during disagreements.",
  "methodologies": [
    {
      "name": "The Dinosaur Brain Approach to Product Reviews",
      "category": "Communication Strategy",
      "summary": "A framework for presenting to executives by assuming they have limited cognitive capacity for new details ('brontosaurus brain') and can only hold three facts at a time. The goal is to move from information dumping to making a clear recommendation.",
      "principles": [
        "Executives can only hold ~3 facts in their head at once.",
        "The PM owns the recommendation; the Manager owns the context.",
        "Do not dump data; catalog it, but present only the conclusion.",
        "Use reviews to calibrate on principles, not just single decisions."
      ],
      "problemItSolves": "Overwhelmed executives, stalled decision-making, and product reviews that devolve into data inspection rather than strategic alignment.",
      "whenToUse": "Preparing for product reviews with senior leadership or presenting complex data to stakeholders with limited context.",
      "commonMistakes": "Showing all the work/data to prove you did it; expecting the exec to synthesize the data for you; lacking a strong opinion.",
      "quote": "Assume that executives have a little tiny dinosaur brain... we can really only hold three facts at the same time.",
      "realWorldExample": "When presenting a product change, instead of showing 10 charts, show 1 recommendation supported by 3 key facts, allowing the manager to add context if needed.",
      "visualizationType": "Pyramid",
      "visualizationData": {
        "levels": [
          "Top: The Executive (Dinosaur Brain) - Capacity: 3 Facts. Output: Decision.",
          "Middle: The Manager - Role: Pattern Matching & Context.",
          "Base: The PM - Role: Deep Analysis, Data Synthesis & Recommendation."
        ],
        "label": "Hierarchy of Information Density"
      }
    },
    {
      "name": "Metaphor-Driven Product Alignment",
      "category": "Product Vision & Design",
      "summary": "Using evocative imagery and emotional metaphors to align a team on the 'feeling' of a product. This narrative acts as a decision-making heuristic for designers and engineers when specific requirements aren't defined.",
      "principles": [
        "Define how the product should make the user feel.",
        "Identify a real-world scenario that evokes that feeling (e.g., 'Dolores Park').",
        "Use the metaphor to guide micro-decisions (iconography, copy, latency).",
        "Narrative carries more weight than specs."
      ],
      "problemItSolves": "Inconsistent product experiences, 'strobe light' or 'cold corporate' designs, and the need for micromanagement on small decisions.",
      "whenToUse": "Kickstarting a new feature, defining a product's north star, or aligning cross-functional teams (design, eng, product) on a vibe.",
      "commonMistakes": "Using abstract business goals instead of emotional metaphors; picking a metaphor that doesn't map to the desired user experience.",
      "quote": "If we all agree that the feeling of something should be, I'm sitting in Dolores Park with my friends on a sunny Saturday, then people will just naturally build something that feels more consistent.",
      "realWorldExample": "WhatsApp's metaphor of 'Face-to-Face Communication' (specifically sitting in a family room). This led to features like lightweight join/leave for calls and intimate, non-scheduled interactions.",
      "visualizationType": "MindMap",
      "visualizationData": {
        "centralNode": "Core Metaphor (e.g., Family Living Room)",
        "branches": [
          {
            "category": "Space",
            "concept": "Intimate, Private, Safe"
          },
          {
            "category": "Interaction",
            "concept": "Drop-in/Drop-out, No Scheduling"
          },
          {
            "category": "Design/UI",
            "concept": "Warm, Minimalist, 'The furniture is just there'"
          },
          {
            "category": "Technical",
            "concept": "Instant connection, High reliability (like voice)"
          }
        ]
      }
    },
    {
      "name": "Anti-Toddler Soccer Goal Setting",
      "category": "Organizational Strategy",
      "summary": "A strategy to prevent all teams from chasing the exact same high-level metric (like toddler soccer players chasing one ball). It involves assigning distinct, non-overlapping goals that ladder up to the main outcome, ensuring the 'whole field' is covered.",
      "principles": [
        "Don't assign the top-line metric (e.g., GMV) to everyone.",
        "Play the whole field: Assign distinct input metrics to different teams.",
        "Detangle incentives so teams don't trip over each other.",
        "Ensure individual goals mathematically or logically ladder up to the company goal."
      ],
      "problemItSolves": "Resource contention, teams tripping over each other, neglected product surface areas, and lack of accountability for specific inputs.",
      "whenToUse": "Org design, quarterly planning, and setting OKRs for multiple squads within a larger product organization.",
      "commonMistakes": "Telling every team to 'grow revenue' directly; creating swimlanes that are too narrow and don't impact the customer journey.",
      "quote": "I have three kids, I've watched a lot of toddlers play soccer... everyone's tripping on each other... nobody really gets contact on the ball.",
      "realWorldExample": "Instead of all teams chasing GMV, Team A focuses on 'New User Conversion,' Team B focuses on 'Retention/Reorder Rate,' and Team C focuses on 'Average Order Value' per surface.",
      "visualizationType": "TreeDiagram",
      "visualizationData": {
        "root": "Company Outcome (e.g., Total GMV)",
        "children": [
          {
            "name": "Team A: Acquisition",
            "metric": "New Visitor Conversion Rate"
          },
          {
            "name": "Team B: Retention",
            "metric": "Reorder Frequency"
          },
          {
            "name": "Team C: Marketplace Health",
            "metric": "Average Order Value (AOV)"
          },
          {
            "name": "Team D: Infrastructure",
            "metric": "Site Latency / Uptime"
          }
        ]
      }
    }
  ],
  "filename": "Ami Vora"
}