{
  "guest": {
    "name": "Andy Raskin",
    "title": "Strategic Narrative Consultant",
    "company": "Andy Raskin",
    "background": "Former computer science major and startup founder turned journalist and consultant who helps CEOs align their teams around a strategic narrative."
  },
  "episodeSummary": "In this episode, Andy Raskin breaks down why the traditional 'problem/solution' pitch (the Arrogant Doctor) is failing. He introduces the Strategic Narrative Framework, a five-part structure inspired by movie scripts and exemplified by companies like Salesforce and Zuora. Raskin explains how to frame a product as the key to winning a new game in a shifting world, aligning sales, product, and marketing around a single, high-stakes story.",
  "methodologies": [
    {
      "name": "The Strategic Narrative Framework",
      "category": "Content Strategy",
      "summary": "A five-step storytelling structure that replaces the traditional 'problem/solution' pitch. Instead of positioning the company as a doctor fixing a pain, it positions the buyer as a protagonist navigating a massive shift in the world (Old Game to New Game), creating a movement that aligns product, sales, and marketing.",
      "principles": [
        "Move from 'Arrogant Doctor' (problem/solution) to defining a movement.",
        "Name the undeniable shift in the world, not just the customer's problem.",
        "Create urgency by showing that winning the 'New Game' is life or death.",
        "Position the product features as 'magic gifts' that help the hero overcome obstacles to the new goal.",
        "The narrative must be the strategic north star for the entire company, not just a sales deck."
      ],
      "problemItSolves": "Ineffective sales pitches that focus on features, lack of alignment between product and go-to-market teams, and the inability to differentiate in a crowded market.",
      "whenToUse": "During Series B or scaling phases when founder-led sales are no longer scalable, during a pivot, or when expanding into new product lines (M&A).",
      "commonMistakes": "Copying the Zuora deck template without adapting the story, listing bullet points instead of naming the specific game shift, or failing to make the stakes 'life and death' for the buyer.",
      "quote": "This structure really is about defining a movement, and that's very different from, 'Hey, I'm going to solve your problem.'",
      "realWorldExample": "Zuora framed the world shift as moving from the 'Transaction Economy' (Old Game) to the 'Subscription Economy' (New Game), defining the object as 'Turn customers into subscribers.'",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "1. Name the Shift: Define the transition from the Old Game to the New Game (e.g., Transactions → Subscriptions).",
          "2. Name the Stakes: Show that winners are already playing the New Game and losers are dying (Life or Death).",
          "3. Name the Object: Define the 'Promised Land' or the goal of the New Game (e.g., 'Turn customers into subscribers').",
          "4. Identify Obstacles: Highlight the specific challenges preventing the buyer from reaching the Object.",
          "5. Present the Solution: Introduce the product/features as 'Magic Gifts' to overcome the obstacles."
        ]
      }
    }
  ],
  "filename": "Andy Raskin_"
}