{
  "guest": {
    "name": "Annie Duke",
    "title": "Author, Special Partner",
    "company": "First Round Capital",
    "background": "Former professional poker player (World Series of Poker winner) turned decision science expert and consultant."
  },
  "episodeSummary": "Annie Duke joins Lenny to dismantle common decision-making misconceptions. She explains why intuition needs to be made explicit, why meetings should never be used for idea discovery, and how to shorten 'long' feedback loops in venture capital and product management. She also dives into the psychology of quitting, introducing concepts like kill criteria to overcome sunk cost fallacy.",
  "methodologies": [
    {
      "name": "The Nominal Group Meeting Framework",
      "category": "Decision Making",
      "summary": "A meeting structure designed to eliminate groupthink and coercion by separating the discovery of ideas from the discussion of them. It ensures independent thinking and focuses meeting time solely on areas of disagreement.",
      "principles": [
        "Stop talking to each other so much; get opinions independently.",
        "Meetings are for discussion only, not discovery or deciding.",
        "Eliminate the goal of 'alignment' or 'consensus' as it breeds coercion.",
        "Reflect back what people say to ensure they feel heard (curiosity over coercion)."
      ],
      "problemItSolves": "Prevents the loudest or most confident person from dominating the decision, eliminates groupthink, and surfaces hidden dissent.",
      "whenToUse": "Product roadmapping, forecasting timelines, brainstorming features, or investment decisions.",
      "commonMistakes": "Brainstorming live in the room, letting people interrupt, seeking consensus/alignment as the primary goal.",
      "quote": "The best way to get somebody's opinion is independently of other people's opinions... I want people to stop talking to each other so much.",
      "realWorldExample": "First Round Capital uses a structured forum for evaluating companies where partners vote and rate specific criteria (market, team) independently before discussing.",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "1. Asynchronous Discovery: Send prompt/data to participants before the meeting.",
          "2. Independent Output: Participants generate ideas/forecasts/ranks alone (no reply-all).",
          "3. Aggregation: Leader collates responses and identifies areas of disagreement.",
          "4. The Meeting (Discussion Only): Group convenes solely to discuss the variance in opinions.",
          "5. Decision: Leader makes the call (or voting occurs), often asynchronously after the meeting."
        ]
      }
    },
    {
      "name": "Pre-Mortems with Kill Criteria",
      "category": "Strategic Planning",
      "summary": "An enhancement to the standard pre-mortem that moves beyond simply imagining failure to establishing pre-committed actions based on specific negative signals.",
      "principles": [
        "Thinking about failure isn't enough; you must commit to actions.",
        "Identify signals that correlate with the failure state.",
        "Establish 'Kill Criteria': If I see X signal, I will take Y action.",
        "Use 'waste' as a prospective concept, not retrospective (ignore sunk cost)."
      ],
      "problemItSolves": "Combats the sunk cost fallacy and the tendency to rationalize bad signals once a project is live (the 'climbing Everest in a blizzard' effect).",
      "whenToUse": "Before launching a new product, signing a long-term contract, or pursuing a sales lead.",
      "commonMistakes": "Doing a pre-mortem but not changing the plan, or identifying risks without setting a specific trigger for stopping.",
      "quote": "A pre-mortem, it's great only if you set up kill criteria. Commit to actions that you're going to take if you see those signals.",
      "realWorldExample": "A sales team identified signals for dead deals (e.g., customer only asks about price, won't demo). The kill criteria: If they won't demo, stop pursuing immediately.",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "1. Mental Time Travel: Fast forward and imagine the project has failed.",
          "2. Signal Identification: Identify specific early clues that indicated the failure.",
          "3. Define Kill Criteria: Convert clues into measurable thresholds (e.g., 'CPA > $50').",
          "4. Pre-Commitment: Establish the rule 'If [Criteria] occurs, we [Kill/Pivot]'.",
          "5. Execution & Monitoring: actively scan for the criteria during the project."
        ]
      }
    },
    {
      "name": "Shortening the Feedback Loop",
      "category": "Metrics & Evaluation",
      "summary": "A mental model to debunk the idea that some decisions (like VC investments or long-term product bets) require years to evaluate. It involves identifying short-term proxies that correlate with long-term success.",
      "principles": [
        "There is no such thing as a long feedback loop; it is a choice to wait.",
        "Identify necessary (but not sufficient) conditions for the long-term goal.",
        "Focus on 'intermediate' signals (proxies) that are correlated with the outcome.",
        "Trade psychological safety (not knowing) for decision quality (knowing early)."
      ],
      "problemItSolves": "The inability to learn from decisions in real-time and the tendency to hide behind 'long-term vision' to avoid facing poor performance.",
      "whenToUse": "Venture capital investing, long-cycle R&D, brand building campaigns.",
      "commonMistakes": "Assuming you have to wait for the final exit/outcome to judge decision quality; ignoring interim signals like Series A funding or retention rates.",
      "quote": "The way you choose to shorten the feedback loop is to say, what are the things that are correlated with the outcome that I eventually desire?",
      "realWorldExample": "Instead of waiting 10 years for an exit, First Round looks at whether a seed investment secures Series A funding (a necessary condition) to judge decision quality within ~18 months.",
      "visualizationType": "TreeDiagram",
      "visualizationData": {
        "root": "Ultimate Outcome (e.g., IPO / $1B Exit)",
        "branches": [
          {
            "node": "Intermediate Proxy (Necessary Condition)",
            "details": "e.g., Funding at Series A (18 months)"
          },
          {
            "node": "Short-Term Signal (Correlated Metric)",
            "details": "e.g., Net New ARR, Retention, Hiring Top Talent"
          }
        ]
      }
    }
  ],
  "filename": "Annie Duke"
}