{
  "guest": {
    "name": "Annie Duke",
    "title": "Author, Special Partner",
    "company": "First Round Capital",
    "background": "Former professional poker player (World Series of Poker winner) turned decision science expert and consultant.",
    "background_zh": "前职业扑克牌手（世界扑克大赛冠军），现转型为决策科学专家与顾问。"
  },
  "episodeSummary": "Annie Duke joins Lenny to dismantle common decision-making misconceptions. She explains why intuition needs to be made explicit, why meetings should never be used for idea discovery, and how to shorten 'long' feedback loops in venture capital and product management. She also dives into the psychology of quitting, introducing concepts like kill criteria to overcome sunk cost fallacy.",
  "methodologies": [
    {
      "name": "The Nominal Group Meeting Framework",
      "category": "Decision Making",
      "summary": "A meeting structure designed to eliminate groupthink and coercion by separating the discovery of ideas from the discussion of them. It ensures independent thinking and focuses meeting time solely on areas of disagreement.",
      "principles": [
        "Stop talking to each other so much; get opinions independently.",
        "Meetings are for discussion only, not discovery or deciding.",
        "Eliminate the goal of 'alignment' or 'consensus' as it breeds coercion.",
        "Reflect back what people say to ensure they feel heard (curiosity over coercion)."
      ],
      "problemItSolves": "Prevents the loudest or most confident person from dominating the decision, eliminates groupthink, and surfaces hidden dissent.",
      "whenToUse": "Product roadmapping, forecasting timelines, brainstorming features, or investment decisions.",
      "commonMistakes": "Brainstorming live in the room, letting people interrupt, seeking consensus/alignment as the primary goal.",
      "quote": "The best way to get somebody's opinion is independently of other people's opinions... I want people to stop talking to each other so much.",
      "realWorldExample": "First Round Capital uses a structured forum for evaluating companies where partners vote and rate specific criteria (market, team) independently before discussing.",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "1. Asynchronous Discovery: Send prompt/data to participants before the meeting.",
          "2. Independent Output: Participants generate ideas/forecasts/ranks alone (no reply-all).",
          "3. Aggregation: Leader collates responses and identifies areas of disagreement.",
          "4. The Meeting (Discussion Only): Group convenes solely to discuss the variance in opinions.",
          "5. Decision: Leader makes the call (or voting occurs), often asynchronously after the meeting."
        ]
      },
      "summary_zh": "这是一套旨在消除“群体迷思”和“强制干扰”的会议机制。通过将“观点生成”与“讨论环节”彻底分离，该框架确保了成员的独立思考，并将会议时间聚焦于核心分歧点。",
      "problemItSolves_zh": "避免决策被声音最大或最自信的人主导，消除群体思维，并让潜藏的异议浮出水面。",
      "whenToUse_zh": "产品路线图规划、项目排期预估、功能头脑风暴或投资决策。",
      "commonMistakes_zh": "现场即兴头脑风暴，允许随意打断发言，将寻求共识/对齐作为首要目标。",
      "realWorldExample_zh": "First Round Capital 采用一套结构化的会议流程来评估公司，要求合伙人在展开讨论之前，先针对特定维度（如市场、团队）独立进行投票和评分。",
      "principles_zh": [
        "停止过度交流，坚持独立产出观点。",
        "会议仅用于讨论，而非信息同步或制定决策。",
        "摒弃对“对齐”或“共识”的执念，这只会滋生强制妥协。",
        "复述他人观点以确信其被聆听（保持好奇心，而非施压）。"
      ],
      "name_zh": "The Nominal Group Meeting Framework（名义小组会议框架）"
    },
    {
      "name": "Pre-Mortems with Kill Criteria",
      "category": "Strategic Planning",
      "summary": "An enhancement to the standard pre-mortem that moves beyond simply imagining failure to establishing pre-committed actions based on specific negative signals.",
      "principles": [
        "Thinking about failure isn't enough; you must commit to actions.",
        "Identify signals that correlate with the failure state.",
        "Establish 'Kill Criteria': If I see X signal, I will take Y action.",
        "Use 'waste' as a prospective concept, not retrospective (ignore sunk cost)."
      ],
      "problemItSolves": "Combats the sunk cost fallacy and the tendency to rationalize bad signals once a project is live (the 'climbing Everest in a blizzard' effect).",
      "whenToUse": "Before launching a new product, signing a long-term contract, or pursuing a sales lead.",
      "commonMistakes": "Doing a pre-mortem but not changing the plan, or identifying risks without setting a specific trigger for stopping.",
      "quote": "A pre-mortem, it's great only if you set up kill criteria. Commit to actions that you're going to take if you see those signals.",
      "realWorldExample": "A sales team identified signals for dead deals (e.g., customer only asks about price, won't demo). The kill criteria: If they won't demo, stop pursuing immediately.",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "1. Mental Time Travel: Fast forward and imagine the project has failed.",
          "2. Signal Identification: Identify specific early clues that indicated the failure.",
          "3. Define Kill Criteria: Convert clues into measurable thresholds (e.g., 'CPA > $50').",
          "4. Pre-Commitment: Establish the rule 'If [Criteria] occurs, we [Kill/Pivot]'.",
          "5. Execution & Monitoring: actively scan for the criteria during the project."
        ]
      },
      "summary_zh": "标准“事前验尸”分析的进阶版，它不再仅停留于设想失败场景，而是基于明确的负面信号，制定预先锁定的执行预案。",
      "problemItSolves_zh": "克服沉没成本谬误，以及项目上线后对负面信号进行合理化的倾向（即“暴风雪中强行登顶”效应）。",
      "whenToUse_zh": "在新产品上线、签署长期合约，或跟进销售线索之前。",
      "commonMistakes_zh": "进行了事前验尸却未调整计划，或是识别了风险却未设定明确的叫停触发条件。",
      "realWorldExample_zh": "某销售团队识别出了无效商机的信号（例如：客户只关心价格，不愿看演示）。设定的叫停标准为：如果客户拒绝演示，立即停止跟进。",
      "principles_zh": [
        "仅推演失败是不够的，必须落实具体的行动承诺。",
        "识别与失败状态高度相关的信号。",
        "确立「终止标准」：一旦监测到 X 信号，必须采取 Y 行动。",
        "将「浪费」视为前瞻性而非回溯性的概念（忽略沉没成本）。"
      ],
      "name_zh": "Pre-Mortems with Kill Criteria（设定终止标准的事前验尸）"
    },
    {
      "name": "Shortening the Feedback Loop",
      "category": "Metrics & Evaluation",
      "summary": "A mental model to debunk the idea that some decisions (like VC investments or long-term product bets) require years to evaluate. It involves identifying short-term proxies that correlate with long-term success.",
      "principles": [
        "There is no such thing as a long feedback loop; it is a choice to wait.",
        "Identify necessary (but not sufficient) conditions for the long-term goal.",
        "Focus on 'intermediate' signals (proxies) that are correlated with the outcome.",
        "Trade psychological safety (not knowing) for decision quality (knowing early)."
      ],
      "problemItSolves": "The inability to learn from decisions in real-time and the tendency to hide behind 'long-term vision' to avoid facing poor performance.",
      "whenToUse": "Venture capital investing, long-cycle R&D, brand building campaigns.",
      "commonMistakes": "Assuming you have to wait for the final exit/outcome to judge decision quality; ignoring interim signals like Series A funding or retention rates.",
      "quote": "The way you choose to shorten the feedback loop is to say, what are the things that are correlated with the outcome that I eventually desire?",
      "realWorldExample": "Instead of waiting 10 years for an exit, First Round looks at whether a seed investment secures Series A funding (a necessary condition) to judge decision quality within ~18 months.",
      "visualizationType": "TreeDiagram",
      "visualizationData": {
        "root": "Ultimate Outcome (e.g., IPO / $1B Exit)",
        "branches": [
          {
            "node": "Intermediate Proxy (Necessary Condition)",
            "details": "e.g., Funding at Series A (18 months)"
          },
          {
            "node": "Short-Term Signal (Correlated Metric)",
            "details": "e.g., Net New ARR, Retention, Hiring Top Talent"
          }
        ]
      },
      "summary_zh": "该思维模型旨在破除一种迷思，即认为某些决策（如 VC 投资或长期产品押注）需要数年时间才能验证。其核心在于识别出与长期成功高度相关的短期代理指标。",
      "problemItSolves_zh": "无法从决策中实时获取认知，且习惯以“长期愿景”为挡箭牌，从而逃避面对糟糕的业绩表现。",
      "whenToUse_zh": "风险投资、长周期研发、品牌建设战役",
      "commonMistakes_zh": "误以为必须等到最终结局或产出才能评估决策质量；忽视了 A 轮融资或留存率等阶段性信号。",
      "realWorldExample_zh": "First Round 并没有苦等 10 年直到项目退出，而是将“种子轮投资能否拿到 A 轮融资”（这是一个必要条件）作为指标，在大约 18 个月内评估决策质量。",
      "principles_zh": [
        "不存在所谓的长反馈周期，那只是你选择了等待。",
        "识别达成长期目标的必要（非充分）条件。",
        "聚焦与结果强相关的“中间信号”（代理指标）。",
        "牺牲心理安全感（即“无知”），换取决策质量（即“早知”）。"
      ],
      "name_zh": "Shortening the Feedback Loop（缩短反馈循环）"
    }
  ],
  "filename": "Annie Duke",
  "episodeSummary_zh": "Annie Duke 做客 Lenny 的节目，深度拆解了常见的决策误区。她阐述了为何必须将“直觉”显性化，为何决不能在会议中进行想法探索，以及如何在风险投资和产品管理中缩短漫长的反馈周期。此外，她还深入剖析了关于“放弃”的心理机制，引入了“终止标准（Kill Criteria）”等概念，以帮助克服沉没成本谬误。"
}