{
  "guest": {
    "name": "Asha Sharma",
    "title": "Corporate Vice President of Product, AI Platform",
    "company": "Microsoft",
    "background": "Former COO at Instacart, VP of Product at Meta (Messenger/Instagram Direct), Early employee at Porch Group."
  },
  "episodeSummary": "Asha Sharma discusses the paradigm shift from building products as static artifacts to living organisms in the age of AI. She covers the rise of agentic workflows, the necessity of 'post-training' investment, and how Microsoft structures product planning amidst rapid technological change.",
  "methodologies": [
    {
      "name": "The Seasonal Planning Protocol",
      "category": "Strategy & Operations",
      "summary": "A planning framework designed for the high-velocity AI era where traditional annual or rigid roadmaps fail. It replaces fixed timelines with 'Seasons' defined by secular industry changes, allowing for agility while maintaining a north star.",
      "principles": [
        "Identify the 'Season' based on secular changes (e.g., 'Season of Agents').",
        "Set loose quarterly OKRs to directionalize the team.",
        "Execute in 4-6 week squad-based goals.",
        "Deliberately leave 'slack' in the system for the unplanned and the slope of innovation."
      ],
      "problemItSolves": "The inability to plan accurate long-term roadmaps when underlying technology (like GPT models) changes rapidly.",
      "whenToUse": "In hyper-growth or rapidly evolving industries (like AI) where 6-month plans become obsolete quickly.",
      "commonMistakes": "Adhering to rigid annual plans; filling capacity to 100% without leaving room for new model capabilities.",
      "quote": "We think about it as what season are we in? ... I feel like you have to actually build for the slope instead of the snapshot.",
      "realWorldExample": "Microsoft defining a 'Season of Prototyping' followed by a 'Season of Agents' to align thousands of engineers.",
      "visualizationType": "StepFlow",
      "visualizationData": {
        "steps": [
          "Define the Season (Secular Trend)",
          "Set Loose Quarterly OKRs",
          "Execute 4-6 Week Squad Sprints",
          "Leave Slack for Disruption"
        ]
      }
    },
    {
      "name": "The Organism Conversion Loop",
      "category": "Product Development",
      "summary": "A shift from treating product as a static 'artifact' to a living 'organism' that improves with usage. The core mechanism is a metabolism that ingests data and digests rewards to autonomously improve outcomes.",
      "principles": [
        "Treat the product as a living entity, not a shipped artifact.",
        "Design the 'metabolism': the rate at which the product ingests data.",
        "Implement a rewards model (RLHF/Fine-tuning) to steer outcomes.",
        "Focus on the loop of data ingestion to improved output."
      ],
      "problemItSolves": "Static software that requires manual updates to improve; keeping up with the marginal cost of intelligence dropping to zero.",
      "whenToUse": "Building AI-native products where user interaction data can directly fine-tune model performance.",
      "commonMistakes": "Focusing only on the UI/GUI rather than the data loop; failing to set up observability and evals for the loop.",
      "quote": "The whole KPI is what is the metabolism of a product team to be able to ingest data and then digest the rewards model and then create some sort of outcome.",
      "realWorldExample": "Microsoft's Dragon (for physicians) improving acceptance rates from ~30-60% to 83% by feeding 600k expert-annotated interactions back into the model.",
      "visualizationType": "Cycle",
      "visualizationData": {
        "steps": [
          "Ingest Interaction Data",
          "Digest via Rewards Model",
          "Optimize Outcome",
          "Deploy & Observe",
          "Repeat"
        ]
      }
    },
    {
      "name": "The Platform Fundamentals Pyramid",
      "category": "Platform Strategy",
      "summary": "A hierarchy of platform value that prioritizes 'invisible work' (infrastructure) over visible features. Successful platforms win on reliability and trust before winning on bells and whistles.",
      "principles": [
        "Base Layer: The 'Invisible Work' (Reliability, Privacy, Safety, Data Residency).",
        "Middle Layer: Optimization & Matching (The engine that connects supply/demand or inputs/outputs).",
        "Top Layer: Features & Pixels (The visible UI elements).",
        "Platform success is defined by the strength of the base, not the flashiness of the top."
      ],
      "problemItSolves": "Misallocating resources to shiny features while neglecting the core infrastructure that drives retention and trust.",
      "whenToUse": "When building large-scale platforms, messaging apps, or marketplaces.",
      "commonMistakes": "Thinking features (like 'Dark Mode' or 'Stickers') drive platform success rather than latency, privacy, or matching logic.",
      "quote": "It's often in the invisible work or not the pixels that actually drives that... WhatsApp didn't win because it had stickers... it won on reliability and privacy.",
      "realWorldExample": "WhatsApp winning on reliability and encryption; Porch winning on its matching algorithm rather than its home report UI.",
      "visualizationType": "Pyramid",
      "visualizationData": {
        "levels": [
          "Base: Reliability, Privacy, & Safety (Invisible Work)",
          "Middle: Matching Logic & Optimization Engine",
          "Top: Features, UI, & Pixels"
        ]
      }
    }
  ],
  "filename": "Asha Sharma"
}